Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/conformance_and_extensions.po
Languages: es

source: Conformance and extensions
es: Cumplimiento y extensiones

source: <span class="lead">To maximise the interoperability of data published using the Open Contracting Data Standard we have set out key principles for **conforming** to the standard. These also create space for **extensions** of the standard where particular publisher or user needs require.</span>
es: <span class="lead">Para maximizar la interoperabilidad de los datos publicados utilizando el Estándar de Datos de Contrataciones Abiertas hemos preparado principios claves para **cumplir** con el estándar. Estos principios también dan lugar a las **extensiones** del estándar donde el publicador o las necesidades de los usuarios lo requieran.

source: Conformance
es: Cumplimiento

source: To maximise the interoperability of data published using the Open Contracting Data Standard we have set out key principles for **conforming** to the standard, [based on the Popolo Project](http://www.popoloproject.com/specs/#conformance) approach.
es: Para maximizar la interoperabilidad de los datos utilizando el Estándar de Datos de Contrataciones Abiertas hemos preparado unos principios clave para **cumplir** con el estándar, basándonos en [el Popolo Project](http://www.popoloproject.com/specs/#conformance).

source: A conforming implementation *may* use only a subset of this specification's terms.
es: Una implementación que cumple *puede* usar sólo un subconjunto de los términos de esta especificación.

source: It *must not* use terms from outside this specification's terms where this specification's terms would suffice.
es: Cuando los términos de esta especificación sean suficientes *no debe* usar términos ajenos a éste.

source: Its usage of this specification's terms *must* be consistent with the semantics of those terms.
es: El uso de los términos de esta especificación *deben* se consistentes con la semántica de los mismos.

source: It *may* use terms from outside this specification's terms where this specification's terms are insufficient.
es: *Puede* utilizar términos externos a los de esta especificación cuando los de ésta sean insuficientes.

source: If an implementation serializes to JSON, its serializations *must* [validate](http://ocds.open-contracting.org/validator/) against this specification's JSON Schema.
es: Si una implementación realiza una seriación a JSON, estas seriaciones *debe* [validarse](http://ocds.open-contracting.org/validator/) contra el Esquema JSON de esta especificación.

source: Whenever using terms from outside the OCDS standard, we encourage the publisher or user responsible to consult with the community on the best approach to adopt.
es: Cuando se utilicen términos externos al estándar de OCDS, alentamos a los publicadores o usuarios responsables consultar con la comunidad la mejor manera de usarlos.

source: Extensions
es: Extensiones

source: Extensions to the standard can add new objects and properties to accommodate specific local requirements. An extension should only be created where it is not possible to model the required data using existing terms from the standard.
es: Las extensiones al estándar pueden agregar nuevos objetos y propiedades para alojar requerimientos específicos locales. Una extensión sólo deberá ser creada donde no sea posible modelar los datos necesarios utilizando términos existentes en el estándar.

source: Extensions should be documented and shared so that other publishers and users can draw upon them, and so that extensions can be considered for inclusion in a future version of the standard.
es: Las extensiones deben de documentarse y compartirse para que otros publicadores y usuarios puedan recurrir a ellas y para que se pueda considerar incluir estas extensiones en una versión furuta del estándar.

source: You can find a list of proposed extensions in the [Standard Implementation and Extensions GitHub Repository](https://github.com/open-contracting/implementation-and-extensions/tree/master/proposed_extensions/).
es: Se puede encontrar una lista de extensiones propuestas en el [repositorio de GitHub de Implementación y Extensiones del Estándar](https://github.com/open-contracting/implementation-and-extensions/tree/master/proposed_extensions/).

source: The schema for the standard by default allows for new fields, and does not fail validation of a file which contains unknown fields.
es: El esquema del estándar admite nuevos campos por defecto y no reprobará la validación de un archivo que contenga campos desconocidos.
