Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/identifiers.po
Languages: fr

source: Identifiers
fr: Identifiants

source: Consistent identifiers are essential to help join up open contracting data.
fr: L'utilisation d'identifiants cohérents est essentiel pour aider à joindre des données ouvertes sur la commande publique.

source: The Open Contracting ID (OCID) is a globally unique identifier used to join up data on all stages of a contracting process;
fr: L'identifiant Open Contracting (OCID) est un identifiant global unique utilisé pour joindre des données sur toutes les étapes d'un processus de passation des marchés ;

source: Organisation identifiers are important to know who is involved in each contract;
fr: Les identifiants d'organisation sont importants pour savoir qui est impliqué dans chaque contrat ;

source: Release, tender, award and contract identifiers are important to help cross-reference information.
fr: Les identifiants des livraisons, des appels d'offre et des contrats sont importants pour aider à croiser les informations.

source: Types of identifiers
fr: Types d'identifiants

source: In OCDS there are two kinds of identifiers: globally unique and local.
fr: Dans OCDS, il y a deux types d'identifiants : ceux qui sont uniques et globaux et ceux qui sont locaux.

source: Globally unique identifiers
fr: Identifiants locaux

source: Across the whole universe of OCDS publishers these identifiers should refer to one specific contracting process or organisation.
fr: À travers tout l'univers des fournisseurs de données OCDS, ces identifiants doivent se référer à un processus de passation de marchés spécifique ou à l'organisation.

source: We create globally unique contracting process identifiers by adding a prefix to the internal identifiers held by publishers.
fr: Nous créons des identifiants uniques globaux de processus de passation de marchés en ajoutant un préfixe aux identifiants internes détenus par les fournisseurs de données.

source: Two government publishers (Town A and Town B) number their contracting processes from 0 upwards.
fr: Deux fournisseurs de données publiques (ville A et ville B) numérotent leurs processus de passation de marché de 0 à la suite.

source: Town A publishes information on a contracting process to build a new road. Internally they know this as contract 0005.
fr: La ville A publie des informations sur un processus de passation de marchés pour construire une nouvelle route. En interne, ils savent que c'est le contrat 0005.

source: Town B publishes information on a contracting process to buy textbooks for a school. Internally they also know this as contract 0005.
fr: La ville B publie des informations sur un processus de passation des marchés pour acheter des manuels scolaires pour une école. En interne, ils savent aussi que c'est le contrat 0005.

source: When they publish their OCDS data, each government adds a unique prefix onto their internal identifiers.
fr: Quand ils publient leurs données OCDS, chaque administration ajoute un préfixe unique sur leurs identifiants internes.

source: Now Town A's contracting process has the ```ocid``` of 'ocds-fh349f-0005' and Town B's contracting process has the ```ocid``` of 'ocds-twb234-0005'.
fr: Maintenant, les processus de passation de marchés de la ville A ont l'```ocid``` 'ocds-fh349f-0005' et ceux de la ville B ont l'```ocid``` 'ocds-twb234-0005'.

source: There is now no chance of these getting mixed up in a system which imports data from both towns.
fr: Il n'est maintenant plus possible que ces identifiants sont confondus par un système qui importe les données des deux villes.

source: And, if an independent civil society contract monitoring group want to publish a report about implementation of Town A's road project, or Town B's text-book procurement, they have distinct identifiers they can use in their own data to refer to these.
fr: Et, si un groupe indépendant de la société civile en charge du suivi des marchés veut publier un rapport sur la mise en œuvre du projet de route de la ville A, ou d'un du marché des manuels scolaires de la ville B, ils ont des identifiants distincts qu'ils peuvent utiliser dans leurs propres données pour y faire référence.

source: You can read more about the OCDS approach to identify organisations below.
fr: Vous pouvez en savoir plus sur l'approche OCDS pour identifier les organisations ci-dessous.

source: Local identifiers
fr: Identifiants locaux

source: Not all the identifiers in OCDS need to be globally unique. Most only need to be unique amongst their 'sibling' records.
fr: Pas tous les identifiants dans OCDS ne doivent être uniques au monde. Seulement la plupart d'entre eux doivent être uniques parmi leurs données "frères et sœurs".

source: A release ID must be unique within any release package it appears in;
fr: Un identifiant de livraison doit être unique dans le package de livraison dans lequel il apparait ;

source: A tender, award and contract ID must be unique within the contracting process it appears in;
fr: Les identifiants pour les appel d'offres, les attributions et les contrats doivent être uniques dans le processus de passation de marché dans lequel ils apparaissent ;

source: An item, milestone or document ID must be unique within the array it is part of.
fr: Les identifiants d'un élément, d'une étape ou d'un document doivent être uniques dans l'ensemble de données auquel ils appartiennent.

source: Local identifiers must be used consistently. For example, if an award is given the ID '22' in one release, then the same award must have the same ID (22) in any subsequent releases which contain it.
fr: Les identifiants locaux doivent être utilisés de manière cohérente. Par exemple, si un prix est décerné à l'identifiant '22' dans une livraison, la même attribution doit donc avoir le même identifiant (22) dans toutes les versions ultérieures qui s'y rapportent.

source: Contracting Process Identifier (OCID)
fr: Identifiant de processus de passation de marché (OCID)

source: An Open Contracting ID (OCID) is a **globally unique identifier** for a contracting process. Every OCDS release has an ```ocid```.
fr: Un identifiant Open Contracting (OCID) est un **identifiant global unique** pour un processus de passation de marché. Chaque livraison OCDS a un ```ocid```.

source: It can be used to join up information published at different times, and in different places.
fr: Il peut être utilisé pour joindre des informations publiées à des moments différents et à des endroits différents.

source: Setting the ```ocid``` is usually a simple two step process:
fr: La mise en place de l'```ocid``` est habituellement un processus en deux étapes simples :

source: Identify the best **internal identifier** recorded against the contracting processes being disclosed;
fr: Identifier le meilleur **identifiant interne** avec lequel le processus de passation de marchés est enregistré ;

source: Register an ```ocid``` prefix to prepend to this internal identifier.
fr: Enregistrer un préfixe ```ocid``` à préfixer à cet identifiant interne.

source: In some cases, you may need to consider changes to existing systems to ensure that different systems handling information about your contracting processes have a common internal identifier to draw upon.
fr: Dans certains cas, vous devrez peut-être envisager de modifier les systèmes existants pour veiller à ce que les différents systèmes de gestion de l'information sur vos processus de passation de marchés aient un identifiant interne commun.

source: In Mexico City, each time a tender or direct contract award process is initiated, the department responsible assigns an identifier.
fr: Pour la ville de Mexico, chaque fois qu'un processus d'appel d'offres ou qu'un marché direct est lancé, le ministère responsable attribue un identifiant.

source: These are made up of an identifier for the department responsible for the procurement, a tender number, and the year.
fr: Ceux-ci sont constitués d'un identifiant pour le département responsable du marché, un numéro d'appel d'offres et l'année.

source: For example:
fr: Par exemple :

source: This internal identifier can be exchanged with, and recorded in, any other systems which process information about this contracting process. For example, systems for reporting or recording spending transactions to suppliers.
fr: Cet identifiant interne peut être échangé et enregistré dans tous les autres systèmes qui traitent des informations sur ce processus de passation des marchés. Par exemple, les systèmes de notification ou l'enregistrement des transactions de dépenses aux fournisseurs.

source: Mexico City then registered a prefix with the OCDS helpdesk. They have been given the prefix ‘ocds-87sd3t’ which can be added to their unique process identifiers to give a globally unique ```ocid```. E.g.
fr: Mexico a alors enregistré un préfixe avec l'assistance technique OCDS. Ils ont reçu le préfixe 'OCDS-87sd3t' qui peut être ajouté à leurs identifiants uniques pour donner un ```ocid``` globalement unique. Par exemple :

source: The OCDS prefix itself is made up of two parts: a prefix agency identifier (currently only 'ocds' is used), and a random six-character alphanumeric string generated for each publisher of data.
fr: Le préfixe OCDS lui-même est composé de deux parties: un préfixe identifiant l'agence (actuellement seulement 'OCDS' est utilisé) et une chaîne alphanumérique à six caractères généré de manière aléatoire pour chaque fournisseur de données.

source: The OCID is case sensitive.
fr: L'OCID est sensible à la casse.

source: Registered prefixes
fr: Préfixes enregistrés

source: See the [registration pages](../implementation/registration.md) for details of how to obtain your OCID prefix.
fr: Consultez les [pages sur l'inscription](../implementation/registration.md) pour des détails sur la manière d'obtenir vos préfixes OCID.

source: Prefix are randomly generated lowercase alpha-numberic strings. A prefix is assigned to each organisation that holds the existing internal identifier for a Contracting Processes.
fr: Les préfixes sont générés au hasard des chaînes de caractères alpha-numériques. Un préfixe est attribué à chaque organisation ; il contient l'identifiant interne existant pour les processus de passation.

source: Currently, only the Open Contracting Partnership issues valid prefixes. In future, other organisations may be able to issue prefixes, each with their own prefix agency identifiers.
fr: A l'heure actuelle, seule l'Open Contracting Partnership délivre des préfixes valides. À l'avenir, d'autres organisations pourraient être en mesure d'émettre des préfixes, chacun avec leurs propres préfixes d'identifiants d'agence.

source: You can find a [list of registered prefixes here along with a registration form for creating new prefixes](../implementation/registration.md).
fr: Vous pouvez trouver ici une [liste de préfixes ainsi que le formulaire d'inscription pour la demande de nouveaux préfixes](../implementation/registration.md).

source: The registered prefixes are dumb identifiers. They are not intended to carry any semantics, and their sole purpose is to turn internal identifiers into globally unique identifiers which can be cross-referenced between systems.
fr: Les préfixes enregistrés ne sont pas destinés à porter une sémantique ; leur seul but est de transformer les identifiants internes en identifiants globaux uniques qui peuvent être recoupés entre les systèmes.

source: Publisher namespace
fr: Nommage des fournisseurs de données

source: Earlier versions of this documentation imposed a stricter pattern on how internal identifiers should be combined with the ocid prefix, including a requirement for local namespaces. This requirement has been relaxed in practice and should be considered deprecated.
fr: Les versions antérieures de cette documentation ont imposé un modèle plus stricte sur la façon dont les identifiants internes devraient être combinés avec le préfixe OCID, y compris avec une exigence pour le nommage. Cette exigence a été assouplie dans la pratique et doit être considérée comme obsolète.

source: However, publishers are encouraged to consider whether there are any risks of clashes in local identifiers (e.g. the possibility that two parts of the publishing body might use the same identifier for different contracting processes) and to plan to mitigate this when establishing their own patterns to generate their ```ocid```
fr: Cependant, les producteurs de données sont encouragés à examiner s'il y a des risques de conflits entre les identifiants locaux (par exemple, la possibilité que deux entités au sein du producteur puissent utiliser le même identifiant pour différents processus de passation de marchés) et de prévoir d'harmoniser leurs propres modèles pour générer leur ```ocid```.

source: Organisation IDs
fr: Identifiants d'organisation

source: Reliably identifying the legal entities involved in a contracting process is vital for transparency and accountability, and for carrying out analysis to improve procurement and contract management.
fr: Pouvoir identifier de manière fiable les personnes morales impliquées dans un processus de passation des marchés est vital pour la transparence et la responsabilité, et pour réaliser des analyses qui permettront d'améliorer la commande publique et la gestion des contrats.

source: Publishers should seek to collect and record the **legal identifier** from an official register of any organisations involved in a contracting process (including procuring organisations, bidders and suppliers), and should include this in their OCDS files.
fr: Les producteurs de données devraient chercher à collecter et à enregistrer les **identifiants juridiques** issus d'un registre officiel de toutes les organisations impliquées dans un processus de passation des marchés (y compris les acheteurs, les soumissionnaires et les fournisseurs), et devraient les inclure dans leurs fichiers OCDS.

source: There are two parts to expressing an **organisation identifier** in open contracting data.
fr: Il y a deux composantes de **l'identifiant d'une organisation** dans les données ouvertes sur la commande publique.

source: An **organization register prefix** identifying a **register** in which the organisation is identified
fr: Un **préfixe de registre** identifiant un **registre** dans lequel l'organisation est identifiée.

source: The **existing organizational ID** provided in that public register
fr: L'**identifiant existant de l'organisation** prévu dans ce registre public

source: The **organisation register prefix** for UK Companies House is GB-COH. The organisation **Development Initiatives** has been assigned the company number ‘06368740’ by Companies House. The globally unique organisation identifier for Development Initiatives can then expressed as follows:
fr: Le **préfixe de registre d'origanisations** pour UK Companies House, l'organisme en charge du registre du commerce au Royaume-Uni, est GB-COH. L'organisation **Development Initiatives** a obtenu le numéro d'entreprise '06368740' par Companies House. L'identifiant global de l'organisation Development Initiatives peut alors être exprimé ainsi :

source: In OCDS, the organization register prefix is included in the ```scheme``` field of an identifier block, with the existing organization id placed in the ```id``` field. If there is a recognized public URI that uniquely identifies this organization (for example, drawn from [Open Corporates](https://opencorporates.com/)) this can also be given in the ```uri``` field.
fr: Dans OCDS, le préfixe du registre d'organisations est inclus dans le champ ```scheme``` de la composante d'identification, avec l'identifiant de l'organisation existante placé dans le champ ```id```. S'il y a un URI public et reconnu qui identifie de manière unique cette organisation (par exemple, tiré de [Open Corporates](https://opencorporates.com/)), celui-ci peut aussi être donné dans le champ ```uri```.

source: Choosing an identifier
fr: Choisir un identifiant

source: The **organisation register prefix** is used to refer to a register from which the organisation identifier is drawn. There are a range of different kinds of **organisation list**:
fr: Le **préfixe du registre d'organisations** est utilisé pour désigner un registre à partir duquel l'identifiant d'organisation est conçu. Il existe une gamme de différents types de **listes d'organisations** :

source: **Primary registers** - such as national or state company registrars. An identifier issued by these bodies has a specific legal meaning. There is a one to one equivalence between the identifier and a legal entity of a particular form in a given jurisdiction. The identifier is created at the same time that the organisation is formally constituted, and changes to the status of the organisation are recorded against this identifier in an official register. **Identifiers from a primary register are strongly preferred in OCDS.**
fr: **Registres primaires** - tels que les registres nationaux ou d'État des sociétés. Un identifiant émis par ces organismes a un sens juridique spécifique. Il y a une équivalence univoque entre l'identifiant et une entité juridique d'une forme particulière dans une juridiction donnée. L'identifiant est créé en même temps que l'organisation est officiellement constituée, et les modifications du statut de l'organisation sont enregistrées par rapport à cet identifiant dans un registre officiel. **Les identifiants issus d'un registre primaire sont fortement préférés dans OCDS**.

source: **Secondary registers** - which record a particular property of an organisation, such as being registered for VAT, or registered as an employer. An organisations identifier in such a registry might change without the organisation itself changing in nature. For example, in some jurisdictions, an organisation may de-register from VAT, and then re-register, gaining a new number in the process; or different branches of the same legal entity might register for different VAT numbers.
fr: **Registres secondaires** - qui enregistrent une propriété particulière d'une organisation, comme étant inscrite à la TVA, ou enregistrée en tant qu'employeur. L'identifiant d'une organisation dans un tel registre pourrait changer sans que l'organisation elle-même ne change de nature. Par exemple, dans certaines juridictions, une organisation peut se désenregistrer de la TVA, puis se ré-inscrire, obtenant ainsi un nouveau numéro dans le processus ; ou les différentes branches de la même entité juridique pourraient s'enregistrer avec différents numéros de TVA.

source: **Third-party databases** - which compile a list of organisations, and sometimes their sub-units, on an on-demand basis. These databases do not confer any legal status or special properties on the organisations, but may record a mapping between their own identifiers and other primary or secondary register identifiers for the organisation. A common examples of a third-party database is the proprietary Dun&Bradstreet number. The OCDS organisational identifier scheme will recognise identifiers from third-party databases, but strongly prefers those drawn from non-propietary databases, which allow users to lookup identifier information.
fr: **Bases de données tierces** - qui compilent une liste des organisations, et parfois de leurs sous-unités, sur demande. Ces bases de données ne confèrent aucun statut juridique ou propriété spéciale aux organisations, mais peuvent enregistrer une correspondance entre leurs propres identifiants et d'autres identifiants issus de registres primaires ou secondaires pour l'organisation. Un exemple courant est le numéro exclusif Dun&Bradstreet. Le système OCDS d'identification des organisations reconnaîtra les identifiants issus de bases de données tierces, mais préfère fortement celles tirées de bases de données non-propriétaires qui permettent aux utilisateurs de rechercher des informations d'identification.

source: **Local lists** - Some publishers do not map their data to external identifiers, maintaining instead a local list of suppliers. In these cases, the publisher may use their internal identifiers, and should adopt their own **organisation list prefix** starting with X- to use. Where possible, the publisher should also provide their local list on the web, with as much additional data about each supplier as possible, in order to maximise the chance of data users matching their local list to some more authoritative register.
fr: **Listes locales** - Certains producteurs de données n'établissent pas de concordance entre leurs données et des identifiants externes, ils maintiennent à la place une liste locale des fournisseurs. Dans ces cas, le producteur de données peut utiliser ses identifiants internes et adopter sa **propre liste de préfixes** commençant par X-. Lorsque c'est possible, le fournisseur de données devrait également fournir sa liste locale sur le web avec autant de données supplémentaires que possible sur chaque fournisseur afin de maximiser les chances pour que les utilisateurs de données établissent des correspondances avec un registre plus fiable.

source: Local lists may commonly need to be used for identifying public bodies, as in many countries there is no official list of public agencies.
fr: Les listes locales peuvent souvent être utilisées pour identifier les organismes publics, du fait que, dans de nombreux pays, il n'y a pas de liste officielle des organismes publics.

source: At present, the OCDS standard defers to the organisation list prefixes provided by the [IATI Organisation Registration Agency codelist](http://iatistandard.org/codelists/OrganisationRegistrationAgency/) which cover a wide range of organization types. If you require codes to be added to this list, please contact the [Open Contracting Data Standard helpdesk](../support/index.md) and they will work to achieve this.
fr: À l'heure actuelle, le standard OCDS se réfère à la liste des préfixes d'organisation fournis par la nomenclature [IATI Organisation Registration Agency](http://iatistandard.org/codelists/OrganisationRegistrationAgency/) qui couvrent un large éventail de types d'organisation. Si vous avez besoin d'ajouter des codes à cette liste, contactez [l'assistance technique OCDS](../support/index.md) qui vous aidera à atteindre cet objectif.

source: Release ID
fr: Identifiant de livraison

source: The release ID must be unique within the contracting process it is part of, **and** within any given data package it is part of.
fr: L'identifiant de livraison doit être unique dans le processus de passation de marchés **et** dans le package de données dont il fait partie.

source: Within any release or record package **and** for any given ocid, there should be no two release IDs that refer to different releases.
fr: Dans chaque package ou archive de livraisons **et** pour tout ocid donné, il n'y aura pas deux identifiants de livraisons qui se réfèrent à différentes livraisons.

source: Tender, Award and Contract
fr: Appel d'offres, attribution et contrat

source: The tender, award and contract IDs must be unique within the contracting process it is part of.
fr: Les identifiants d'appel d'offre, d'attribution et de contrats doivent être uniques dans le processus de commande publique dont il fait partie.

source: For any given ocid, there should be no two tender, award or contract IDs that refer to different tender, award or contract sections respectively.
fr: Pour tout OCID donné, il n'y aura pas deux identifiants d'appels d'offres, d'attributions ou de contrats qui se réfèrent à différents appels d'offres, attribution ou contrat.
