Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/identifiers.po
Languages: fr

source: Contracts should always cross-reference a related award (using the awardID property), as key information such as suppliers may be contained in the related award. There may be multiple contracts referring to a single award, as in the case of a framework contract where multiple contract are issued against a single award.
fr: Les contrats doivent toujours être liés à l'attribution (en utilisant la propriété awardID), afin que les informations clés sur les fournisseurs puissent figurer dans l'attribution connexe. Il peut y avoir plusieurs contrats se référant à une seule attribution comme dans le cas d'un contrat-cadre où plusieurs contrats sont émis en vertu d'une seule attribution.

source: Items, Documents and Milestones
fr: Elements, documents et étapes

source: An item, document or milestone ID must be unique within a given array of items, and must be used consistently across all the releases in a contracting process.
fr: Un identifiant d'élément, d'un document ou d'une étape doivent être uniques parmi une liste d'élements et doivent être de manière uniforme parmi toutes les livraisons au sein d'un processus de commande publique.

source: The same id may be re-used in another array of items within the same release, and no cross-reference between these identifiers is implied.
fr: Le même identifiant peut être réutilisé dans un autre tableau d'éléments au sein de la même livraison et aucune référence croisée entre ces identifiants n'est implicite.

source: The use of an identifier means that subsequent releases can update prior identified items, documents or milestones, without needing to republish all the items, documents or milestones.
fr: L'utilisation d'un identifiant signifie que les versions ultérieures peuvent mettre à jour les éléments, documents ou étapes identifiés auparavant sans avoir besoin de republier tous les objets, documents ou étapes.

source: A release may contain tender.items (Items tendered for) and award.items
fr: Une livraison peut contenir des éléments mis en adjudication (tender.items) et des éléments attribués — award.items.

source: tender.items may contain three items, with identifiers of: [1, 2, 3]
fr: tender.items peut contenir trois éléments avec des identifiants [1, 2, 3].

source: award.items may contain two items, with identifiers of: [3, 4]
fr: award.items peut contenir deux éléments avec des identifiants [3,4]

source: A second release is issued in which award.items contains six items: [3, 4, 5]
fr: Une seconde livraison est publiée dans laquelle award.items contient six éléments [3, 4, 5]

source: In this situation, note that:
fr: Dans cette situation, notez que :

source: There is no implied relationship between the tender.item with id 3 and the award.item with id 3: these could be entirely different items
fr: Il n'y a pas de relation implicite entre tender.item avec id 3 et award.item avec id 3: ceux-ci pourraient être des éléments tout à fait différents

source: There is a relationship between the award.items with id 3 and 4 in the first release, and with award.id of 3 and 4 in the second release. The second release should be interpreted as updating items 3 and 4, and adding a new item, 5.
fr: Il existe une relation entre les award.items avec id 3 et 4 dans la première livraison, et avec award.id de 3 et 4 dans la deuxième livraison. La deuxième livraison doit être interprétée comme une mise à jour des articles 3 et 4, et l'ajout d'un nouvel élément, 5.
