Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/merging.po
Languages: es, fr

source: Merging
es: Fusionar
fr: Fusion

source: In OCDS, merging involves combining individual [releases](../getting_started/releases_and_records.md) of data during a contracting process into a [record](../getting_started/releases_and_records.md) which provides an at-a-glance view of the current state and history of that process.
es: En el OCDS, fusionar implica combinar [entregas](../getting_started/releases_and_records.md) ide datos individuales durante un proceso de contratación en un [registro](../getting_started/releases_and_records.md) que provee una visión rápida del estado actual y el historial de ese proceso.
fr: Chez OCDS , la fusion consiste à combiner plusieurs publications de données en un seul dossier pour donner une vue d'ensemble de l'état actuel et de l'histoire du processus de passation de marché. [releases]../getting_started/releases_and_records.md), [record](../getting_started/releases_and_records.md)

source: A publisher provides a tender release on 1st January, with a planned contract value of $1000.
es: Un publicador provee una entrega de una licitación el 1 de enero, con un valor de contrato de $1000.
fr: Un éditeur publie un d'appel d'offres le 1er Janvier, avec une valeur contractuelle prévue de 1000 $.

source: On 31st January, the publisher provides an amended tender release updating the planned contract value to $1500.
es: El 31 de enero, el publicador provee una entrega de licitación enmendada, actualizando el valor de contrato a $1500.
fr: Le 31 Janvier , l'éditeur publie une version modifiée d'appel d'offres et met à jour la valeur du contrat prévue à 1500 $.

source: After assessing bids, it is decided to award the contract in two lots.
es: Después de valorar las propuestas, se decide adjudicar el contrato en dos montos.
fr: Après l'évaluation des offres , il est décidé d'attribuer le marché en deux lots .

source: On 1st March, the publisher provides an award release, announcing Company A have been awarded a contract for $750.
es: El 1 de marzo, el publicador provee una entrega de adjudicación, adnunciando que la Compañía A ha obtenido un contrato por $750.
fr: Le 1er Mars , l'éditeur annonce qu'il a adjugé à la compagnie A, un premier lot pour un montant de 750$.

source: On 3rd March, the publisher provides an separate award release, announcing that company B have been awarded a contract for $750
es: El 3 de marzo, el publicador provee una entrega de adjudicación separada, anunciando que la Compañía B ha obtenido un contrato por $750
fr: Le 3 Mars , l'éditeur annonce dans une deuxième publication qu'il a adjugé un deuxième lot à la société B pour un montant de 770$.

source: These independent releases each provide real-time information about what is happening in the contracting process. The record will combine them together. Using the same schema and structure as the releases, the main body of the record will contain a tender with contract value of $1500, and details of both awards.
es: Estas entregas independientes proveen información en tiempo real sobre qué está pasando en el proceso de contratación. El registro las combinará. Usando el mismo esquema y estructura como las entregas, el cuerpo principal del registro contrendrá una licitación con el valor del contrato de $1500 y detalles de ambas adjudicaciones.
fr: Ces publications indépendantes fournissent des renseignements en temps réel sur ce qui se passe dans le processus de passation de marché. Le dossier rassemble les renseignements des deux publications. En utilisant le même schéma et la même structure que les publications , le corps principal du dossier contiendra un appel d'offres avec la valeur du contrat de 1500$ en plus du détail des deux adjudications.

source: If the record is complete with versioning information, then the versioning section will reveal that the planned contract value changed from $1000 to $1500 on 31st January.
es: Si el registro se completa con información de versiones, entonces la sección de versiones revelará que el valor planeado del contrato cambió de $1000 a $1500 el 31 de enero.
fr: Si le dossier est complet avec toutes les versions publiées, le dossier révélera que la valeur du contrat prévu est passée de 1000$ à 1500$ le 31 Janvier .

source: Merging rules
es: Reglas para fusionar
fr: Règles de fusion

source: The merging rules can be summarised as follows:
es: Las reglas para fusionar se pueden resumir de la siguiente manera:
fr: Les règles de fusion peuvent être résumées comme suit :

source: All releases with the same ```ocid``` should be compiled together, processed by order of the release date, and starting with the oldest first. Compare each pair or releases in turn following the rules below.
es: Todas las entregas con el mismo ```ocid``` deben compilarse juntas, procesadas en orden de la fecha de entrega y comenzando con la más antigua. Compara cada par de entregas siguiendo las reglas a continuación.
fr: Toutes les versions avec le même `` ` ocid``` devraient être compilées ensemble, traitées par ordre de la date de sortie , et en commençant par les plus anciennes . Comparez à tour de rôle les versions suivant les règles ci-dessous.

source: For literal values, replace the older value with the newer value. You may remove fields which have been set to null.
es: Para valores literales, reemplaza el valor antiguo con el valor más nuevo. Puedes quitar campos que se han puesto como nulos.
fr: Pour les valeurs littérales , remplacez l'ancienne valeur avec la valeur plus récente. Vous pouvez supprimer des champs qui ont une valeur nulle.

source: For an array of objects, merge the array by the id of each object EXCEPT as noted in 4.
es: Para una matriz de objetos, fusiona la matriz por el id de cada objeto EXCEPTO como se menciona en el punto 4.
fr: Pour un tableau d'objets , fusionner par l'identifiant de chaque objet , sauf indication contraire dans 4 .

source: For the following arrays, replace the entire array in the older release with the entire array from the newer release
es: Para las siguientes matrices, reemplaza la matriz entrega en la entrega anterior con la matriz entera de una entrega más nueva
fr: Pour les tableaux suivants , remplacer le tableau entier par sa version la plus récente:

source: ```award.suppliers```
fr: ```award.suppliers``` - adjudication.fournisseurs

source: ```organization.additionalIdentifiers```
fr: ```organization.additionalIdentifiers``` - identifiants.additionnels d'organisation

source: ```item.additionalClassifications```
fr: ```item.additionalClassifications``` - classification additionnelles d'articles/items

source: ```amendment.changes```
fr: ```amendment.changes``` - changements d'amendements

source: Note that this means releases must republish these arrays in full.
es: Nótese que esto significa que las entregas deben de volver a publicar completamente estas matrices.
fr: Notez que cela signifie que ces tableaux doivent être re-publiés intégralement.

source: When all releases are merged, remove the ```release.id``` and ```release.date``` from the resulting data structure, and add ```compiled``` to the list of ```release.tag``` values.
es: Cuando se fusionen todas las matrices, quita el ```release.id``` y ```release.date``` de la estructura de datos resultante y agrega ```compiled``` a la lista de valores de ```release.tag```.
fr: Lorsque toutes les publications sont fusionnées , retirez le ```release.id``` et ````release.date``` de la structure de données résultante, et ajoutez ```compiled``` à la liste des étiquettes de publications ```release.tag```

source: A reference implementation of the merge routine in python [is available on GitHub](https://github.com/open-contracting/ocds-merge).
es: Una implementación de referencia de la rutina de fusión en python está [disponible en GitHub](https://github.com/open-contracting/ocds-merge).
fr: Une référence à la routine de fusion en python est disponible sur GitHub [is available on GitHub](https://github.com/open-contracting/ocds-merge).

source: Requirements for merging
es: Requisitos para fusionar
fr: Exigences relatives à la fusion

source: For merging to work effectively, all the releases to be merged must share a common ```ocid``` and a number of other criteria must be met.
es: Para que la fusión funcione de manera efectiva, todas las entegas que se fusionen deben compartir un ```ocid``` común y se debe cumplir con otros criterios.
fr: Pour que la fusion puisse fonctionner, toutes les publications à fusionner doivent partager un ```ocid``` commun et un certain nombre d'autres critères doivent être respectés .

source: The following all require unique identifiers (at least unique within that ocid):
es: Todos los siguientes requieren identificadores únicos (o por lo menos únicos dentro de ese ocid):
fr: Les éléments suivantes nécessitent des identifiants uniques ( au moins uniques dans ce ocid ) :

source: awards
es: adjudicaciones
fr: awards - adjudication

source: contracts
es: contratos
fr: contract - contrat

source: items
es: artículos
fr: items - articles/items

source: milestones
es: hitos
fr: milestones - jalons

source: The following arrays of items must be re-published in full for each release:
es: Las siguientes matrices de artículos deben volver a publicarse por completo por cada entrega:
fr: Les tableaux suivants des articles/items doivent être re- publiés dans leur intégralité pour chaque publication :

source: Award.suppliers
fr: Award.suppliers - adjudications forunisseurs

source: Organization.additionalIdentifiers
fr: Organization.additionalIdentifiers - identifiants additionnels d'organisations

source: Item.additionalClassifications
fr: Item.additionalClassifications - classifications additionnelles d'articles/items.

source: Amendment.changes
fr: Amendment.changes - changements aux amendements

source: Other lists with ```.id``` properties do not need to be republished in full, but publishers should note the [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).
es: Otras listas con propiedades de ```.id``` no necesitan volver a publicarse por completo, pero los publicadores deben de tomar en cuenta la [guía para vaciar campos y valores](../../reference/#emptying-fields-and-values).
fr: D'autres listes avec des identifiants ```.id``` ne doivent pas être re-publiées dans leur intégralité, mais les éditeurs doivent noter les conseils sur les champs et les valeurs nulles. [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).

source: Versioned data
es: Datos versionados
fr: Versions des données

source: There are some situations in which it is important to be able to see how data about a contracting process has changed over time. For example, to identify how contract values have altered, or milestones moved through stages of implementation.
es: Existes algunas situaciones en las que es importante poder ver cómo han cambiado los datos sobre un proceso de contratación a lo largo del tiempo. Por ejemplo, para identificar cómo se han ajustado los valores de un contrato o cómo se han conseguido los hitos a través de etapas de implementación.
fr: Il y a des situations dans lesquelles il est important d'être en mesure de voir comment les données sur un processus de passation des marchés ont changées au fil du temps . Par exemple, pour déterminer comment la valeur des contrats a été modifiée, ou comment les jalons ont été déplacés à travers les étapes de mise en œuvre.

source: The versioned release schema provides a model for representing this data.
es: El esquema de entrega versionada provee un modelo para representar estos datos.
fr: Le schéma de publication des versions fournit un modèle pour représenter ces données .

source: In a versioned release, instead of over-writing past values when combining multiple releases, each field becomes an array of objects, indicating the:
es: En una entrega versionada, en vez de re-escribir los valores anteriores cuando se combinan múltiples entregas, cada cambio se vuelve una matriz de objetos, indicando:
fr: Dans une publication versionnée , au lieu d'écraser les valeurs passées lors de la combinaison de multiples versions , chaque champ devient un tableau d'objets , ce qui indique le :

source: The date, id and tag of the releases where a field-value pair was first encountered;
es: La fecha, id y etiqueta de las entregas donde se encontró por primera vez un campo-valor;
fr: La date, l'identifiant et l'étiquette des publications où une paire valeur de champ a été rencontrée;

source: The value of the field-value pair at that point;
es: el valor de la pareja campo-valor en ese punto;
fr: La valeur de la paire champ-valeur à ce moment-là ;

source: As a result, the history of any field can be easily read from the data structure.
es: Como resultado, el historial de cualquier campo puede leerse fácilmente desde la estructura de los datos.
fr: En conséquence, l'historique de tous les champs peut être facilement lue à partir de la structure de données.

source: Example
es: Ejemplo
fr: À titre d'exemple

source: Merge strategies in the schema
es: Estrategias de fusión en el esquema
fr: Stratégies de fusion dans le schéma

source: Version 1.0 of the OCDS schema includes a series of ```mergeStrategy``` properties which were designed to indicate how releases should be compiled together. In initial implementation, we have found these can create some confusion, and so propose that future versions will omit all but the essential properties required to indicate the exceptions to the general rule in (4) above.
es: La versión 1.0 del esquema de OCDS incluye una serie de propiedades ```mergeStrategy``` que fueron diseñadas para indicar cómo se deben compilar las entregas. En la implementación inicial hemos visto que éstas pueden resultar confusas y tenemos la intención de que en futuras versiones se omitirán todas menos las propiedades esenciales que se requieren para indicar las excepciones a la regla general en (4).
fr: Version 1.0 du schéma OCDS comprend une série de stratégie de fusion qui ont été conçus pour indiquer comment les différentes versions de publications devraient être compilées ensemble. Dans la mise en œuvre initiale, nous avons trouvé que ces stratégies peuvent créer une certaine confusion. Les futurs versions du standard OCDS vont les omettre toutes sauf les propriétés essentielles requises pour indiquer les exceptions à la règle générale ( 4 ) ci-dessus.

source: This information is maintained here for reference.
es: Esta información se mantiene aquí para referencia.
fr: Ces informations sont conservées ici pour référence.

source: Merge strategy reference
es: Referencia de la estrategia de fusión
fr: Références aux startégies de fusion

source: The purpose of merging releases is to create (a) a snapshot record of the current state of a contracting process; (b) a versioned history of the process.
es: El propósito de fusionar entregas es crear (a) un registro que sea una instantánea del estado actual de un proceso de contratación; (b) un historial versionado del proceso.
fr: Le but de la fusion des différentes versions de publications est de créer ( a) une image de l'état actuel d'un processus de passation des marchés ; ( B ) une histoire versionnée du processus.

source: Different sections of the data structure need to be handled differently as releases are merged. For some lists, a new release should overwrite the previous list in fully. For example, if a later release updates the list of suppliers against an award, this new list in full should be taken as the latest authoritative information. For other lists, such as a list of contracts, a release may add a new contract to the list without needing to repeat all the previous contracts, or may amend a single award without repeating all the other awards.
es: Las distintas secciones de la estructura de los datos debe de manejarse de manera distinta conforma se fusionen las entregas. Para algunas listas una nueva entrega debería de sobre-escribir a la anterior por completo. Por ejemplo, si una entrega posterior actualiza la lista de proveedores contra una adjudicación, esta nueva lista completa debería de tomarse como la información acreditada más actual. Para otras listas, como las de contratos, una entrega puede agregar un nuevo contrato a la lista sin necesidad de repetir todos los contratos previos, o puede modificar una sola entrega sin repetir todas las demás.
fr: Différentes sections de la structure de données doivent être traités différemment lors de la fusion de publications successives. Pour certaines listes , une nouvelle version devrait remplacer la liste précédente à fond. Par exemple, si une version plus récente met à jour la liste des adjudicataires, cette nouvelle liste complète devrait être considérée comme la dernière des informations faisant autorité . Pour les autres listes , comme une liste des contrats , une publication peut ajouter un nouveau contrat à la liste sans avoir besoin de répéter tous les contrats antérieurs , ou peut modifier une seule adjudication sans répéter toutes les adjudications antérieures.

source: This leads to a set of mergeStrategies which are included in the full schema.
es: Esto llega a un conjunto de mergeStrategies que se incluyen en el esquema completo.
fr: Cela conduit à un ensemble de strategies de fusion qui sont incluse dans le schéma complet.

source: The OCDS merging has been based on the open source [jsonmerge library](https://github.com/avian2/jsonmerge), but can be implemented in other software as required.
es: La fusión de OCDS se ha basado en la biblioteca de código abierto [jsonmerge](https://github.com/avian2/jsonmerge), pero puede implementarse en otro software conforme se requeiera.
fr: La stratégie de fusion OCDS est basée sur la bibliothèque open source JsonMerge mais peut être mis en œuvre dans d'autres logiciels selon les besoins. [jsonmerge library](https://github.com/avian2/jsonmerge)

source: Within the OCDS release schema, each field has a mergeStrategy property. This strategy describes how to merge that and child fields.
es: Dentro del esquema de entregas de OCDS, cada campo tiene una propiedad mergeStrategy. Esta estrategia describe cómo fusionar ese y campos descendientes.
fr: Dans le schéma de publication OCDS , chaque champ a une propriété intutulée mergeStrategy . Cette stratégie décrit comment fusionner les différents champs de la publication.

source: We inherit the existing merge strategies from [jsonmerge](https://github.com/avian2/jsonmerge#merge-strategies) and add a number of specific strategies for OCDS, which are currently only available in the [OCDS fork of jsonmerge](https://github.com/open-contracting/jsonmerge) and which are described below.
es: Tomamos las estrategias de fusión existentes de [jsonmerge](https://github.com/avian2/jsonmerge#merge-strategies) y agregamos una serie de estrategias específicas para OCDS, que sólo están disponibles en el [fork de OCDS de jsonmerge](https://github.com/open-contracting/jsonmerge) y que se describen a continuación.
fr: Nous partons des stratégies JsonMerge et ajoutons un certain nombre de stratégies spécifiques pour OCDS. Ces stratégies sont actuellement disponibles dans [OCDS fork of jsonmerge](https://github.com/open-contracting/jsonmerge) et qui sont décrites ci-dessous.

source: ocdsVersion merge strategy
es: estrategia de fusión ocdsVersion
fr: Stratégie de fusion ocdsVersion

source: Most fields have the mergeStrategy ocdsVersion. The ocdsVersion strategy has two modes of operation:
es: La mayoría de los campos tienen la mergeStrategy ocdsVersion. La estrategia ocdsVersion tiene dos modos de operación:
fr: La plupart des champs ont la mergeStrategy ocdsVersion . La stratégie de ocdsVersion dispose de deux modes de fonctionnement :

source: when making a compiled record, the field is overridden with the latest value
es: cuando se hace un registro compilado, el campo se reemplaza con el valor más reciente
fr: Lors de la compilation d'un dossier constitué , le valeur du champ est écrasée avec la dernière valeur

source: when making a versioned record, the field history is documented.
es: cuando se hace un registro versionado, el campo de historial se documenta.
fr: Lors de la création d'un dossier versionné , les valeurs successives d'un champ sont archivées.

source: ocdsVersion for lists
es: ocdsVersion para listas
fr: ocdsVersion pour les listes

source: The ocdsVersion strategy also applies to the following lists:
es: La estrategia ocdsVersion también aplica para las siguientes listas:
fr: La stratégie ocdsVersion vaut également pour les listes suivantes:

source: In this instance the entire list is treated as one single value and any change to any field will result in the whole list being updated and documented as changed.
es: En esta instancia la lista entera se trata como un sólo valor y cualquier cambio a cualquier campo resultara en la actualización de toda la lista y su documentación conforma cambie.
fr: Dans ce cas, la liste entière est traitée comme une valeur unique et toute modification des champs se traduira par toute la liste mise à jour et documentée comme changée.

source: To keep the versioning as clean as possible, the list of objects should **always be given in the same order** in each release, so as not to mistakenly mark a change when actually only order has shifted.
es: Para mantener el control de versiones tan limpio como sea posible, la lista de objetos siempre debe de **proveerse en el mismo orden** en cada entrega para no marcar por equivocación un cambio cuando sólo ha habido un cambio de orden.
fr: Pour garder le versioning aussi propre que possible , la liste des objets devrait ** toujours être donné dans le même ordre ** dans chaque version , afin de ne pas marquer à tort un changement alors qu'en réalité, seul l'ordre a changé.

source: This merging strategy has the advantage of not requiring unique identifiers on every object, but has the downside of requiring every release to publish the whole block of data, not just an incremental change.
es: Esta estrategia de fusión tiene la ventaja de no requerir identificadores únicos para cada objeto, pero tiene la desventaja de requerir que en cada entrega se publique el bloque completo de datos, no sólo un cambio incremental.
fr: Cette stratégie de fusion a l'avantage de ne pas nécessiter des identifiants uniques sur chaque objet , mais il a l'inconvénient de nécessiter à chaque version de publier l'ensemble du bloc de données , pas seulement un changement progressif .

source: arrayMergeById merge strategy
es: estrategia de fusión arrayMergeByld
fr: Stratégie de fusion arrayMergeById

source: The arrayMergeById applies to the following lists of objects within the release:
es: La arrayMergeById aplica para la siguiente lista de objetos dentro de la entrega:
fr: Le arrayMergeById s'applique aux listes d'objets suivants de la publication:

source: Each of these objects has a required id field on it. When the merge is being performed, the item with the corresponding id is looked up for the before and after versions of the release and the fields are then matched accordingly.
es: Cada uno de estos objetos tiene un campo de id requerido en él. Cuando se realiza la fusión, se el artículo con el id correspondiente se analiza para encontrar las versiones de antes y después de la entrega y los campos se emparejan como corresponda.
fr: Chacun de ces objets contient un champ d'identification 'id' dédié. Lorsque la fusion est en cours d'exécution , l'élément avec l' id correspondant est recherché pour les versions avant et après la publication et les champs sont ensuite appariés en conséquence.
