Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/merging.po
Languages: es, fr

source: If a given entry is omitted (e.g. there is no information about a particular contract in a subsequent release), then the previous values carry forward.
es: Si se omite cierta entrada (p.ej. no hay información sobre un contrato particular en una entrega subsecuente) entonces se mantienen los valores anteriores.
fr: Si une entrée donnée est omise (par exemple il n'y a pas d'informations sur un contrat particulier dans une version ultérieure ), les valeurs précédentes sont conservées.

source: To remove an entry it would have to have it's field values set to null, as per the [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).
es: Para quitar una entrada se tendrían que tener los valores de los campos en nulo, de acuerdo con la [guía para vaciar campos y valores](../../reference/#emptying-fields-and-values).
fr: Pour supprimer une entrée , il faut lui donner une valeur nulle comme le conseil le guide: [guidance on emptying fields and values](../../reference/#emptying-fields-and-values).

source: ocdsOmit merge strategy
es: Estrategia de fusión ocdsOmit
fr: Stratégie de fusion ocdsOmit

source: There are a number of fields marked with the strategy ocdsOmit.
es: Hay una serie de campos marcados con la estrategia ocdsOmit.
fr: La stratégie de fusion ocdsOmit couvre un certains nombre de champs:

source: This strategy returns nothing on merge, because to update the field wouldn't make sense.
es: Esta estrategia no devuelve nada en una fusión porque actualizar el campo no tendría sentido.
fr: Cette stratégie ne renvoie rien sur la fusion, parce que mettre à jour le champ ne serait pas logique.

source: For example, the field for `tag` should not be updated to the latest version, it should be updated to `compiled` for it to make sense.
es: Por ejemplo, el campo para `tag` no debe de actualizarse a la última versión, debe actualizarse a `compilado` para que tenga sentido.
fr: Par exemple , le champ `tag` ne doit pas être mis à jour à la dernière version, il doit être mis à jour à `compiled` pour lui donner un sens.

source: documents
es: documentos

source: transactions
es: transacciones
