Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/reference.po
Languages: fr

source: Each call-off purchase against a framework agreement would result in a [contract](#contract), related to the framework agreement [award](#award) via ```awardID```.
fr: Chaque achat par bon de commande dans un accord-cadre doit mener à un [contrat](#contract) lié à l'[attribution](#award) de l'accord-cadre via un ```awardID```.

source: As a result, [award](#award) and [contract](#contract) each contain an [items](#items) block, allowing the award to describe the possible goods and services that can be supplied, whilst the contract describes those that are to be supplied in any particular instance.
fr: Par conséquent, [l'attribution](#award) et [le contrat](#contract) contiennent chacun un bloc [éléments](#items), permettant de décrire les produits et les services possibles qui peuvent être fournis dans l'attribution, tandis que le contrat décrit ceux qui doivent être fournis dans un cas particulier.

source: Implementation
fr: Execution du marché

source: Implementation information can be updated over the course of a contract. It belongs nested within the contract it relates to. Implementation blocks include the following elements:
fr: Les informations sur l'exécution peuvent être mises à jour au cours d'un contrat. Elles sont imbriquées dans le contrat auxquelles elle se rapporte. Les blocs sur l'exécution comprennent les éléments suivants :

source: Information on subcontracts is not currently included in the release candidate schema, but may be handled by [proposed extensions](conformance_and_extensions.md)
fr: Des informations sur la sous-traitance ne sont à l'heure actuelle pas inclues dans la version du standard OCDS candidate à la publication mais peuvent être gérées par des [extensions](conformance_and_extensions.md).

source: The transaction block is modelled on the [International Aid Transparency Initiative (IATI) transaction element](http://iatistandard.org/activity-standard/iati-activities/iati-activity/transaction/), and can be used to represent actual flows of money between organisations in relation to this contract. As with the [budget](#budget) block, this may be used to cross-reference to a third party ```source``` of data, and can re-use identifiers from that source.
fr: Le bloc sur les transactions est calqué sur les [éléments de transaction de l'Initiative Internationale de Transparence de l'Aide (IITA)](http://iatistandard.org/activity-standard/iati-activities/iati-activity/transaction/) et peut être utilisé pour représenter les flux d'argent entre organisations dans le cadre d'un contrat. Comme avec le bloc sur le [budget](#budget), cela peut être utilisé pour croiser des données issues d'une tierce-partie et peut réutiliser les identifiants de cette source.

source: In most circumstances, the ```providerOrganization``` identifier should match that of the ```buyer```, and the ```recieverOrganization``` identifier should match that of the ```supplier```.
fr: Dans la plupart des circonstances, l'identifiant ```providerOrganization``` doit correspondre aux identifiants de l'acheteur —```buyer```— et de l'organisation qui reçoit les fonds — ```receiverOrganization``` — doivent correspondre à celui du fournisseur ```supplier```.

source: Milestones
fr: Etapes

source: See [milestone](#milestone) reference below.
fr: Voir ci-dessous [la référence sur les étapes](#milestone).

source: The implementation milestones should be updated to reflect when they are met.
fr: Les étapes de l'exécution du contrat doivent être mises à jour pour refléter leur état d'avancement.

source: Documents related to contract implementation should be stored here. This may include subcontracts.
fr: Les documents relatifs à l'exécution du contrat doivent être stockés ici. Cela peut inclure la sous-traitance.

source: See [document](#document) reference below.
fr: Voir la [référence sur les documents](#document) ci-dessous.

source: Amendment
fr: Modification

source: A release may amend properties from a previous release. Whilst the release & record model of OCDS offers the opportunity to keep a full versioned history of changes, in many cases it is important for changes to a tender, award or contract to be explicitly declared.
fr: Une livraison peut modifier les propriétés d'une livraison précédente. Alors que les modèles OCDS pour les livraisons et les archives offrent la possibilité de conserver un historique complet et versionné des changements, il est important dans de nombreux cas que les modifications apportées à un appel d'offres, l'attribution ou un contrat soient explicitement déclarées.

source: The amendment block in each of tender, award and contract blocks provides the ability to explicitly declare changed fields, their former values, to provide an explanation for the change, and attach or reference relevant documentation.
fr: Le bloc sur les modifications — ```amendment``` — dans chacun des blocs sur les offres, l'attribution et le contrat permet de déclarer explicitement les champs modifiés, leurs anciennes valeurs, de fournir une explication pour les changements apportés, et de joindre ou de référencer des documents pertinents.

source: Amendment information should not be included in compiled records, as it is not possible to indicate __all__ the former values of a field, only the most recent known value: whereas the version history of a full record can show all previous values.
fr: Les informations sur les modifications ne doivent pas être inclues dans les archives compilées, car il est impossible d'indiquer __toutes__ les anciennes valeurs d'un champ, seule la dernière valeur connue: alors que l'historique de version d'une archive complète peut afficher toutes les valeurs précédentes.

source: Changes
fr: Changements

source: Within each amendment block, publishers should provide an array of items that have changed, along with their former values.
fr: Dans chaque bloc de modification, les fournisseurs de données doivent fournir un tableau des éléments qui ont changé, ainsi que leurs anciennes valeurs.

source: Field reference
fr: Référence des champs

source: Organization
fr: Organisation

source: The organization block can be used to provide a legal identifier for an organization, and to give [address](#address) and [contact point](#contact-point) information.
fr: Le bloc sur les organisations peut être utilisé pour fournir un identifiant juridique pour une organisation, de donner des informations sur l'[adresse](#address) et le [point de contact](#contact-point).

source: Identifier
fr: Identifiant

source: The identifier block provides a way to [identify the legal entities](../../identifiers/#organizations) involved in a contracting process. If a Contracting Process represents a contract arranged by the department or branch of a larger organization, the legal entity (usually the registered organization) should be described in the [identifier](#identifier) section, with details of the branch or department given in the name, [address](#address) and [contact point](#contactpoint) as relevant.
fr: Le bloc sur les identifiants fournit un moyen d'[identifier les entités juridiques](../../identifiers/#organizations) impliquées dans un processus de passation de marchés. Si un processus de passation de marché porte sur un contrat organisé par le département ou une entité d'une organisation plus importante, l'entité juridique (généralement l'organisation enregistrée) doivent être décrits dans la section [identifiant](#identifier), avec des détails sur la branche ou le département donné nommé, son [adresse](#address) et son [point de contact](#ContactPoint) le cas échéant.

source: Address
fr: Adresse

source: ContactPoint
fr: Point de contact

source: Documents may be attached at a number of points within the standard: to planning, tenders, awards, contracts and milestones. Each document block can consist of multiple documents, classified using the [documentType](../../codelists/#document-type) codelist.
fr: Les documents peuvent être joints à un certain nombre d'éléments dans le standard : planification, appels d'offres, attributions, contrats et étapes. Chaque bloc sur les documents peut être constitué de plusieurs documents, classés en utilisant la liste de codes [documentType](../../codelists/#document-type).

source: The document block is also used to link to legal notices, which should have a documentType of 'notice'.
fr: Le bloc sur les documents est également utilisé pour lier vers les mentions légales, qui devraient avoir un attribut 'notice' dans le champ ```documentType```.

source: OCDS makes use of [ISO8601](http://en.wikipedia.org/wiki/ISO_8601) date-times, following [RFC3339 §5.6](http://tools.ietf.org/html/rfc3339#section-5.6).
fr: OCDS utilise la norme de date et d'heure [ISO8601](http://en.wikipedia.org/wiki/ISO_8601), suivant la [RFC3339 §5.6](http://tools.ietf.org/html/rfc3339#section-5.6).

source: A time and timezone/offset MUST always be provided in a date-time.
fr: Un horaire et un fuseau horaire DOIVENT toujours être fournis dans une date-heure.

source: The following are valid date-times:
fr: Les date-heures suivantes sont valides:

source: '2014-10-21T09:30:00Z' - 9:30 am on the 21st October 2014, UTC
fr: '2014-10-21T09:30:00Z' - 9:30 le 21 octobre 2014, fuseau UTC

source: '2014-11-18T18:00:00-06:00' - 6pm on 18th November 2014 CST (Central Standard Time)
fr: '2014-11-18T18:00:00-06:00' - 18h le 18 novembre 2014 fuseau CST (Central Standard Time)

source: The following are not valid:
fr: La date-heures suivantes ne sont pas valides :

source: '2014-10-21' - Missing time portion
fr: '2014-10-21' - La portion temps est manquante.

source: '2014-10-21T18:00' - missing seconds in time portion.
fr: '2014-10-21T18:00' - la portion secondes est manquante.

source: '2014-11-18T18:00:00' - Missing timezone/offset portion
fr: '2014-11-18T18:00:00' - la portion fuseau horaire est manquante.

source: '11/18/2014 18:00' - Not following the pattern at all!
fr: '11/18/2014 18:00' - ne suit absolument pas le modèle !

source: Accurately including the time and timezone offsets is particular important for tender deadlines and other dates which may have legal significance, and where users of the data may be from different timezones. The character Z on the end of a date-time indicates the [UTC](http://en.wikipedia.org/wiki/Coordinated_Universal_Time) (or Zero offset) timezone, whereas other timezones are indicated by their value '+/-hh:mm' UTC on the end of the date-time value.
fr: Il est particulièrement important d'indiquer avec précision l'heure et le fuseau horaire pour les délais d'appel d'offres et d'autres dates qui peuvent avoir une portée juridique, et où les utilisateurs des données peuvent être de différents fuseaux horaires. Le caractère Z à la fin d'une date-heure indique le fuseau [UTC](http://en.wikipedia.org/wiki/Coordinated_Universal_Time) (ou zéro décalage), alors que d'autres fuseaux horaires sont indiqués par leur valeur '+/- hh: mm UTC ' à la fin de la valeur date-heure.

source: In the event that the system from which data is drawn only includes dates, and does not include time information, publishers should consider sensible defaults for each field. For example, the startDate time of a clarification period may be set to '00:00:00Z' to indicate that clarifications can be requested from any time on the date stated, with the endDate time set to 23:23:59Z to indicate that clarifications can be sent up until the end of the endDate given. Alternatively, if clarification requests are only accepted in standard office hours, these values might be 09:00:00Z and 17:00:00Z respectively.
fr: Dans le cas où le système d'où les des données sont extraites n'inclut pas d'informations sur l'heure, les producteurs de données doivent considérer des valeurs par défaut raisonnables pour chaque champ. Par exemple, l'heure ```startDate``` de début d'une période de clarification peut être fixée à '00:00:00Z' pour indiquer que des précisions peuvent être demandées à tout moment à la date indiquée, avec le temps de ```endDate``` fixé à 23:23:59Z pour indiquer que les clarifications peuvent être envoyés jusqu'à la fin de la date de fin donnée. Par ailleurs, si les demandes de clarification ne sont acceptées qu'aux horaires classiques de bureau, ces valeurs peuvent être comprises entre 09:00:00Z et 17:00:00Z.

source: In the event that a date field is not bound to a specific time at all, publishers should choose a default time value of '23:23:59' and either 'Z' (for UTC) or the timezone of the publisher, indicating that the time refers to the end of the given date.
fr: Dans le cas où un champ de date ne soit pas lié à un horaire précis, les producteurs de données OCDS doivent choisir une valeur de temps par défaut de '23:23:59' et soit 'Z' (pour le fuseau UTC) ou le fuseau horaire du producteur, ce qui en indiquant que le temps se réfère à la fin de la date donnée.

source: Period
fr: Période

source: A period is an object consisting of a start date and end date, represented as date-times.
fr: Une période est un objet constitué d'une date de début et de fin, représentée comme une date-heure.

source: Item
fr: Elements

source: The items block is used to list the line-items associated with a tender, award or contract.
fr: Le bloc sur les éléments —```items```— est utilisé pour lister les postes de dépense associés à l'offre, l'attribution ou au contrat.

source: The [proposed location extension](../extensions/location.md) can be attached to items, allowing the point of delivery for a given item or the site of works to be completed to be indicated in both the tender, award and contract stage.
fr: L' [extension proposée sur la localisation](../extensions/location.md) peut être rattachée à des éléments, qui permettent d'indiquer dans les sections sur l'appel d'offres, l'attribution et le contrat les lieu dans lequel une prestation ou des travaux seront réalisés.

source: Items should be classified according to an established scheme of codes. A single primary ```classification``` can be given, although an array of ```additionalClassification``` can be provided.
fr: Les éléments doivent être classés selon un schéma établi de codes. Un seul ```classification``` primaire peut être donnée, même si un tableau de classification additionnelle ```additionalClassification``` peut être fourni.

source: Unit
fr: Unité

source: The ```unit``` block allows detailed specification of the parameters and price of units that make up a line-item. Although no code list for units has been established in the current release of the standard, publishers may consider using the Units provided by the [Quantities, Units, Dimensions and Data Types Ontologies](http://www.qudt.org/qudt/owl/1.0.0/unit/) in the ```unit.name``` field (drawing on the CamelCase unit names, such as SquareMile), in order to provide detailed information the cost per unit of a line-item.
fr: Le bloc sur les unités —```unit```— permet la spécification détaillée des paramètres et des prix des unités qui composent un poste de dépense. Bien qu'aucune liste de codes pour les unités n'ait été établie dans la version actuelle du standard, les fournisseurs de données peuvent envisager d'utiliser les unités fournies par les [quantités, unités, dimensions et les ontologies de types de données](http://www.qudt.org/qudt/owl/1.0.0/unit/) dans le champ ```unit.name``` (conçu sur les noms des unités ChatMot comme SquareMile), afin de fournir des informations détaillées sur le coût par unité d'un poste de dépense.

source: Milestone
fr: Etape

source: Milestone information can be included in the [tender](#tender) and [contract implementation](#implementation) blocks.
fr: Les informations sur les étapes peuvent être comprises dans les blocs sur les [appel d'offre](#tender) and [l'éxécution du contrat](#implementation).

source: In the context of a tender block, milestones describe the key deliverables of a contract, or key points during the lifetime of the contract. These may have associated documentation.
fr: Dans le contexte du bloc sur les appels d'offre, les étapes décrivent les principaux livrables d'un contrat ou les points essentiels de la réalisation du contrat. Ces étapes peuvent avoir une documentation associée.

source: In the context of a contract implementation block, milestones are used to track progress towards those deliverables and key events set out in the tender.
fr: Dans le contexte du bloc sur l'exécution d'un contrat, les étapes sont utilisés pour suivre les progrès vers les livrables et les événements clés énoncés dans l'offre.

source: The ```dateModified``` field should be changed whenever the progress towards a milestone is reviewed, and the ```status``` either updated, or re-confirmed.
fr: Le champ sur la date modifiée ```dateModified``` doit être changé dès qu'un progrès vers une étape est revu que le statut ```status``` est soit mis à jour ou re-confirmé.

source: Value
fr: Valeur

source: Financial values should always be published with a currency attached.
fr: Les valeurs financières devraient toujours être associées à une devise.

source: During the period of the 1.0 RC, if information on taxation related to a value is required, this may be handled by an extension. A [discussion of handling taxation can be found on GitHub](https://github.com/open-contracting/standard/issues/112).
fr: Pendant la période de maturation du standard version 1.0 RC, si des informations sur la fiscalité d'une valeur sont nécessaires, elles devront être traitées par une extension. Une discussion sur la fiscalité est en cours sur [GitHub](https://github.com/open-contracting/standard/issues/112).

source: Location
fr: Localisation

source: The addition of location information is currently handled through a [proposed extension](../extensions/location.md) to the standard.
fr: L'ajout d'informations de localisation est actuellement géré par une [extension proposée](../extensions/location.md) au standard.

source: Publisher
fr: Fournisseur de données

source: The publisher block is used in release and record packages to identify the source of a dataset.
fr: Le bloc sur les fournisseur de données est utilisé dans les packages sur les livraisons et les archives pour identifier la source d'un jeu de données.

source: Language
fr: Langue

source: Many publishers need to be able to share key data in multiple languages. All free-text title and description fields in the Open Contracting Data Standard can be given in one or more languages.
fr: De nombreux fournisseurs de données doivent être en mesure de partager des données clés en plusieurs langues. Tous les titres et les descriptions des champs en texte libre dans le standard OCDS peuvent être donnés dans une ou plusieurs langues.

source: Language variations are included by a copy of multi-lingual fields, suffixed with a language code.
fr: Les variations de la langue sont comprises dans des champs multilingues, avec pour suffixe un code de langue.

source: E.g. ```title``` and ```title_es```
fr: Pa exemple, ```title``` and ```title_es```

source: In order to allow users to identify the language used in non-suffixed fields, OCDS release and records should declare the default language in the ```language``` field.
fr: Afin de permettre aux utilisateurs d'identifier la langue utilisée dans les champs non-suffixés, les livraisons OCDS et les archives doivent déclarer la langue par défaut dans le champ ```language```.

source: Languages should be identified using language tags taken from [BCP47](http://tools.ietf.org/html/bcp47). The specification allows BCP47 values in order to accommodate variations in dialect where this is important. However, publishers **should** use the two letter [ISO-639-1 two-digit language tags](http://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) in the vast majority of circumstances, and should not assume that the users are able to distinguish between sub-tag variations (for example, OCDS publishers should strongly prefer 'en' over 'en_US' or 'en_GB').
fr: Les langues doivent être identifiées en utilisant des *tags* spécifiques de langues pris à partir de [BCP47](http://tools.ietf.org/html/bcp47). La spécification permet d'obtenir des valeurs de BCP47 afin de tenir compte des variations dans le dialecte là où c'est important. Cependant, les fournisseurs de données **devraient** utiliser des [tags ISO-639-1 à deux lettres](http://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) dans la grande majorité des cas, et ne devraient pas supposer que les utilisateurs sont en mesure de faire la distinction entre les variations de sous-tags (par exemple, les éditeurs OCDS doivent fortement préférer 'en' à 'en_US' ou 'en_GB').

source: To include a language variation of a field, the field name should be suffixed with _ and the appropriate language tag. For example: ```title_es``` for Spanish.
fr: Pour inclure une variation linguistique d'un champ, le champ du nom doit avoir _ et le *tag* de langue. Par exemple : ```title_es``` pour l'espagnol.

source: Worked example
fr: Un cas d'utilisation

source: A contract is for ‘Software consultancy services’ may be published in a release with the default language sent to ‘en’ (the ISO-639-1 code for English). The following examples give the description of an item as English, French and Spanish.
fr: Un contrat pour des "services de conseil en logiciels" peut être publié en anglais avec ‘en’ comme langue par défaut ('le code ISO-639-1 pour l'anglais). Les exemples suivants donnent la description d'un élément en anglais, français et espagnol.

source: Release handling
fr: Traitement des livraions

source: The full OCDS data model is based on the idea of publishing a new release every time information about a contracting process changes. This way, users can gain a full view of change over time, and third-parties can understand what needs to be updated in any system that is tracking the progress of a contracting process.
fr: Tout le modèle de données OCDS est basé sur l'idée de publier une nouvelle livraison à chaque fois qu'on processus de passation de marché connait un changement. De cette façon, les usagers peuvent obtenir une vue complète des changements au fil du temps, et les tierces-parties peuvent comprendre ce qui doit être mis à jour dans tout lesystème qui suit le déroulement d'un processus contractuel.

source: Publishers will need to choose how to generate new releases, and whether to repeat information in each release, or just to provide changes. This choice should be based on an understanding the [merging process](merging.md) that is used to generate a snapshot record of a full contracting process.
fr: Les fournisseurs de données devront aussi choisir comment générer de nouvelles livraisons, et si les informations doivent être répétées dans chaque livraison, ou tout simplement pour fournir des changements. Ce choix doit être fondé sur une compréhension du [processus de fusion](merging.md) qui est utilisé pour produire un enregistrement instantané du processus complet de passation de marchés.

source: This model also requires publishers to pay careful attention to null values and missing fields.
fr: Ce modèle doit aussi permettre aux fournisseurs de données de prêter une attention particulière aux valeurs nulles et aux champs manquants.

source: Empty fields
fr: Champs vides

source: Fields that are not being used, or that have no value, can be excluded in their entirety (key and value) from a published file.
fr: Les champs qui ne sont pas utilisés, ou qui ont pas de valeur, peuvent être exclus dans leur intégralité (clé et valeur) à partir d'un fichier publié.

source: Only including fields which have values will keep versioned datasets cleaner.
fr: Le fait d'inclure uniquement les champs qui ont des valeurs permettra de garder les jeux de données versionnés plus propre.
