Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/reference.po
Languages: fr

source: Emptying fields and values
fr: Champs vides et valeurs

source: There may be cases where a publisher needs to remove, rather than update, a value which was set in a previous release. In this case, the fields should explicitly be set to null.
fr: Il peut y avoir des cas où un fournisseur de données a besoin de supprimer, plutôt que de mettre à jour, une valeur qui a étée créé dans une version précédente. Dans ce cas, les champs doivent être explicitement définis sur ```null```.

source: The following describes how null values will be handled in the compilation of a record:
fr: Ce qui suit décrit comment les valeurs NULL seront traitées dans la compilation d'une archive :

source: If a field is included with a value in one release, and then set to ```null``` in a subsequent release, that field will be recorded as null in the compiled record (though past values of it should remain in the versioned section of the record).
fr: Si un champ est inclus avec une valeur dans une livraison, puis mis à ```null``` dans une livraison ultérieure, ce champ sera enregistré comme ```null``` dans l'archive compilée (bien que les valeurs passées de celui-ci doivent rester dans la section versionnée de l'archive).

source: If a field is set to null in one release, and is also set to ```null``` in a subsequent release, it will be recorded as null as per the original release, and the record will not show any change based on the subsequent release I.e. fields that are set to null are recorded as such and then only changed if the value is set.
fr: Si un champ est défini sur null dans une livraison, et est également mis à ```null``` dans une livraison ultérieure, il sera enregistré comme nul selon la livraison originale et l'archive ne montrera pas tous les changement basés sur les champs des livraisons ultérieures. Les champs dont les valeurs sont définies sur ```null``` sont enregistrés en tant que tels et sont seulement changés si une valeur est définie.

source: If a field is set to ```null``` in one release, and then has a value in a subsequent release, it will first appear in the record, and the version section of the record as ```null``` and then with the subsequent value.
fr: Si un champ est fixé sur ```null``` dans une livraison, puis obtient une valeur dans une version ultérieure, cela apparaît d'abord dans l'archive et la section de version de l'archive en tant que ``` null``` puis avec la valeur ultérieure.

source: If a field does not appear in one release, and then appears with a value in a subsequent release, it will first appear in the record, and the version section of the record, when the first release that contains it is compiled into the record.
fr: Si un champ ne figure pas dans une livraison, puis apparaît avec une valeur dans une livraison ultérieure, il apparaît d'abord dans l'archive et la section de version de l'archive, lorsque la première livraison qui le contient est compilée dans l'archive.
