Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/schema/reference.po
Languages: fr

source: Release Reference
fr: Référence sur les livraisons

source: The [Release Schema](release.md) provides a detailed specification of the fields and data structures to use when publishing contracting data. Supplementary schemas show how to combine releases into data packages and how to compile releases into records.
fr: Le [schéma des livraisons](release.md) fournit une spécification détaillée des champs et des structures de données à utiliser lors de la publication de données sur la commande publique. Des schémas complémentaires montrent comment combiner les livraisons en des packages de données et comment compiler les livraisons en archives.

source: This reference page provides key information on using the release schema.
fr: Cette page de référence fournit des informations clés sur l'utilisation du schéma des livraisons.

source: **Note: If any conflicts are found between this text, and the text within the schema, the schema takes precedence**
fr: **Remarque: si un conflit est trouvé entre ce texte et celui du schéma, le schéma prévaut**

source: Release structure
fr: Structure de la livraison

source: The majority of OCDS data is held within a release structure. One or more releases can be published within a release package. Releases are made up of a number of sections, including:
fr: La majorité des données OCDS est organisée selon une structure de livraison. Une ou plusieurs livraisons peuvent être publiées au sein d'un package de livraisons. Les livraisons sont composées de plusieurs sections, dont :

source: [planning](#planning)
fr: [la planification - `planning`](#planning)

source: [tender](#tender)
fr: [l'appel d'offres - `tender`](#tender)

source: [award](#award)
fr: [l'attribution - ````award````](#award)

source: [contract](#contract)
fr: [le marché - ````contract````](#contract)

source: [implementation](#implementation)
fr: [l'exécution - ````implementation````](#implementation)

source: A release can only contain one tender section, but may contain multiple award, contract and implementation sections. This is because each OCDS release relates to [a single contracting process](../getting_started/contracting_process.md), and we define contracting processes by their unique initiation (tender) stage.
fr: Une livraison ne peut contenir qu'une seule section sur l'appel d'offres mais peut contenir plusieurs sections sur l'attribution, le marché et l'exécution. Cela est du au fait que chaque livraison OCDS se réfère à [un seul processus de passation de marché](../getting_started/contracting_process.md) et que nous définissons un processus de passation de marché par une seule étape unique de lancement de l'offre (`tender`).

source: Releases are given a [tag](#release-tag) to indicate the specific stage of a contracting process they represent. However, there are no formal restrictions on when information about a stage of the contracting process may be provided.
fr: Les livraisons reçoivent un [tag](#release-tag) pour indiquer à quelles étapes spécifiques du processus de passation de marché elles correspondent. Cependant, il n'y a pas de restriction formelle sur le moment où les informations sur une étape du processus de passation de marché peuvent être fournies.

source: For example, a publisher announcing the signing of a contract with a 'contract' tag, may also include information in the award and tender blocks in order to provide a comprehensive picture of the contracting process to date which led to that contract being signed.
fr: Par exemple, un producteur de données qui annonce la signature d'un marché avec le tag `contract` peut aussi inclure des informations dans les blocs sur l'attribution et l'appel d'offre afin de fournir une image d'ensemble à date du processus de commande publique qui a mené à la signature du marché.

source: Package Metadata
fr: Métadonnées des packages

source: Releases must be published within a [release package](release_package.md), which can contain one or more releases. The release package, modelled on the [Data Package](http://dataprotocols.org/data-packages/) protocol, provides meta-data about the release(s) it contains, the publisher, and data licensing information.
fr: Les livraisons doivent être publiées dans un [package de livraison](release_package.md) qui peut contenir une ou plusieurs livraisons. Le package de livraison, calqué sur le protocole [Data Package](http://dataprotocols.org/data-packages/), fournit des métadonnées sur le contenu de la ou des livraison(s), le fournisseur de données et des informations sur la licence des données.

source: The uri should uniquely identify this release package. Publishers should provide a [dereferenceable HTTP URI](http://en.wikipedia.org/wiki/Dereferenceable_Uniform_Resource_Identifier) wherever possible and should host the data package at this URI, enabling users to look-up and verify the contents of a release package from its original source.
fr: L'URI doit identifier ce package de livraison de manière unique. Les producteurs de données devraient fournir une [URI HTTP déréférençable](http://en.wikipedia.org/wiki/Dereferenceable_Uniform_Resource_Identifier) chaque fois que cela est possible et héberger le package de données à cette URI, afin de permettre aux usagers de chercher et de vérifier le contenu d'un package de livraisons depuis sa source originale.

source: The [publishedDate](#date) on which this package was published. If a package is automatically generated and re-published on a regular basis, this date should reflect the date of the last change to the contents of the package.
fr: La date de publication [publishedDate](#date) à laquelle le package a été publié. Si le package est généré automatiquement et republié régulièrement, cette date doit indiquer la date de la dernière mise à jour du contenu du package.

source: The publisher [publisher](#publisher) block provides space for an organisation name and identifier.
fr: Le block sur le fournisseur [publisher](#publisher) permet d'indiquer un nom d'organisation et un identifiant.

source: ````license```` - See the [licensing guidance](../implementation/licensing.md) for more details on selecting and publishing license information.
fr: ````license```` - Consultez les [indications sur la licence](../implementation/licensing.md) pour plus de détails sur la sélection et la publication des informations sur la licence.

source: ````publicationPolicy```` - See the [publication policy](../implementation/publication_policy.md) guidance for more details.
fr: ````publicationPolicy```` - Consultez les indications sur la [politique de publication](../implementation/publication_policy.md) pour plus de détails.

source: Release
fr: Livraison

source: The top level of a release consists of the following fields and objects:
fr: Le niveau supérieur d'une livraison contient les champs et les objets suivants :

source: ```ocid``` - Providing each [contracting process](../getting_started/contracting_process.md) with a unique identifier is essential to enable data about contracts to be linked up across different releases. Open Contracting IDs are composed of a prefix assigned to each publisher, and a local identifier drawn from their internal systems that can be used to tie together tenders, awards, contracts and other key data points from a specific contracting process. See the [Open Contracting Identifier guidance](identifiers.md) for details of how to construct an OCID.
fr: ```ocid``` - Fournir un identifiant unique pour chaque [processus de commande publique](../getting_started/contracting_process.md) est essentiel pour permettre que les données à propos de la commande publique soient liées entre différentes livraisons. Les identifiants Open Contracting sont composés d'un préfixe assigné à chaque fournisseur de données et d'un identifiant local extrait des systèmes d'information internes qui peut être utilisé pour lier ensemble offre, attribution, contrat et d'autres données essentielles à propos d'un pro cessus de passation de marché. Consultez les [indications sur les identifiants Open Contracting ](identifiers.md) pour des détails sur la manière de construire un identifiant OCID.

source: ```tag``` - The release tag is used to identify the nature of the release being made. This can be used by consuming applications to filter releases, or may in future be used for advanced validation. A release which updates or amends previous data must always use the appropriate update or amendment release tag. Values must be drawn from the [releaseTag codelist](../../codelists/#release-tag).
fr: ```tag``` - Le tag de livraison est utilisé pour identifier la nature d'une livraison en cours de réalisation. Cela peut être utilisé par des applications qui filtrent les livraisons ou à des fins de validation avancée. Une livraison qui met à jour ou modifie des données antérieures doit toujours utiliser le tag `update` ou `amendment` approprié. Les valeurs sont prises de la [nomenclature des `releaseTag`](../../codelists/#release-tag).

source: ```date``` - The release [date](#date) should reflect the point in time at which the information in this release was disclosed. A release package may contain release with different release dates.
fr: ```date``` - La [date](#date) de la livraison devrait indiquer le moment auquel l'information a été divulguée. Un package de livraisons peut contenir des livraisons avec différentes dates de publication.

source: ```language``` - see the section on [multi-language support](#language) for information on language handling.
fr: ```language``` - voir la section sur [le support multi-langues](#language) pour les informations sur la gestion des langues.

source: ```buyer``` - The buyer details are published using an [organization](#entity) block.
fr: ```buyer``` - Les détails sur l'acheteur sont publiés dans le bloc sur l'[organisation](#entity).

source: Further details on each of the blocks contained within release are below.
fr: Ci-dessous, plus de détails sur chacun des blocs contenus dans une livraison.

source: Planning
fr: Planification

source: The planning section can be used to describe the background to a contracting process. This may include details of the budget from which funds are drawn, or related projects for this contracting process. Background documents such as a needs assessment, feasibility study and project plan can also be included in this section.
fr: La section sur la planification peut être utilisée pour décrire le contexte d'un processus de passation de marché. Cela peut inclure des détails sur le budget d'où sont tirés les fonds ou les projets reliés à ce processus de passation de marché. Les documents sur le contexte tels qu'une étude de besoins, une étude de faisabilité et un plan du projet peuvent être inclus dans cette section.

source: Apart from documents, the majority of information is held within the budget block. This is designed to allow both machine-readable linkable data about budgets, cross-referencing to data held in other standards such as the [Fiscal Data Package](http://fiscal.dataprotocols.org/) or [International Aid Transparency Initiative Standard](http://www.iatistandard.org), and human readable description of the related budgets and projects, supporting users to understand the relationship of the contracting process to existing projects and budgets even where linked data is not available.
fr: Outre les documents, la majorité des informations sont contenues dans le bloc sur le budget. Celui-ci a été conçu avec un double impératif. D'une part, permettre la lisibilité des données par les machines et leur mise en lien avec des données publiées avec d'autres standards telles que le [Fiscal Data Package](http://fiscal.dataprotocols.org/) ou [International Aid Transparency Initiative Standard](http://www.iatistandard.org). D'autre part, fournir une description des budgets et des projets connexes qui soit intelligible par les humains afin d'aider les utilisateurs à comprendre le lien entre un processus de passation de marché et des projets et des budgets existants, même lorsque des données liées ne sont pas disponibles.

source: Tender
fr: Appel d'offre

source: The tender section includes details of the announcement that an organization intends to source some particular goods, works or services, and to establish one or more contract(s) for these.
fr: La section sur l'appel d'offres comprend des détails sur l'annonce faite par une organisation qu'elle a l'intention de se procurer certains biens, travaux ou services, et souhaite établir un ou plusieurs contrat(s) pour ces derniers.

source: It may contain details of a forthcoming process to receive and evaluate proposals to supply these goods and services, and may also be used to record details of how a completed tender process, including details of bids received.
fr: Elle peut contenir des détails sur un processus à venir afin de recevoir et évaluer les offres pour fournir ces biens et services et peut également être utilisée pour enregistrer les détails sur un processus d'appel d'offres terminé, y compris les détails des offres reçues.

source: ```tender.id``` - see the [identifiers guidance](../../identifiers/#tender_award_and_contract) for further information on the tender identifier. In most cases this can be the same as the ocid.
fr: ```tender.id``` - voir les [indications sur les identifiants](../../identifiers/#tender_award_and_contract) pour plus d'informations sur l'identifiant d'appel d'offres. Dans la plupart des cas, cela peut être le même que l'identifiant ocid.

source: ```procuringEntity``` - in some cases the organization managing the procurement process may be different from the organization whose budget is being used for the procurement (the 'buyer' in OCDS terminology). If this is the case, then the details of this procuring organization should be provided here.
fr: ```procuringEntity``` - dans certains cas, l'organisation en charge du processus de commande publique peut être différente de l'organisation dont le budget est utilisé pour le marché (l' « acheteur » dans la terminologie OCDS). Si tel est le cas, alors les détails de cette organisation adjudicatrice devraient être complétés ici.

source: ```title``` and ```description``` - tender title and description are optional. The details of items to be procured should always be provided in ```items```. Descriptions should not be used in place of providing structured data on items, dates and other details. Instead, title and description should be used to provide a brief overview of the tender. Publishers should consider adopting a 'tweet length' title, and should avoid ALL UPPERCASE titles, or titles containing code words or other artefacts from internal databases. The goal of these fields is to give users a clear idea of the nature of a tender.
fr: ```title``` et ```description``` - le titre et la description de l'appel d'offres sont facultatifs. Les détails des lots doivent toujours être fournis dans ```items```. Les descriptions ne doivent pas être utilisées pour remplacer des données structurées sur les lots, les dates et d'autres détails.Le titre et la description doivent plutôt être utilisés pour donner un bref aperçu de l'offre. Les fournisseurs de données devraient envisager de ne pas dépasser la longueur d'un tweet pour les titres, et d'éviter les titres en MAJUSCULES ou des titres contenant des noms de code ou des termes issus de référentiels internes. Ces champs doivent servir à donner aux utilisateurs une idée claire de la nature d'un appel d'offres.

source: ```items``` - publishers should provide details of each of the items to be procured under this tender.
fr: ```items``` - les fournisseurs de données devraient fournir des détails sur chacun des lots sur lesquels porte l'appel d'offres.

source: ```milestones``` - publishers should list any relevant [milestones](#milestone) associated with the delivery of the goods and services covered by this tender. These are the milestones against which the whole contracting process will be evaluated. Publishers may include information about key milestones during the tender process itself, but should not use this in place of ```tenderPeriod```, ```enquiryPeriod``` or ```awardPeriod```.
fr: ```milestones``` - les éditeurs devraient énumérer toutes les [étapes](#milestone) associées à la fourniture des biens et services couverts par l'appel d'offres. C'est en partant de ces étapes que l'ensemble du processus de passation des marchés sera évalué. Les fournisseurs de données peuvent inclure des informations sur les étapes clés pendant le processus d'appel d'offres lui-même, mais ne devraient pas utiliser ce champ pour remplacer ```tenderPeriod```, ```enquiryPeriod``` ou ```awardPeriod```.

source: ```value``` and ```minValue``` - the total upper estimated value of a procurement should be given in ```value```. For publishers who also specify a estimate minimum value, this can be placed in ```minValue```.
fr: ```value``` et ```minValue``` - la valeur totale maximale estimée d'un marché public doit être donné dans le champ ```value```. Pour les fournisseurs de données qui spécifient également une estimation minimale, cela peut être placé dans ```minValue```.

source: ```procurementMethod``` and ```procurementMethodRationale```. Tendering processes can use a variety of methods. Publishers should map their methods to one of the approved codes according to the [GPA definitions](http://www.wto.org/english/docs_e/legal_e/rev-gpr-94_01_e.htm) of open, selective or limited. A free text explanation of why a given method was appropriate to this tender can be provided in ```procurementMethodRationale```.
fr: ```procurementMethod``` et ```procurementMethodRationale```. Les processus d'appel d'offres peuvent utiliser des méthodes variées. Les fournisseurs de données doivent cartographier leurs méthodes par rapport aux codes approuvés par [l'Organisation Mondiale du Commerce](http://www.wto.org/english/docs_e/legal_e/rev-gpr-94_01_e.htm) : ouvert, sélectif ou limité. Un texte libre justifiant le choix d'une méthode donnée peut être fourni dans le champ ```procurementMethodRationale```.

source: ```awardCriteria``` and ```awardCriteriaDetails``` - The [award criteria code list](../../codelists/#award-criteria) describes the basis on which contract awards will be made. This is an open codelist, and so may be extended with new codes. Free text describing the basis on which bids will be judged, and made, can be provided in the ```awardCriteriaDetail``` field. Publishers wishing to provide more structured information about selection, shortlisting and award criteria should propose [extensions](conformance_and_extensions.md) for this.
fr: ```awardCriteria``` et ```awardCriteriaDetails``` - La [liste des codes sur les critères d'attribution](../../codelists/#award-criteria) décrit sur quelles bases l'attribution des contrats sera effectuée. C'est une liste ouverte de codes, elle peut donc être étendue avec de nouveaux codes. Du texte libre décrivant les bases sur lesquelles les offres seront jugées peut être ajouté dans le champ ```awardCriteriaDetail```. Les fournisseurs de données qui souhaitent fournir des informations plus structurées sur la présélection, la sélection et les critères d'attribution devront proposer des [extensions](conformance_and_extensions.md).

source: ```documents``` - supporting documentation should be attached to the tender. This may include official legal notices of tender, as well as technical specifications, evaluation criteria, and, as a tender process progresses, clarifications, replies to queries and copies of bids submitted or listings of shortlisted firms. See the [attachments](#attachments) section for more details of how to include documents, and consult the [documentType codelist](codelists.md/#document-type) for suggested documents to include for basic, intermediate or advanced publication.
fr: ```documents``` - les documents explicatifs doivent être joints à l'appel d'offres. Cela peut comprendre des avis officiels d'appels d'offres, ainsi que les spécifications techniques, les critères d'évaluation, et, au fur et à mesure de l'avancement de l'appel d'offres, des éclaircissements, des réponses aux demandes de renseignements et des copies des offres soumises ou des listes d'entreprises présélectionnées. Consultez la section sur les [pièces jointes](#attachments) pour plus de détails sur la manière dont des documents peuvent être inclus, et consultez la [nomenclature des `documentType](codelists.md/#document-type) pour comprendre quels documents il est suggéré d'inclure pour la publication de données OCDS aux niveaux basique, intermédiaire ou avancé.

source: Information on bidders against a contract will be handled by an [extension](conformance_and_extensions.md) during the period of the standard release candidate. Publishers wishing to provide detailed information on bidders should [contact support](../support/index.md).
fr: Les informations sur les soumissionnaires à un marché seront gérées par une [extension](conformance_and_extensions.md) pendant la période de test d'une version candidate (release candidate) du standard. Les fournisseurs de données qui souhaiteraient fournir des informations détaillées sur les soumissionnaires doivent [contacter l'assistance technique](../support/index.md).

source: Award
fr: Attribution

source: The award section is used to announce any awards issued for this tender. There may be multiple awards made. Releases can contain all, or a subset, of these awards. A related award block is required for every contract, as it contains information on the suppliers.
fr: La section sur l'attribution — ```award``` — est utilisée pour annoncer les attributions de marché liées à cet appel d'offres. Plusieurs attributions peuvent être annoncées. Les livraisons peuvent contenir toutes les attributions ou un sous-ensemble. Un bloc d'attribution est exigé pour chaque contrat, car il contient des informations sur les fournisseurs.

source: Contract
fr: Contrat

source: The contract section is used to provide details of contracts that have been entered into. Every contract needs to have a related award, linked via the ```awardID``` property. This is because supplier information is contained within the 'award'. The framework contract details below help illustrate the reasons for this.
fr: La section sur les contrats — ```contract``` — est utilisée pour fournir des détails sur les marchés qui ont été conclus. Tout contrat doit être lié à une attribution par la propriété ```awardID```. C'est du au fait que les informations sur les fournisseurs sont contenues dans la section sur l'attribution. Les détails sur les contrats-cadre qui figurent ci-dessous peuvent aider à illustrer les raisons pour cela.

source: Framework contracts
fr: Contrats-cadre

source: A framework is an agreement with suppliers to establish terms governing contracts that may be awarded during the life of the agreement[*](http://www.constructingexcellence.org.uk/tools/frameworkingtoolkit/whatis.jsp).
fr: Un contrat-cadre est un accord avec des fournisseurs pour établir les termes régissant les marchés ou bons de commande qui peuvent être conclus ou attribués pendant la durée de l'accord[*](http://www.constructingexcellence.org.uk/tools/frameworkingtoolkit/whatis.jsp).

source: Framework **agreements** can be represented by [awards](#award), which would each detail a supplier participating in the framework, the line items that the agreement covers with this supplier, and any maximum value for the agreement over time.
fr: Les **accords-cadre** peuvent être représentés comme des [attributions](#award), chacune détaillant un fournisseur participant à l'accord, les biens ou services couverts par l'accord et la valeur maximale pour la durée de l'accord.
