Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/hosting.po
Languages: es, fr

source: Data files, APIs and discovery
es: Archivos de datos, APIs y facilidad de descubrimiento
fr: Fichiers de données, API et découverte

source: Different users have different needs when it comes to accessing OCDS data.
es: Distintos usuarios tienen distintas necesidades cuando requieren acceder a datos del OCDS.
fr: Les besoins d'accès aux données OCDS sont propres à chaque utilisateur.

source: [Data on the Web Best Practice #15](https://www.w3.org/TR/dwbp/#dataFormats) suggests that "Data should be available in multiple data formats" in order to increases the number of different users, tools and applications that can process the data.
es: [La Mejor Práctica de la Web #15](https://www.w3.org/TR/dwbp/#dataFormats) sugiere que "Los datos deben estar disponibles en mútiples formatos de datos" para aumentar el número de distintos usuarios, herramientas y aplicaciones que pueden procesar los datos.
fr: [La meilleure pratique du Web #15](https://www.w3.org/TR/dwbp/#dataFormats) suggère que les données devraient être publiées sous de multiples formats, de façon a augmenter le nombre d'utilisateurs, le nombre d'outils, et le nombre d'applications pouvant traiter ces données

source: Which formats are most important will depend on the priority use cases for each OCDS implementation, but you should consider:
es: Cuáles formatos son más importantes dependerá de los casos de uso prioritarios para cada implementación de OCDS, pero debes considerar:
fr: Le choix des formats devra prendre en considération les cas d'utilisation de chaque implantation OCDS , les formats suivants sont recommandés:

source: **Bulk downloads** - packaging together multiple releases or multiple records in one or more files for users to download and import into local tools.
es: **Descargas en volumen** - empaquetar múltiples entregas o registros en uno o más archivos para que los usuarios descarguen e importen a herramientas locales.
fr: **Téléchargements massifs** - fusionner plusieurs publications ou plusieurs dossiers en un seul fichier pour permettre le téléchargement et l'utilisation d'outils sur l'ordinateur de l'usager.

source: **Individual release and record downloads** - providing a URI at which each release or record can be obtained. This is crucial for 4 ☆ data publication.
es: **Descargas de entregas y registros individuales** - proveyendo una URI en la que cada entrega o registro pueda obtenerse. Esto es crucial para una publicación de datos de 4 ☆.
fr: **Téléchargement individuel d'une publication ou d'un dossier** - fournir un URI pour chaque publication et dossier est de la plus haute importance pour un service 4 ☆.

source: **CSV and Spreadsheet serializations** - providing multiple releases or compiled records for download, enabling users to work with data directly in spreadsheet software or other tools.
es: **Seriación de CSVs y hojas de cálculo** - proveer varias entregas o registros compliados para descarga, permitiendo a los usuarios trabajar con los datos directamente en un software de hoja de cálculos u otras herramientas.
fr: **CSV et tableurs** - publications et dossiers offerts en format CSV pour utilisation directe dans des tableurs et autres outils d'analyse.

source: **API access** - enabling interactive access to your data. OCDS does not currently provide a standard for constructing APIs, but [potential approaches can be discussed with the community here](https://github.com/open-contracting/standard/issues/290).
es: **Acceso a una API** - permitiendo acceso interactivo a tus datos. Actualmente el OCDS no provee un estándar para construir AIs, pero [aproximaciones potenciales pueden discutirse con la comunidad aquí](https://github.com/open-contracting/standard/issues/290).
fr: **Accès via un API** - permettre un accès interactif via une interface applicative. OCDS ne propose pas, pour le moment, de standard pour construire un API, mais [différentes approches sont présentement discutées ici](https://github.com/open-contracting/standard/issues/290).

source: Bulk downloads
es: Descargas en volumen
fr: Téléchargements massifs

source: The release and record data package containers (in JSON and CSV) offer a way to provide **bulk access** to a collection of contracting process release and records.
es: Los contenedores de paquetes (en JSON y CSV) de entregas y registros son una forma de proveer **acceso en volumen** a una colección de entregas y registros de un proceso de contratación.
fr: Les 'data package containers' (dans JSON et CSV) offre la possibilité de téléchargement massifs des publications et dossiers d'une collection de processus de passation de marché public.

source: However, very large files can be difficult for users to download and process. The following section provides suggested good practices which will assist users in accessing data. These are not requirements of the standard, but are based on experiences of maximising the number of users able to work with datasets with their existing hardware and software.
es: Sin embargo, los archivos muy grandes pueden ser difíciles de descargar y procesar para los usuarios. La seiguiente sección provee buenas práctivas sugeridas que ayudarán a los usuarios a acceder a los datos. Estos no son requerimientos del estandar sino están pasadas en experiencias de maximizar la cantidad de usuarios que pueden trabajar con los conjuntos de datos con su hardware y software existente.
fr: Les très gros fichiers peuvent être difficiles à télécharger. Les paragraphes qui suivent suggèrent des bonnes pratiques pour aider les utilisateurs.Ce ne sont cependant pas des standards obligés, elles visent à augmenter le nombre d'utilisateurs éventuels.

source: File size limits
es: Límites de tamaño de archivo
fr: Taille limite des fichiers

source: When generating data packages for bulk download, apply the following limits:
es: Cuando se generan paquetes de datos para descarga en volumen, aplica los siguientes límites:
fr: Lors de la génération des fichiers pour téléchargements massifs, respecter les limites suivantes:

source: Unzipped OCDS data packages should not exceed 1Gb each;
es: Una vez descomprimidos, los paquetes de datos del OCDS no deben exceder 1Gb cada uno;
fr: Les paquets OCDS non compressés ne devraient pas excéder 1Gb chacun;

source: Zipped OCDS data packages should not exceed 10 Mb each;
es: Los paquetes de datos comprimidos de OCDS no deben exceder 10 Mb cada uno;
fr: Les paquets OCDS compressés ne devraient pas excéder 10Mb chacun;

source: A single OCDS data package should contain a maximum of 250,000 awards or contracts;
es: Un sólo paquete de datos de OCDS debe contener un máximo de 250,000 adjudicaciones o contratos;
fr: Un paquet OCDS devrait contenir un maximum de 250 000 adjudication ou contrats;

source: When a file is likely to exceed one of these limits, release or records should be split across multiple files. Dynamically generated bulk downloads do not have to apply these limits, though publishers should consider ways to advise users when a query is likely to generate a very large file.
es: Cuando es probable que un archivo exceda uno de estos límites, las entregas o registros deberán dividirse en varios archivos. Las descargas en volumen generadas dinámicamente no tienen que aplicar estos límites, aunque los publicadores deberían considerar formas de asesorar a los usuarios cuando una consulta puede generar un archivo muy grande.
fr: Si le fichier généré risque d'excéder ces limites, il devrait être scinder. Les téléchargements massifs dynamiquement créés n'ont pas a respecter ces limites mais un avis sur la taille du fichier devrait être donné à l'utilisateur.

source: Segmenting files
es: Segmentando los archivos
fr: Segmentation des fichiers

source: When the suggested limits require publication of multiple files, publishers should consider ways to split data across available files.
es: Cuando los límites sugeridos requieren la publicación de múltiples archivos, os publicadores deben considerar maneras de dividir los datos en varios archivos.
fr: Lorsque la taille du document excède les limites recommandées, l'éditeur devrait considérer ces différentes méthodes de segmentation:

source: For releases, publishers may choose to:
es: Para las entregas los publicadores pueden elegir:
fr: Pour les Publications, l"éditeur pourrait choisir entre :

source: Segment by **releaseDate - **placing all the releases from a given day, month or year in the same file;
es: Segmentar por **releaseDate** - poniendo todas las entregas de cierto día, mes o año en el mismo archivo;
fr: Segmentation par **releaseDate - ** toutes les publications d'une même date dans un même fichier;

source: Segment by **contracting process identifier **- placing all the releases related to a given set of contract process identifiers together in the same data package;
es: Segmentar por **identificador del proceso de contratación** - colocando todas las entregas relacionadas con cierto conjunto de identificadores de proceso de contratación juntas en el mismo paquete de datos;
fr: Segmentation par **identifiant du processus de passation de marché**- toutes les publications en rapport avec le processus dans un même paquet;

source: For records, publishers should segment either based on the first **releaseDate** associated with a contracting process, or by **contracting process identifier.**
es: Para los registros, los publicadores deberían de segmentar basados en la primera **releaseDate** asociada con un proceso de contratación o por un **identificador de procesos de contratación**.
fr: Pour les Dossiers, l'éditeur pourrait choisir de segmenter selon la première date de publication **releaseDate** ou selon l'identifiant du processus de passation de marché.

source: Following these approaches will avoid release and records 'jumping' between files when the bulk files are updated.
es: Seguir estas estrategias evitará que las entregas y los registros 'salent' entre los archivos cuando los archivos en volumen se actualicen.
fr: Cette approche permettra d'éviter les chevauchements de publications et dossiers lors de la mise à jour de fichiers pour téléchargements massifs

source: Compression
es: Compresión

source: OCDS data packages may be compressed in order to save on diskspace and bandwidth.
es: Los paquetes de OCDS pueden estar comprimidos para ahorrar espacio de disco y ancho de banda.
fr: Les paquets OCDS peuvent être compressés pour économiser espace et bande passante.

source: If compressing data packages, publishers *should* use the zip file format.
es: Los publicadores *deberán* utilizar el formato zip en caso de comprimir los paquetes de datos.
fr: Le format zip est recommandé pour la compression des données.

source: Serving files
es: Poniéndolos en servicio
fr: Serveur de fichiers

source: Publishers should ensure that the web server providing access to bulk files correctly reports the [HTTP Last-Modified](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.29) header so that consuming applications only need to download updated files.
es: Los publicadores deben asegurarse de que el servidor web que provea acceso a archivos en volumen reporte correctamente el encabezado [HTTP Last-Modified](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.29) de manera que las aplicaciones de consumo sólo necesiten descargar los archivos actualizados.
fr: Les éditeurs doivent s'assurer que le serveur de fichiers web montre correctement l'entête de la dernière publication mise à jour [HTTP Last-Modified](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.29) pour éviter des téléchargements initiles de versions antérieures.

source: Individual releases and records
es: Entregas y registros individuales
fr: Publications et Dossiers

source: To achieve [4 ☆](levels.md) ODCS publication requires each release and record to be accessible at a permanent URI. This may be achieved by:
es: Para alcanzar [4 ☆](levels.md) la publicación de OCDS requiere que cada entrega y registro estén accesibles en una URI permanente. Esto puede lograrse al:
fr: Pour atteindre le niveau quatre étoiles [4 ☆](levels.md), le standard ODCS demande que chaque publication ait son propre URL et que chaque dossier (processus de passation de marché) ait aussi son URL. Cet objectif peut être atteint par :

source: (a) Archiving a single-release release package for each release to a web accessible file system as it is created, and then regularly merging these releases to compile individual record files in the same file system. One approach may be to have a folder for each ```ocid``` and to place the releases and record related to that process into that folder.
es: (a) Archivar un paquete de entrega única para cada entrega en un sistema de archivos accesible a través de la web cuando se crea y luego uniendo estas entregas para compilar archivos de registro individuales en el mismo archivo de sistema. Una aproximación puede ser tener una carpeta para cada ```ocid``` y colocar las entregas y registros relacionados con ese proceso en dicha carpeta.
fr: (a) Archiver individuellement et progressivement chaque publication sur un serveur de fichiers accessible via le web. Régulièrement fusionner les différentes publication en un seul fichier. Une approche serait d'avoir un classeur nommé avec l'identifiant de processus ```ocid``` et placer dans ce classeur toutes les publications et le dossier du processus de passation de marché.

source: (b) Providing access to releases and records through an API.
es: (b) Proveer acceso a las entregas y registros a través de un API.
fr: (b) Offrir un accès aux publications et aux dossiers via une application interactive (API).

source: Note that the second approach will require the API to maintain a full revision history of each contracting process, so that releases from each stage of a contracting process can be provided.
es: Tome en cuenta que la segunda aproximación requerirá que la API mantenga un historial de revisión completo de cada proceso de contratación, de manera que otras entregas de cada etapa de un proceso de contratación pueda hacerse disponible.
fr: À noter que cette seconde approche demande que l'API maintienne l'historique des mise à jour du processus de passation de marché de façon à montrer toutes les phases du processus.

source: Publishers should consider how to [ensure URIs can remain stable](https://www.w3.org/Provider/Style/URI.html), even across a change of systems.
es: Los publicadores deben de considerar cómo [asegurar que las URIs permanezcan estables](https://www.w3.org/Provider/Style/URI.html), incluso cuando cambien de sistema.
fr: Recommandations pour que [les URIs demeurent stables](https://www.w3.org/Provider/Style/URI.html), même dans le cas de changement de systèmes.

source: Flattened serializations
es: Seriación plana
fr: Sérialisations aplanies

source: The [serialization](../../serialization/) page provides details of how to generate 'flat' versions of OCDS data for use in spreadsheet software.
es: La página de [seriación](../../serialization/) da detalles sobre cómo generar versiones 'planas' de datos de OCDS para usar en software de hojas de cálculo.
fr: La page [serialization](../../serialization/) renseigne sur la création d'une version aplanie des données OCDS pour utilisation avec les tableurs.

source: The same principles discussed for bulk files above should be applied to CSV or Excel downloads of data.
es: Los mismos principios discutidos para los archivos en volumen deben aplicarse para las descargas de datos en CSV o Excel.
fr: Les même recommandations faites pour les fichiers de téléchargement massifs devraient s'appliquer pour les fichiers aplanies de type CSV pour importer dans des tableurs.

source: Discovery and APIs
es: Facilidad de descubrimiento y APIs
fr: Découvertes et API

source: There are many thousands of organisations who should be able to publish Open Contracting data. As a result, maintaining a central registry of all published data is impractical. Instead, OCDS proposes a common pattern for the discovery of Open Contracting data releases and records.
es: Hay varios miles de organizaciones que deberían de poder publicar datos de Contrataciones Abiertas. Como resultado, mantener un registro centralizado de todos los datos publicados es impráctico. En su lugar, el OCDS propone un patrón común para el descubrimiento de datos de entregas y registros de Contrataciones Abiertas.
fr: À terme, des milliers d'organisations vont publier des données ouverte sur les processus de passation de marché. Il serait difficile et coûteux de maintenir un registre centralisé. OCDS propose donc un modèle commun pour retrouver toutes ces données concernant les processus de passation de marché.

source: For the discovery of bulk datasets, and the location of any data feeds, we propose use of a data.json file.
es: Para el descubrimiento de conjuntos de datos en volumen y la ubicación de cualquier sistema de alimentación de datos, proponemos usar un archivo data.json
fr: Pour la découverte des jeux de données massifs et la localisation des flux de données, OCDS propose l'utilisation d'un fichier data.json.

source: For the discovery of individual releases and records, we propose use atom feeds.
es: Para el descubrimiento de entregas y registros individuales proponemos un formato de redifusión atom.
fr: Pour la découverte des publications individuelles et des dossiers, OCDS propose d'utiliser le flux web Atom.

source: There is a [community discussion here](https://github.com/open-contracting/standard/issues/290) on whether OCDS should include a proposed API standard in future iterations.
es: Hay una [discusión con la comunidad aquí](https://github.com/open-contracting/standard/issues/290) sobre incluir un estándar de API en futuras iteraciones del OCDS.
fr: Une [discussion est engagée ici:](https://github.com/open-contracting/standard/issues/290) sur l'opportunité pour OCDS de développer un API standard et de l'inclure dans une future itération.

source: Dataset and feed discovery
es: Facilidad de descubrimiento de conjuntos de datos y formato de redifusión
fr: Jeux de données et découverte des flux

source: Publishers should provide a data.json document describing the location of all of the bulk OCDS files available for download.
es: Los publicadores deberán poner disponible un documento data.json que describa la ubicación de todos los archivos OCDS en volumen disponibles para descargar.
fr: Les éditeurs devraient fournir un document data.json donnant la localisation de tous les jeux de données massifs disponibles pour le téléchargement.

source: This should follow the structure proposed by the [US Project Open Data](https://project-open-data.github.io/schema/) with:
es: Este deberá de seguir la estructura propuesta por el [US Project Open Data](https://project-open-data.github.io/schema/) con:
fr: Ce document data.json devrait respecter la structure proposée par: [US Project Open Data](https://project-open-data.github.io/schema/) :

source: Each record containing a distribution block with at least one accessURL pointing to OCDS data.
es: Cada registro que contenga un bloque de distribución con por lo menos un accessURL que apunte a datos de OCDS.
fr: Chaque enregitrement devant contenir un bloc de distribution avec au moins un URL pointant sur les données OCDS.

source: Each record containing 'open-contracting-data', and either 'open-contracting-release' or 'open-contracting-record' in the keyword array.
es: Cada registro que contenga 'open-contracting-data' y 'open-contracting-release' o 'open-contracting-record' en la matriz de palabras clave.
fr: Chaque enregistrement devant contenir le mot clé : 'open-contracting-data' et un des deux mots clés suivants: 'open-contracting-release' ou 'open-contracting-record'

source: accessLevel set appropriately
es: El accessLevel establecido apropiadamente
fr: Et les permissions d'accès (accessLevel) correctement réglées

source: In addition, the data.json document may contain one or more records with the keyword 'open-contracting-feed' and either 'open-contracting-release' or 'open-contracting-record' and pointing via an accessURL in their distribution block to an atom feed document.
es: Adicionalmente, el documento data.json debe contener uno o más registros con la palabra clave 'open-contracting-feed' y alguna de 'open-contracing-release' o 'open-contracting-record' y apuntar a un documento de formato de redifusión atom via una accessURL en su bloque de distribución.
fr: De plus le document data.json pourrait contenir quelques enregistrements avec le mot clé 'open-contracting-feed' et un des deux mots clé suivants: 'open-contracting-release' ou 'open-contracting-record' et dans le bloc de distribution, un URL pointant sur un flux web Atom.

source: Feeds
es: Formatos de redifusión
fr: Flux Web

source: Publishers exposing individual records and releases, of regularly updated data packages in small sets, should provide one or more [atom feeds](http://en.wikipedia.org/wiki/Atom_%28standard%29) that index these, and provide an easy mechanism for users to discover recently published or updated release and records.
es: Los publicadores que expongan entregas y registros individuales de paquetes de datos en conjuntos pequeños actualizados regularmente, deben proveer uno o más [formatos de redifusión atom](http://en.wikipedia.org/wiki/Atom_%28standard%29) que los liste y provea un mecanismo fácil para que los usuarios descubran entregas y registros recientemente publicados o actualizados.
fr: Les éditeurs qui publient régulièrement des mises à jour de petits jeux de données devrait les indexer sur des [flux web atom] (http://en.wikipedia.org/wiki/Atom_%28standard%29) un mécanisme pour découvrir facilement les puplications et dossiers mis à jour.

source: The link to the release or record should be provided via a ```<link>``` tag, and the updated date of the entry should reflect the updated date of that release or record. The ```<id>``` should reflect the release id for release, or the ocid for records.
es: El enlace a la entrega o registro debe de otorgarse via una etiqueta ```<link>``` y la fecha actualizada de la entrada debería reflejar la fecha actualizada de esa entrega o registro. El ```<id>``` deberá reflejar el id de la entrega o el ocid del registro.
fr: Le lien à la Publication ou au Dossier doit être fourni via l'étiquette ```<link>``` , et la date de l'inscription doit correspondre à la date de la Publication ou du Dossier. L'inscription doit montrer l'identifiant ```<id>``` de la Publication ou l'identifiant ```<ocid>``` du Dossier.

source: The release.tag should be contained within an ```<category>``` element of the feed.
es: La etiqueta de entrega debería de encontrarse dentro de un elemento ```<category>``` del formato.
fr: L'étiquette de la publication (release.tag) doit être à l'intérieur de l'élément ```<category>``` du flux.

source: Feeds requiring pagination should follow the approach set out in [RFC 5005](https://tools.ietf.org/html/rfc5005#section-3).
es: Los farmatos que requieran paginación deberán de seguir la aproximación planteada en [RFC 5005](https://tools.ietf.org/html/rfc5005#section-3).
fr: Pour la pagination des flux suivre les recommandations en [RFC 5005](https://tools.ietf.org/html/rfc5005#section-3).
