Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/hosting.po
Languages: es, fr

source: Future implementations of OCDS will explore use of the <a href="http://tools.ietf.org/html/rfc5785">/.well-known/</a> protocol to declare a location for storing a data.json file.
es: Implementaciones futuras del OCDS explorarán el uso del protocolo <a href="http://tools.ietf.org/html/rfc5785">/.well-known/</a> para declarar la ubicación donde se almacene un archivo data.json.
fr: Les implantations OCDS futures vont explorer l'usage du protocole "Well Known URI" pour déclarer la localisation du fichier data.json. <ahref="http://tools.ietf.org/html/rfc5785">/.well-known/</a>

source: At present, such files can be hosted anywhere, and consuming applications pointed towards them manually.
es: Por ahora dicho archivos pueden hospedarse en cualquier lugar y las aplicaciones que los consuman apuntar a ellos manualmente.
fr: Présentement les fichiers data.json peuvent être hébergés n'importe où. La localisation de ces fichiers doit être donnée manuellement aux applications.

source: The data.json structure has been chosen to allow organisations following this approach to include tagged 'open-contracting-data' within their existing data discovery mechanisms, and given the availability of a plugin for the widely used CKAN which will also support exposure of data.json files.
es: La estructura de data.json ha sido elegida para permitir que las organizaciones que sigan esta aproximación incluyan los datos etiquetados 'open-contracting-data' dentro de sus mecanismos de descubrimiento de datos y les de la disponibilidad de utilizar un plugin para CKAN, el cual tiene una amplia adopción, lo cual también aumentará la exposición de los archivos data.json.
fr: La structure data.json a été retenue car elle permet d'inclure l'étiquette 'open-contracting-data' à l'intérieur du mécanisme de découverte existant et aussi la disponibilité de plug-in pour CKAN largement utilisé et qui supporte l'exposition de fichiers data.jason

source: Linking data
es: Enlazando los datos
fr: Lier les données

source: For 5 ☆ publication of OCDS data, publishers should seek to use URIs in their datasets, linking to other machine-readable data sources at an entity-by-entity level.
es: Para tener 5 ☆ en sus publicaciones de datos de OCDS, los publicadores deberán buscar utilizar URIs en sus conjuntos de datos que enlacen a otras fuentes de datos legibles por una computadora a un nivel de entidad por entidad.
fr: Pour une publication cinq étoiles 5 ☆ des données OCDS data, les éditeurs doivent chercher à utiliser des URIs dans leur jeux de données, les liant à d'autres sources de données.
