Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/levels.po
Languages: es, fr

source: Publishing data at custom download locations, or through custom query interfaces, requires users to manually discover and access data.
es: Publicar datos en sitios de descarga o interfaces a la medida requiere que los usuarios descubran y accedan a los datos manualmente.
fr: Les données publiées sur des dite personnalisés, ou via des interfaces uniques exige des utilisateurs beaucoup de travail pour découvrir et accéder aux données.

source: Applying best practices for publishing on the web will allow automatic discovery of information, making contracting information more searchable for humans, easier to track and follow at a per-contract level, and more accessible for powerful big-data analysis that can make connections across many open contracting datasets.
es: Utilizar mejores prácticas para publicar en la red permitirá el descubrimiento automático de la información, haciendo que la información sea más fácil de buscar para las personas, más fácil de seguir a nivel de cada contrato y más accesible para análisis de big data que pueda hacer conexiones entre varios conjuntos de datos de contrataciones abiertas.
fr: Les meilleures pratiques de publications sur le web permettent la découverte automatisée des données. Les renseignements sur les processus de passation de marché deviennent facilement accessibles aux humains, qui peuvent facilement suivre l'évolution d'un processus en particulier. D'autre part, la diffusion de fichiers structurés pour téléchargement massif, permet des analyse et des croisements de données entre les organisations et les secteurs d'activités.

source: ☆ ☆ ☆ ☆ Use best practices for data on the web
es: ☆ ☆ ☆ ☆ Usa mejores prácticas para los datos en la red
fr: ☆ ☆ ☆ ☆ Utiliser les meilleures pratiques de publication sur le web

source: Make each **release** and **record** describing a contracting process accessible at its own persistent URI (web address).
es: Haz que cada **entrega** y **registro** que describa un proceso de contratación esté accesible en su cada URI persistente (diección web).
fr: Assigner une adresse web persistante URI à chaque **Publication** et à chaque **Dossier**, le Dossier étant une collection de Publications concernant un processus spécifique de passation de marché public.

source: Provide feeds that detail recently changed information, and that allow users to search for specific kinds of tenders, awards or contracts (for example, by the classification of goods and services being procured).
es: Da acceso a fuentes que detallen la información que haya sido cambiada recientemente y que permita a los usuarios buscar tipos específicos de licitaciones, adjudicaciones o contratos (por ejemplo, por la clasificación de bienes y servicios que se licitan).
fr: Diffuser des Flux sur vos récentes mises à jour avec des mots clés permettant de retracer facilement certaines étapes d'un processus, certains produits ou services requis.

source: Use [established protocols](../../hosting#discovery-and-apis) to support discovery of your data, and to provide atom feeds of recently updated data. At this level, publishers may also expose data through an API, following community established conventions for API operation.
es: Utiliza [protocolos establecidos](../../hosting#discovery-and-apis) para facilitar el descubrimiento de tus datos y proveer fuentes atom de los datos actualizados recientemente. En este nivel, los publicadores también deben de hacer disponibles los datos a través de un API, siguiendo convenciones de la comunidad para la operación de ésta.
fr: Utiliser [des protocoles établis](../../hosting#discovery-and-apis) pour faciliter la découverte de vos données. Fournir des flux atom sur vos récentes publications. À ce niveau, l'éditeur peut aussi exposer ses données via un API en suivant les recommandations de la communauté.

source: The use of these protocols, and following API conventions, will allow aggregators and other analysts to integrate this open contracting data in minutes and hours or work, rather than days, weeks and months.
es: El uso de estos protocolos y el seguir conveniones sobre APIs le permitirá a los lectores de contenidos y a otros analistas integrar estos datos sobre contrataciones en minutos y horas de trabajo, en vez de días, semanas y meses.
fr: L'utilisation des protocoles et API recommandés permettra aux agrégateurs et autres analystes des marchés publics, de compiler d'énormes volumes de données en très peu de temps.

source: In the future OCDS may also have an RDF serialization to enable linked data publication at this level.
es: En el futuro el OCDS también podría tener una seriación RDF para permitir la publicación de datos enlazados en este nivel.
fr: Dans le futur, OCDS pourrait avoir une sérialisation (syntaxe) RDF pour permettre l'interopérabilité des publications.

source: Contracting data may contain many cross-references to other important datasets - from government budgets, to company registers and registers of public interest. If 4 or 5 ☆ data is published for any of these, then OCDS can be used to make links between these datasets.
es: Los datos de contrataciones pueden contener varias referencias cruzadas con otros conjuntos de datos importantes - desde presupuestos de gobierno hasta registros comerciales y registros de interés públicos. Si se publican datos de 4 o 5 ☆ para cualquiera de estos, el OCDS se puede utilizar para enlazar estos conjuntos de datos.
fr: Les données concernant les marchés publics contiennent plusieurs références croisées à d'autres jeux de données importants comme: les budgets des gouvernements, les registres des entreprises privées, les registres des organismes publics et beaucoup d'autres registres d'intérêt public. Les publications de niveau 4 ☆ ou 5 ☆ selon le standard OCDS peuvent établir des liens avec ces registres.

source: This will allow users to follow the links to discover more about the context of the contracting processes they are exploring, and will allow big-data analysis linking in these different datasets. For example, following links to a company register to discover whether a company awarded a contract has been dissolved, or following links to budget and spending information.
es: Esto permitirá a los usuarios seguir los enlaces para descubrir más sobre el contexto de los procesos de contratación que están explorando y permitirá a los analistas enlazar estos conjuntos de datos. Por ejemplo, seguir enlaces al registro de una compañía para saber si un contrato con ésta se ha disuelto o seguir enlaces a información de presupuestos y gatos.
fr: En suivant les liens aux registres publics, l'usager pourra en apprendre d'avantage sur le contexte du marché public qu'il explore. Les analyses de données massives peuvent aussi faire usage de ces registres publics. Par exemple, un lien au registre des entreprises permet de connaître l'existence juridique de l'entreprise et peut-être découvrir qu'elle a été dissoute.

source: ☆ ☆ ☆ ☆ ☆ Make links to other datasets
es: ☆ ☆ ☆ ☆ ☆ Hacer enlaces con otros conjuntos de datos
fr: ☆ ☆ ☆ ☆ ☆ Faire des liens à d'autres jeux de données

source: OCDS provides spaces to give URIs to identify key dataset elements. By drawing on data published on the web by other agencies, and maintaining integration between your systems, you can provide links to these other data points within your OCDS data.
es: El OCDS provee espacios para colocar URIs que identifiquen elementos clave de un conjunto de datos. Al empatar datos publicados por otras agencias y mantener la integración entre tus sistemas, puedes enlazar a estos otros puntos dentro de tus datos de OCDS.
fr: Le standard OCDS offre des espaces pour fournir des URI identifiant les éléments clés de jeux de données. Profitez des jeux de données publiés par d'autres agences et insérez des liens à l'intérieur de vos données OCDS.

source: This level builds upon 4 ☆ publication, and helps to build a joined up web of data.
es: Este nivel se basa en la publicación de 4 ☆ y ayuda a construir una red de datos interconectados.
fr: Ce dernier niveau s'appuie sur le niveau de publication 4 ☆ pour offrir un réseau intégré de renseignements sur les marchés publics.

source: An example of publication at this level would involve including organization URIs to point to company registers, budget URIs to point to budget lines, and spending URIs to point to spending information (i.e. using web links to identify things, with those web links returning data on the things identified.).
es: Un ejemplo de publicación en este nivel implicaría incluir URIs de organización que apunten a registros de una compañía, URIs de presupuesto que apunten a líneas presupuestales y URIs de gasto que apunten a información de egresos (p. ej. utilizar enlaces web que identifiquen cosas con enlaces que devuelvan datos sobre las cosas que se identificaron.).
fr: Un exemple de publication à ce dernier niveau: La publication donne des liens URI au registre des entreprises pour chacun des intervenants au contrat, des liens à des lignes du budget de l'organisme, des liens aux déboursés progressifs, (des liens web pour identifier des objets, liens qui retournent le contexte ou la définition de l'objet)

source: For simplicity, the OCDS does not yet include URI fields at all points of the standard, but these can be added as extensions in collaboration with 5 ☆ linked data publishers.
es: Para mantenerlo simple, el OCDS no incluye aún campos de URI en todos los puntos del estándar, sin embargo estas se pueden agregar en colaboración con publicadores de datos interconectados de 5 ☆.
fr: Par souci de simplicité le standard OCDS ne comporte pas encore de champs URI à tous les points de publication mais de nouveaux champs URI peuvent être ajoutés en collaboration avec la communauté des éditeurs 5 ☆

source: Whatever level you are at - publishing data is only part of the process. It is important to also [engage with users](http://www.opendataimpacts.net/engagement/) and to think about how to build your open data back into your organizational processes, closing the feedback loop.
es: Sin importar el nivel en el que estés, publicar datos es sólo parte del proceso. Es importante también [interactuar con los usuarios](http://www.opendataimpacts.net/engagement/) y pensar sobre cómo se puede insertar los datos abiertos en los procesos organizacionales, cerrando el círculo de retroalimentación.
fr: Peu importe votre niveau - la publication des données ouvertes est seulement une partie du processus. Il est aussi important de [s'engager avec les usagers](http://www.opendataimpacts.net/engagement/) et de considérer comment inclure le concept de données ouvertes à l'intérieur de vos processus organisationnels internes.
