Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/levels.po
Languages: es, fr

source: What to publish
es: Qué publicar
fr: Quoi publier ?

source: Increasing the transparency, efficiency and effectiveness of public contracting is a process of constant improvement.
es: Aumentar la transparencia, eficiencia y efectividad de las contrataciones públicas es un proceso de mejora constante.
fr: Augmenter la transparence et l'efficacité dans l'octroi et la gestion des marchés publics doit être une préoccupation permanente.

source: OCDS sets out three levels for disclosure (basic, intermediate and advanced), alongside a 5* framework for the technical approach to data publication for publishers to self-assess themselves against.
es: El OCDS establece tres niveles de divulgación (básico, intermedio y avanzado), junto con un marco operativo de 5 ☆ para la estrategia técnica de publicación de datos, de manera que los publicadores se puedan valorar a sí mismos contra éste.
fr: OCDS propose trois niveaux de divulgation des données (de base, intermédiaire et avancé) avec 5 critères pour permettre aux éditeurs d'auto-évaluer leur approche technique.

source: This supports step-by-step improvement of open contracting data and document disclosure on the web.
es: Esto ayuda a la mejora paso a paso de los datos de contrataciones abiertas y a la divulgación de documentos en la red.
fr: Pour supporter une démarche d'amélioration progressive dans la divulgation sur le web des données concernant les processus de passation de marché public.

source: Publication levels: data
es: Niveles de publicación: datos
fr: Niveau de publication des données

source: The basic, intermediate and advanced levels provide guidance on the specific kinds of data governments should be able to publish.
es: Los niveles básico, intermedio y avanzado dan una guía en los tipos específicos de datos que los gobiernos deberían de poder publicar.
fr: Le niveaux de base, intermédiaire et avancé guident les organismes dans leur démarche de divulgation et de publication.

source: Basic
es: Básico
fr: De Base

source: The **basic** level captures data that should already be available in most contracting data systems, and that provides users with an overview of contracting processes.
es: El nivel **básico** caputra datos que deberían de estar disponibles en la mayoría de los sistemas de datos de contrataciones y que le otorga a los usuarios un resumen de los procesos de contratación.
fr: Le niveau **De Base** capture les données déjà disponibles dans la plupart des systèmes de gestion des contrats publics et donne une vue générale du processus.

source: Basic level data includes:
es: Los datos de nivel básico incluyen:
fr: Les données publiées au niveau **De Base** comprennent:

source: buyer name and address;
es: nombre de comprador y dirección;
fr: Nom et adresse de l'acheteur

source: tender identifiers, titles, descriptions, status, procurement method, period, item descriptions and quantities,
es: identificadores de la licitación, títulos, descripciones, estado, método de adquisición, periodo, descripción de los artículos y cantidades,
fr: Identification des soumissionnaires, titre, descriptions, statut, méthode d'approvisionnement, article/item, description des articles et quantités

source: documents associated with the tender;
es: documentos asociados con la licitación;
fr: les documents associés à l'appel d'offres

source: award identifiers, titles, descriptions, dates, values;
es: identificadores de adjudicación, títulos, descripciones, fechas, valores;
fr: identifiants de l'adjudication, titre, descriptions, dates, valeurs;

source: selected supplier names and addresses;
es: nombres del proveedor elegido y direcciones;
fr: nom et adresse de l'adjudicataire;

source: contract identifiers, titles, status, period, values, item descriptions and quantities.
es: identificadores del contrato, títulos, estado, periodo, valores, descripción de los artículos y cantidades,
fr: identifiants du contrat, titre, statut, périodes, valeurs, description des articles/item et quantités.

source: At a basic level, the publication of contract documents and implementation information (milestones, documents and spending transactions) is also recommended.
es: A nivel básico, también se recomienda la publicación de documentación del contrato e información de implementación (hitos, documentos y transacciones que generen gasto).
fr: Au niveau **De Base** , la publication du contrat, des renseignements sur les jalons de mise en oeuvre et les déboursés, est aussi recommandé.

source: Intermediate
es: Intermedio
fr: Intermédiaire

source: The **intermediate** level may require publishers to take extra steps to provide identifiers that join up data between systems, and that enable users to see changes in contracting processes over time.
es: El nivel **intermedio** puede requerir que los publicadores tomen pasos extras para proveer identificadores que unan datos entre sistemas y que permitan a los usuarios ver cambios en el proceso de contratación a lo largo del tiempo.
fr: Au niveau **intermediaire** il est demandé de fournir des identifiants pour relier dans un Dossier toutes les publications individuelles et permettre aux utilisateurs de voir l'évolution du processus dans le temps.

source: In addition to basic fields, intermediate publication involves providing:
es: Adicional a los campos básicos, la publicación intermedia implica proveer:
fr: En plus des renseignements donnés au niveau **De Base** il est demandé de fournir:

source: organisation identifiers for buyers and suppliers;
es: identificadores de organización para compradores y proveedores;
fr: des identifiants pour toutes les organisations impliquées tant pour les acheteurs que pour les fournisseurs;

source: detailed classification of line items in tender, award and contracts;
es: clasificación detallada de los artículos enlistados en la licitación, adjudicación y contratos;
fr: des article/item codifiés dans l'appel d'offres, l'adjudication et le contrat;

source: planning information including budget details and associated documents;
es: información de planeación, incluyendo detalles de de presupuesto y documentación asociada;
fr: des renseignements sur le plan de mise en oeuvre et des détails sur les budgets et documents associés;

source: tender award criteria, anticipated values and submission information;
es: criterios de adjudicación, valores anticipados e información de entrega de propuestas;
fr: Les critères d'adjudication, les coûts anticipés et les renseignements sur la soumission

source: tender enquiry periods details;
es: detalles de los períodos de consulta para la licitación;
fr: des précisions sur la période de questions de l'appel d'offres;

source: details of the number of organisations submitting tenders and a list of their names;
es: detalles del número de organizaciones que entregaron propuestas y una lista de sus nombres;
fr: la listes des soumissionnaires;

source: contract documents;
es: documentación de contratación
fr: les contrats comme tels;

source: the data of contract signature;
es: los datos de firma de contrato;
fr: la date de signature du contrat

source: information and dates for contract implementation milestones;
es: información y fechas de hitos de implementación del contrato;
fr: renseignements et dates sur les jalons de mise en oeuvre;

source: documents related to implementation of the contract.
es: documentos relacionados con la implementación del contrato.
fr: documents relatifs à la mise en oeuvre du contrat;

source: At an intermediate level, publishing documents related to awards, and identifying information on each organisation submitting a tender, is also recommended
es: En un nivel intermedio también se recomienda publicar datos relacionados con adjudicaciones e identificar información de cada organización que realiza una propuesta
fr: Au niveau **Intermédiaire**, il est aussi recommandé de publier des renseignements sur chacune des organisations soumissionnaires.

source: Advanced
es: Avanzado
fr: Avancé

source: The **advanced level** incorporates fields which are important to connect open contracting data with other data sources, and with the real-world impacts of contracting. Publishing this data may require planning for additional data collection and management.
es: El **nivel avanzado** incorpora campos importantes para conectar datos de contrataciones con otras fuentes de datos y con los impactos en el mudno real de la contratación. Publicar estos datos puede requerir planear la recolección adicional de datos y gestión.
fr: Au niveau **Avancé** l'objectif est de lier les données du processus avec d'autres sources de données pour suivre l'évolution du projet et mesurer son impact dans la réalité. Ce niveau **Avancé** de publication requiert une planification pour recueillir des données additionnels.

source: In addition to basic and intermediate fields, advanced publication involves providing:
es: Adicional a los campos básicos e intermedios, la publicación avanzada implica proveer:
fr: En plus des renseignements déjà publiés aux niveaux **De Base** et **Intermédiaire** , le niveau **Avancé** implique de fournir:

source: structured information on project milestones at the tender stage;
es: información estructurada sobre hitos del proyecto en la etapa de licitación;
fr: des renseignements structurés sur les jalons du projet dès l'étape de l'appel d'offres;

source: regularly updated milestone information during contract implementation;
es: información actualizada sobre los hitos durante la implementación del contrato;
fr: des mises à jour régulières des jalons du projet pendant la mise en oeuvre du contrat;

source: detailed unit, quantity and cost information for line items at tender, award and contract stages;
es: información detallada sobre unidad, cantidad y costo para artículos enlistados en las etapas de licitación, adjudicación y contratación;
fr: des renseignements détaillés sur les articles/items, les unités de mesure, les quantités et les coûts et ce à toutes les étapes du processus de passation de marché (appel d'offres, adjudication, contrat);

source: identifiers for each tendering organisation;
es: identificadores para cada organización que hace una propuesta;
fr: des identifiants codifiés pour chacune des organisations participantes à un appel d'offres;

source: information on spending transactions to suppliers during contract implementation;
es: información sobre transacciones de pago a proveedores durante la implementación del contrato;
fr: des renseignements sur les déboursés progressifs aux fournisseurs pendant la mise en oeuvre du contrat;

source: At an advanced level the use of URIs alongside identifiers, to provide links to other datasets, is also recommended.
es: En un nivel avanzado también se recomienda el uso de URIs junto con identificadores para poder enlazar a otros conjuntos de datos.
fr: Au niveau **Avancé** il est aussi recommandé de fournir des liens URI à d'autres jeux de données pertinents.

source: Summary
es: Resumen
fr: Sommaire

source: The table below lists each of the fields in OCDS along with a check mark for whether this is Required (X) or Recommended (-) at basic, intermediate or advanced level.
es: La tabla a continuación enlista cada uno de los campos en OCDS junto con una marca para saber si es Requerido (X) o Recomendado (-) en el nivel básico, intermedio o avanzado.
fr: Le grille qui suit, indique pour chacun des champs OCDS s'il est requis (X) ou recommandé (-) aux différents niveaux (De Base, Intermédiaire, Avancé) de publication.

source: [Download CSV version](https://docs.google.com/spreadsheets/d/1EhyC2pbG6Qxly9vMsZhk0tD8xV2mV4c6KeWkJKi5TMQ/pub?gid=91538800&single=true&output=csv)
es: [Descargar versión CSV](https://docs.google.com/spreadsheets/d/1EhyC2pbG6Qxly9vMsZhk0tD8xV2mV4c6KeWkJKi5TMQ/pub?gid=91538800&single=true&output=csv)

source: Publication levels: documents
es: Niveles de publicación: documentos
fr: Niveau de publications: Documents

source: The following list details the documents the priority documents that publishers should provide at different levels of publication. This list is non-exhaustive, and publishers should make other relevant documents available also.
es: La lista a continuación detalla los documentos prioritarios que los publicadores deberían de poner disponibles en cada nivel de publicación. Esta lista no es exhaustiva y los publicadores deberían de hacer disponibles otros documentos que también sean relevantes.
fr: La list qui suit montre la priorité des documents à publier pour atteindre l'excellence de publication cinq étoiles. Cette liste n'est pas exhaustive, elle peut être complétée par d'autres documents pertinents.

source: [Download CSV version](https://docs.google.com/spreadsheets/d/1i2XagfbBcwzQ5Zasz94fAfdeMwWImiJtfcZelveywr4/pub?gid=172990428&single=true&output=csv)
es: [Descargar versión CSV](https://docs.google.com/spreadsheets/d/1i2XagfbBcwzQ5Zasz94fAfdeMwWImiJtfcZelveywr4/pub?gid=172990428&single=true&output=csv)

source: How to publish - 5 ☆ approach
es: Cómo publicar - un enfoque de 5 ☆
fr: L'approche de publication cinq étoiles - 5 ☆

source: The open data movement has established good practices for publishing data on the web.
es: El movimiento por datos abiertos ha establecido buenas prácticas para publicar datos en la red.
fr: Le mouvement qui prône les données ouvertes propose les meilleures pratiques de publications des données sur le web.

source: Alongside the the basic, intermediate, advanced model, we have mapped OCDS against Tim Berners-Lee’s [Five Stars of Linked Open Data](http://www.w3.org/DesignIssues/LinkedData.html) approach and have set out how publishers can achieve 3 ☆ data and higher.
es: Junto con los modelos básico, intermedio y avanzado, hemos mapeado el OCDS con el enfoque de las [Cinco Estrellas de los Datos Abiertos](http://www.w3.org/DesignIssues/LinkedData.html) y hemos puesto disponible cómo los publicadores pueden lograr 3 ☆ o más.
fr: En parallèle avec les 3 niveaux de publication, (De Base, Intermédiaire, Avancé), nous avons établi une correspondance avec le modèle de Tim Berners-Lee [Five Stars of Linked Open Data] (http://www.w3.org/DesignIssues/LinkedData.html) et aidons les éditeurs à atteindre les plus hauts niveaux (trois étoiles - 3 ☆ et plus).

source: Each level increase makes data more accessible, re-usable and valuable.
es: Cada incremento en el nivel hacer que los datos sean más accesibles, reutilizables y valiosos.
fr: Chaque niveau croissant rendant les données plus accessibles, mieux réutilisables et plus valable.

source: ☆ Upload basic open contracting information to the web
es: ☆ Sube información básica de contrataciones abiertas a la red
fr: ☆ Télécharger sur le web des renseignements sur le processus de passation de marché.

source: Take information on contracting processes in whatever format it is currently available, and make sure it is available to citizens on the Web.
es: Utiliza cualquier información de los procesos de contratación en cualquier formato que esté disponible y asegúrate de que esté en la red, disponible a la ciudadanía
fr: Prendre les renseignements présentement disponibles peu importe le format et les rendre disponibles sur le web pour consultation par les citoyens.

source: An example of publication at this level would involve uploading all the documents relating to a contract process to an agency website. Good practice would involve using common naming and filing conventions, so users can easily find all the documents related to a specific tender or contract.
es: Un ejemplo de publicación en este nivel implicaría subir todos los documentos relativos a un proceso de contratación a un sitio de alguna dependencia. Una buena práctica sería utilizar convenciones comunes para nombrar y archivar los documentos, de manera que los usuarios puedan encontrar toda la documentación relacionada con una licitación o contrato específico.
fr: Un exemple de publication 1 ☆ : L'organisme publique télécharge sur son site web tous les documents relatifs à un processus de passation de marché. Pour faciliter l a recherche et la consultation des appels d'offres et contrats, l'organisme se donne une convention d'archivage public (noms des fichiers et répertoires).

source: Stepping up
es: Para ascender
fr: Intensification

source: Providing documents offers an initial level of transparency, but users have to dig through them to find the key information they need. That’s why providing machine-readable data that can be more easily searched and filtered is important.
es: Proveer documentación ofrece un nivel inicial de transparencia, sin embargo los usuarios deben escarbar en ellos para hallar la información clave que requieren. Es por esto que proveer datos legibles por una computadora, más fácil para consultar y filtrar, es importante.
fr: Fournir des documents est un premier niveau de transparence, mais les usagers doivent laborieusement déterrer les renseignements dont ils ont besoin. C'est pourquoi il est important d'offrir des données extractables et filtrables par ordinateur.

source: ☆ ☆ Provide machine-readable data about contracts
es: ☆ ☆ Hacer accesibles datos legibles por computadora
fr: ☆ ☆ des données sur les contrats extractables et filtrables par ordinateurs

source: Provide machine-readable datasets that contain key information recommended in the Open Contracting Data Standard.
es: Poner conjuntos de datos legibles por una computadora a disposición de los usuarios que contiene información clave recomendad en el Estándar de Datos de Contrataciones Abiertas.
fr: Fournir des jeux de données extractables et filtrables par ordinateur contenant les renseignements clés tel que recommandé dans le standard OCDS.

source: An example of publication at this level would involve providing a downloadable CSV file of contract information extracted from an existing database seeking to use, or map to, field names and data structures recommended by OCDS wherever possible.
es: Un ejemplo de publicación en este nivel implicaría provver un archivo CSV descargable de información sobre contrataciones extraída de una base existente que busque usar, o mapear a, nombres de campos y estructuras de datos recomendados por la OCDS cuando sea posible.
fr: Un exemple de publication à ce niveau serait d'offrir un fichier CSV téléchargeable contenant des renseignements sur un contrat avec concordance des noms de champs au standard OCDS autant que possible.

source: The documentation on [flat CSV file serialization](../../../implementation/serialization/#csv) of the standard, and the [OCDS mapper](https://github.com/open-contracting/mapper), may be useful for those seeking to publish at this level.
es: La documentación sobre [seriación de archivos CSV planos](../../../implementation/serialization/#csv) del estándar y el [mapeador del OCDS]https://github.com/open-contracting/mapper) pueden ser útiles para aquellos que desean publicar en este nivel.
fr: La documentation sur les fichiers CSV aplanis est disponible ici:[flat CSV file serialization](../../../implementation/serialization/#csv) of the standard, and the [OCDS mapper](https://github.com/open-contracting/mapper), et peut être utile à ce niveau de publication.

source: Providing structured data will allow users to perform basic analysis, but until a common standard is used, it will be more difficult to join up contracting information across datasets and to analyze patterns across organizations or sectors. From structured data, the next step is to map this to the OCDS standard.
es: Proveer datos estructurados le permitirá a los usuarios realizar anáslisis básicos pero hasta que se utilice un estándar común será más difícil unir la información de contrataciones entre conjuntos de datos y analizar patrones sobre organizaciones o sectores. De tener datos estructurados el siguiente paso es mapearlos en el estándar de OCDS.
fr: Offrir des données structurées permet des analyses de base. Il faut cependant un standard commun pour permettre des croisements entre les organisations et les secteurs d'activités. La prochaine étape est donc des données structurées selon le standard OCDS.

source: ☆ ☆ ☆ Provide structured data using open standards
es: ☆ ☆ ☆ Proveer datos estructurados usando estándares abiertos
fr: ☆ ☆ ☆ Fournir des données structurées selon un standard ouvert

source: Using the Open Contracting Data Standard model to publish initiation, award, contract and implementation information for each contracting process.
es: Usar el modelo del Estándar de Datos de Contrataciones Abiertas para publicar información de inicio, adjudicación, contrato e implementación para cada proceso de contratación.
fr: Utiliser le modèle "Open Contracting Data Standard" pour publier des renseignements sur toutes les étapes du processus de passation de marché public: planification, budget, appel d'offres, adjudication, mise en oeuvre, déboursés et clôture du projet.

source: OCDS provides guidance on the fields to include, and how to structure them using [a JSON schema](../../../schema/reference/) so that third-parties can re-use your data effectively.
es: El OCDS da una guía sobre los campos que se deben incluir y cómo estructurarlos usando un [esquema JSON](../../../schema/reference/) para que terceros puedan reusar tus datos de manera efectiva.
fr: OCDS fournit des indications sur les champs à inclure et comment les structurer en utilisant le schéma JSON : [a JSON schema](../../../schema/reference/) ainsi des tiers pourront ré-utiliser vos données efficacement.

source: Fully compliant OCDS publication involves providing a release of data for every event or change that occurs in the life of a contracting process (e.g. when a tender is issued, an award made, and a contract signed), and then combining these into a summary record. This is important to enable tracking of change over time. However, there are different paths to take in moving towards this, and technical assistance from the community can be sought to identify the best approach.
es: Una publicación que cumple por completo con el OCDS implica proveer una entrega de datos por cada evento o cambio que ocurra en la ivda de un proceso de contratación (p. ej. cuando se lanza una licitación, se adjudica y se firma un contrato) y luego combinando estas en un registro de resumen. Esto es importante para permitir seguir los cambios a lo largo del tiempo. Sin embargo, hay distintas rutas para llegar a esto, y se puede buscar asistencia técnica de la comunidad para identificar la mejor aproximación.
fr: Une divulgation de renseignements entièrement conforme au standard OCDS implique une publication correspondante à chacun des évènement du processus (planification, appel d'offres, adjudication, signature du contrat, mise en oeuvre, déboursés, clôture, etc.) et à rassembler tous ces évènements en un seul dossier. Pouvoir suivre l'évolution du processus dans le temps est de la plus haute importance. Pour atteindre cet objectif, les éditeurs peuvent obtenir de l'assistance technique de la communauté pour identifier les meilleures approches.

source: An example of good quality publication at this level might involve regularly generated releases and records published in bulk files for download and also made available through query interfaces and APIs.
es: Un ejemplo de buena calidad de publicación en este nivel puede incluir entregas y registros generados regularmente publicados en volumen para su descarga y que también estén disponibles por interfaces de consulta y APIs.
fr: Un exemple de publication à ce niveau implique des générations périodiques de fichiers pour téléchargements massifs ainsi que des interfaces interactives d'interrogation. (API).
