Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/publication_policy.po
Languages: es, fr

source: Publication policies
es: Políticas de publicación
fr: La politique de publication

source: Publishing Open Contracting data involves making a number of choices about what data and documents to include and how to classify and categorise different items. To allow users to understand the choices that a publisher has made, a publisher should provide a public web page or document that details the decisions they have made concerning the issues listed below.
es: La publicación de datos de Contrataciones Abiertas implica una serie de decisiones sobre qué datos y documentos incluir y cómo clasificar y categorizar distintos artículos. Para permitir que los usuarios entiendan las decisiones tomadas por un publicador, éste debe de proveer un sitio o un documento público que detalle las decisiones que han tomado respecto a los temas enlistados a continuación.
fr: Publier des données sur le processus de passation de marché implique des choix à faire sur les données, les documents, les classifications et les catégorisations des articles/items. Pour aider l'utilisateur dans l'interprétation des données publiées, un éditeur devrait publier une page web avec des renseignements concernant les décisions prises. Cette page web devrait couvrir les points ci-dessous:

source: This document should also contain information about future plans for changes to the data and who to contact with enquiries about the data.
es: Este documento también debe contener información sobre planes futuros de cambios a los datos y a quién contactar si se tienen preguntas sobre los datos.
fr: Cette page web devrait aussi contenir des renseignements sur les changements à venir et les améliorations prévues aux données. La page devrait montrer les coordonnées de la personne responsable de la mission "données ouvertes"

source: Publication policy pages should include information about:
es: Las páginas de política de publicación debe incluir información sobre:
fr: La politique de publication devrait donner des renseignements sur les points suivants:

source: Who is responsible for providing this data - including appropriate contact details and locations of where to offer feedback.
es: Quién es responsable de poner disponibles estos datos, incluyendo detalles de contacto adecuados y sitios donde proveer retroalimentación.
fr: Les coordonnées du responsable des publications et une adresse pour envoyer des suggestions et poser des questions.

source: How the data is generated, and how often - for example, a brief summary describing the systems the data is generated from, how often the source data is updated, and any processes that operate between the source data and the published open contracting data and documents.
es: Cómo se generan los datos y qué tan seguido - por ejemplo, un breve resumen describiendo los sistemas en que se generan los datos y qué tan seguido es actualizada esta fuente, así como cualquier proceso que opere entre la fuente de datos y los datos y documentos de contrataciones abiertas.
fr: Comment les données sont générées et à qu'elle fréquence ? - à titre d'exemple, une description sommaire du système qui génère les données, la fréquence de mise à jour de la source de données et une explication du processus intermédiaire entre la source et la publication des données et documents concernant le processus de passation de marché.

source: Any exclusions from the data - such as information which is not disclosed for reasons of privacy and security. This may describe the fields which are excluded for a selection of records, and/or the policy applied to decide if any information should be withheld from a public OCDS release.
es: Cualquier omisión de los datos, tal como información que no se presente por razones de privacidad y seguridad. Esto puede describirse en los campos que se excluyen para una selección de registros y/o la política aplicada para decidir si alguna información debía retenerse de una entrega pública de OCDS.
fr: Les renseignements exclus de la publication - pour des raisons de sécurité et de confidentialité. Lister les champs du standards OCDS qui ont été exclus et/ou faire référence à la politique de confidentialité qui supporte l'exclusion de certains renseignements du domaine public.

source: Any custom code lists used - or custom codes added to existing codelists.
es: Cualquier lista de código a la medida utilizada - o códigos a la medida que se agregaron a listas de código existentes.
fr: Toutes listes de valeurs codifiées uniques à votre organisation - ou toutes nouvelles valeurs ajoutées à une liste codifiée du standard OCDS.

source: Future development plans - brief notes on the future plans of the publisher to improve their data.
es: Planes de desarrollo futuro - notas concisas sobre los planes futuros del publicador para mejorar sus datos.
fr: Projets de développement futur - un bref commentaire sur les améliorations envisagées pour de futures publications.

source: Publishers may also wish to apply for, and include the results of, an [Open Data Certificate](https://certificates.theodi.org/), on their publication policy pages.
es: Los publicadores también querrán aplicarar e incluir los resultados de un [Open Data Certificate](https://certificates.theodi.org/) en sus páginas de política de publicación.
fr: Les éditeurs peuvent demander une certification de conformance et mettre le résultat sur leur page de politiques. [Open Data Certificate](https://certificates.theodi.org/)

source: A link to the publication policy can be embedded within the data package.
es: Un enlace a la política de publicación se puede embeber en el paquete de datos.
fr: Un lien à la page des politiques de publication peut être inséré dans les paquets de données publiées.
