Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/registration.po
Languages: es

source: Registration
es: Registro

source: <span class="lead">The identifiers section describes the composition of a globally unique open contracting identifier. On this page you can request an ocid prefix, and can submit details of your published data, as well as checking existing prefixes</span>
es: <span class="lead">La sección de identificadores describe la composición de un identificador único global. En esta página puedes solicitar un prefijo de ocid y puedes enviar detalles de tus datos publicados, al igual que revisar prefijos que ya existen</span>

source: OCID Prefix
es: Prefijo OCID

source: We are in the process of establishing a self-service registration system for OCID prefixes. In the meantime, to request an OCID prefix please e-mail <a href="mailto:data@open-contracting.org">data@open-contracting.org</a> with the name of your organization.
es: Estamos en el proceso de establecer un sistema de auto registro para prefijos de OCID. Mientras tanto, para solicitar uno por favor envía un correo a <a href="mailto:data@open-contracting.org">data@open-contracting.org</a> con el nombre de tu organización.

source: Existing prefixes
es: Prefijos existentes

source: This list below shows currently registered prefixes.
es: Esta lista muestra los prefijos existentes actualmente

source: [CSV download](https://docs.google.com/spreadsheets/d/1Am3gq0B77xN034-8hDjhb45wOuq-8qW6kGOdp40rN4M/pub?gid=506986894&single=true&output=csv)
es: [Descarga CSV](https://docs.google.com/spreadsheets/d/1Am3gq0B77xN034-8hDjhb45wOuq-8qW6kGOdp40rN4M/pub?gid=506986894&single=true&output=csv)

source: Register your data
es: Registra tus datos

source: OCDS does not have a registry of datasets. The approach for data discovery is described in the [publication patterns](../../../implementation/hosting/) section of this documentation.
es: El OCDS no tiene un registro de conjuntos de datos. La estrategia para descubrimiento de datos se describe en la sección de [patrones de publicación](../../../implementation/hosting/) de esta documentación.

source: However, during this initial phase of OCDS we encourage publishers to share details of their data on the [mailing list](../../../support), and we will explore opportunities to work with the community on maintaining tools to support discovery of data.
es: Sin embargo, durante la fase inicial de OCDS alentamos a los publicadores a que compartan detalles sobre sus datos en la [lista de correos](../../../support) y exploraremos oportunidades de trabajar con la comunidad en mantener herramientas que fomenten el descubrimiento de los datos.
