Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/serialization.po
Languages: es, fr

source: Serialization
es: Seriación
fr: Sérialisation

source: The Open Contracting Data Standard provides a **structured data model** for capturing in-depth information about all stages of the contracting process.
es: El Estándar de Datos de Contrataciones Abiertas provee un **modelo de datos estructurados** para capturar información a profundidad sobre todas las etapas del proceso de contratación.
fr: Le standard OCDS propose un **modèle structuré de données** pour capter et divulguer des renseignements détaillés sur chacune des étapes du processus de passation de marché public.

source: The current canonical version of this data model is provided by a **[JSON Schema](../../../schema/release)** which describes field names, field definitions and structures for the data. The compliance of data with the Open Contracting Data Standard will be assessed against this schema.
es: La versión canónica actual de este modelo de datos es provista por un **[esquema JSON](../../../schema/release)**, el cual describe nombres de campos, definiciones de campos y estructuras para los datos. El cumplimiento de los datos con el Estándar de Datos de Contrataciones Abiertas será evaluado contra este esquema.
fr: La version officielle de ce modèle structuré de données repose sur un schéma **[JSON Schema](../../../schema/release)** qui décrit les noms de champs, les définitions de champs et la structure des données. La conformité des données publiées au standard OCDS sera mesuré à l'aide de ce schéma JSON.

source: However, there are many use cases where publishers and users will want to work with data serialized in other formats. For this reason, the current version of OCDS supports a number of **secondary serializations** which are based on the canonical schema. There are not currently official components of the standard, but are designed to support implementers in providing accessible data to a range of different users.
es: Sin embargo, hay varios casos de uso donde los publicadores y los usuarios querrán trabajar con datos seriados en otros formatos. Por este motivo la versión actual del OCDS admite una serie de **seriaciones secundarias** que están basadas en el esquema canónico. Actualmente no hay componenetes oficiales del estándar, pero están diseñados para ayudar a los implementadores a proveer datos accesibles a un rango amplio de usuarios distintos.
fr: Cependant, dans certains cas, des éditeurs voudraient utiliser une autre syntaxe. C'est pourquoi la version actuelle du standard OCDS accepte d'autres syntaxes dérivées de la version officielle. Ces autres syntaxes ne sont pas des composantes du standard OCDS, elles sont acceptées simplement pour faciliter la tâche des éditeurs.

source: JSON stands for Javascript Object Notation, and is a format widely used for the exchange of data on the web. The JSON schema language provides validation tools for working with JSON data.
es: JSON es acrónimo de Javascript Object Notation y es un formato ampliamente utilizado para el intercambio de datos en la red. El lenguaje esquemático de JSON provee herramientas de validación para trabajar con datos en formato JSON.
fr: JSON (JavaScript Object Notation) est un format de données textuelles dérivé de la notation des objets du langage JavaScript. Il est largement utilisé pour l'échange de données sur le web. JSON offre des outils de validation de ses données.

source: Generating JSON
es: Generar JSON
fr: Générer des données JSON

source: Most programming languages provide tools for output data as JSON.
es: La mayoría de los lenguajes de programación cuentan con herramientas para producir datos en formato JSON.
fr: Plusieurs langages de programmation offrent des outils pour publier des données conformes au schéma JSON.

source: The [OCDS Mapper](https://github.com/open-contracting/mapper) tool can convert from flat CSV files to structured OCDS data based on a mapping template.
es: El [OCDS Mapper](https://github.com/open-contracting/mapper) puede convertir archivos CSV planos a datos estructurados basado en una plantilla de mapeo.
fr: L'outil de mappage [OCDS Mapper](https://github.com/open-contracting/mapper) peut transformer des fichiers plat CSV en données structurées JSON.

source: [A range of tools](http://json-schema.org/implementations.html) are available for working with [JSON-Schema](http://json-schema.org/), including validation and form generation tools.
es: Hay disponible [una serie de herramientas](http://json-schema.org/implementations.html) para trabajar con el [esquema JSON](http://json-schema.org/), incluyendo herramientas para validación y generación.
fr: [Une panoplie d'outils](http://json-schema.org/implementations.html) sont disponibles pour travailler avec le [JSON-Schema](http://json-schema.org/), comme des outils de validation et de génération de formulaires.

source: Consuming JSON
es: Consumir JSON
fr: Lire le schéma JSON

source: Most programming languages provide tools for reading JSON.
es: La mayoría de los lenguajes de programación proveen herramientas para leer JSON.
fr: La plupart des langages de programmation peuvent lire le schéma JSON.

source: A number of [JSON native databases](http://en.wikipedia.org/wiki/NoSQL) are available for working directly with large collections of JSON documents, and command line tools such as [jq](http://stedolan.github.io/jq/) support advanced query and data retrieval with JSON files.
es: Una serie de [bases de datos JSON](http://en.wikipedia.org/wiki/NoSQL) están disponibles para funcionar directamente con una amplia gama de documentos JSON y hay herramientas de la línea de comandos tales como [jq](http://stedolan.github.io/jq/) que permiten consultas avanzadas y obtenciónd e datos con archivos JSON.
fr: Des systèmes de base de données [JSON native databases](http://en.wikipedia.org/wiki/NoSQL) sont disponibles pour travailler directement sur de grandes collections de documents JSON. L'interface en ligne de commande comme [jq](http://stedolan.github.io/jq/) permett des requêtes évoluées sur les bases de données JSON.

source: There are also a range of generic tools which can convert JSON into flat CSV structures, including:
es: También existen una seride herramientas genéricas que pueden convertir JSON a estructuras CSV planas, incluyendo:
fr: Une panoplie d'outils génériques peuvent convertir les documents JSON en structures CSV aplanies:

source: [JSON -> CSV](http://konklone.io/json/) - online tool for converting small documents.
es: [JSON -> CSV](http://konklone.io/json/) - una herramienta en línea para convertir documentos pequeños.
fr: Un outil en ligne pour les petits documents : [JSON -> CSV](http://konklone.io/json/)

source: [Open Refine](http://openrefine.org/) - desktop tool that can handle large documents, and supports advanced data manipulation.
es: [Open Refine](http://openrefine.org/) - una herramienta de escritorio que puede trabajar con documentos grandes y soporta manipular los datos de forma avanzada.
fr: Un outil à télécharger sur votre ordinateur pour manipuler de gros document avec des facilités de manipulation de données avancées: [Open Refine](http://openrefine.org/)

source: JSON is based on a tree structure, with data elements nested inside one another. However, many people are more familiar working with tabular data, made up of columns and rows. There is no easy way to represent structured data in a single table. However, we propose two models for publishers to adopt.
es: Los documentos JSON se basan en una estructura de árbol, con elementos de datos que se anidan uno dentro del otro. Sin embargo, mucha gente está más familiarizada con el trabajo con datos tabulares, organizado en columnas y renglones. No hay forma fácil de representar datos estructurados en una sola trabla. A pesar de esto, proponemos dos modelos que pueden adoptar los publicadores.
fr: JSON est une structure arborescente, les éléments s'imbriquant l'un dans l'autre. Cependant plusieurs personnes sont plus familières avec les rangées et les colonnes des tableurs. Il n'y a pas de moyen facile de transformer une structure arborescente en une série de rangées et colonnes. Nous proposons deux modèles de solution à ce problème:

source: **Simplified single table** - for cases where there are no one-to-many relationships in the data (e.g. each tender has only one award and contract, and each has only one line-item).
es: Una **Tabla única simplificada** - para los casos en los que no hay relaciones de uno con muchos otros en los datos (p. ej. cada licitación tiene sólo una adjudicación y un contrato y cada uno sólo tiene un artículo enlistado).
fr: Pour les cas simples (un appel d'offres, une adjudication, un contrat, une ligne d'item/article) : **Simplified single table**

source: **Multi-table** - where more advanced structures are required, but where it is desirable to be able to work with data in spreadsheet-style layouts
es: **Múltiples tablas** - donde se requieren estructuras más avanzadas, pero donde es deseable poder trabajar con los datos en disposiciones como en una hoja de cálculo
fr: Pour les structures arborescentes plus élaborées que l'on veut transformées en rangées et colonnes à manipuler dans un tableur: **Multi-table**

source: In each case, fields are identified by the [json pointer](http://tools.ietf.org/html/rfc6901) to their JSON equivalent. For example:
es: En cada caso, los campos son identificados por el [apuntador json](http://tools.ietf.org/html/rfc6901) en su equivalente en JSON. Por ejemplo:
fr: Dans chacun des cas, le champ est identifié par un pointeur sur son équivalent JSON [json pointer](http://tools.ietf.org/html/rfc6901) . À titre d'exemple:

source: A set of prototype tools for generating flat CSV OCDS templates are [available on GitHub](https://github.com/open-contracting/flattening-ocds), and the OCDS validator includes an option to generate 'flattened' versions of JSON data.
es: Un conjunto de prototipos de herramientas para generar archivos CSV planos de plantillas de OCDS están [disponibles en GitHub](https://github.com/open-contracting/flattening-ocds), y el validador de OCDS incluye una opción para generar versiones 'planas' de datos en JSON.
fr: Des outils prototypes pour générer des fichiers CSV aplanis au gabarit OCDS sont disponibles ici: [available on GitHub](https://github.com/open-contracting/flattening-ocds), et le validateur OCDS offre la possibilité de générer une version aplanie des données JSON.

source: Simplified single table
es: Tabla única simplificada

source: It is possible to represent a full releases in a single flat CSV row by using full JSON pointers for each field as the headings.
es: Es posible representar una entrega completa en un a sola línea de CSV plano usando apuntadores para cada campo como encabezados.
fr: Il est possible de représenter une publication complète en une seule rangée CSV en utilisant les pointeurs JSON pour chacune des colonnes.

source: This approach is generally only appropriate for data without one-to-many relationships (for example, only one item per tender, and one award and contract for each tender process).
es: Esta aproximación generalmente sólo es apropiada para datos sin demasiadas relaciones (por ejemplo, sólo un artículo por licitación y una adjudicación y contrato por cada proceso).
fr: Cette approche n'est valable que lorsque la publication ne concerne qu'une ligne item/article d'un contrat, d'une adjudication, d'un appel d'offres.

source: It is, however, theoretically possible to represent a full releases in a single flat CSV row by using full JSON pointers for each field as the headings. For arrays, this involves adding the array index to the path, such as ```tender/item/0/id``` and ```tender/item/1/id``` as separate columns to represent each of the items.
es: Sin embargo es teóricamente posible representar una entrega completa en una sola línea de CSV plano utilizando apuntadores para cada campo como encabezados. Para matrices, esto implica agregar el índice de matrices a la ruta, tales coomo ```tender/item/0/id``` y ```tender/item/1/id``` como columnas separadas para representar cada uno de los artículos.
fr: Il est théoriquement possible de représenter une publication complexe en une seule ligne CSV en utilisant le pointeur intégral de JSON pour les entêtes des colonnes. Pour un ensemble d'items/articles, il faut ajouter autant de colonnes qu'il y a d'items/articles et indexer le titre de la colonne comme suit : ```tender/item/0/id``` , ```tender/item/1/id```

source: For example, to represent a tender release with two items, the CSV file would include:
es: Por ejemplo, para representar una entrega sobre una licitación con dos artículos el archivo CSV incluiría:
fr: À titre d'exemple, une publication avec deux lignes d'articles/items:

source: The JSON equivalent of this would be:
es: El equivalente de JSON de esto sería:
fr: La représentation JSON équivalente :

source: Whilst this allows complex data to be expressed in flat CSV, users will need to rebuild the structure in order to analyse the data.
es: Pese a que esto permite expresar datos complejos en CSV plano, los usuarios necesitarán reconstruir la estructura para poder analizar los datos.
fr: Présenter un ensemble complexe de données en format CSV aplani, présente des difficultés pour l'utilisateur qui devra refaire la structure de son tableau pour faire ses analyses.

source: Instead, data with a one-to-many relationship can be represented using a multi-table serialization.
es: En su lugar, los datos con muchas relaciones pueden representarse usando una seriación multi-tabla.
fr: À la place, pour représenter un ensemble complexe de données, on peut utiliser la sérialisation multi-tables

source: Multi-table
es: Multi-tabla
fr: Multi-Tables

source: The multi-table serialization breaks key sections and building blocks of OCDS into their own tables. This supports complex data structures with one-to-many relationships, whilst allowing analysts to reconstruct the views of data they need to carry out analysis.
es: La seriación multi-tabla divide secciones clave y bloques de OCDS en sus propias tablas. Esto permite estructuras de datos complejas con varias relaciones a un elemento, a la vez que permite a los analistas reconstruir las visiones de los datos que requieren para realizar análisis.
fr: La sérialisation multi-tables assigne une table à chacune des sections clés et des composantes du standard OCDS. Cette façon de faire permet de représenter des ensembles complexes de données tout en permettant aux analystes de facilement reconstruire des vues répondant à leurs besoins.

source: Multiple tables can be packaged together as the tabs of a spreadsheet, or using the Open Knowledge data package specification.
es: Se pueden empaquetar varias tablas como las pestañas de una hoja de cálculo o utilizando la especificación de empaquetado de datos de la Open Knowledge.
fr: Les tables multiples peuvent devenir des onglets du tableur. On peut aussi utiliser les spécification de paquets du 'Open Knowledge Lab'

source: The OCDS approach to multi-table flat serializations is currently under review. Contact the [helpdesk](../../../support/) if you wish to make use of this.
es: La aproximación del OCDS a las seriaciones multi-tabla se encuentra en revisión actualmente. Contacta a [apoyo técnico](../../../support/) si deseas utilizarlo.
fr: L'approche OCDS de sérialisation multi-table aplanie fait présentement l'Objet d'une révision, contacter notre bureau d'assistance technique avant de l'utiliser : [helpdesk](../../../support/)

source: Packaging files with meta-data
es: Empaquetar datos con meta-datos
fr: Paquets de fichiers avec meta-data

source: Whatever serialisation is used for Open Contracting Data, a single file may contain one or more release and records.
es: Sin importar la seriación que se utilice para los Datos de Contratacoines Abiertas, un archivo puede contener una o más entregas y registros.
fr: Peu importe la méthode de sérialisation retenue pour divulguer des renseignements sur les processus de passation de marché au standard OCDS, un seul fichier pourrait contenir plusieurs publications et plusieurs dossiers.

source: The release and record data package schemas describe the key meta-data that must be supplied for any file providing Open Contracting Data. This includes the publishedDate, publisher, uri for accessing the file, and the licensing details for the file.
es: Los esquemas de empaquetado de entregas y registros describe los meta-datos clave que deben de proveerse para cualquier archivo que contenga Datos de Contrataciones Abiertas. Esto incluye la publishedDate, publicador, url para acceder al archivo y los detalles de licenciamiento para el archivo.
fr: Le schéma pour un paquet de publication et de dossiers décrit les méta-données à fournir avec le fichier de divulgation, incluant date de publication 'publishedDate, éditeur 'publisher', le lien d'accès au fichier 'uri' , et les renseignement sur la licence d'utilisation.
