Repository: Bjwebb/standard-try-break-tests
Catalog: docs/locale/*/LC_MESSAGES/primer/releases_and_records.po
Languages: es

source: How is OCDS data published?
es: ¿Cómo son publicados los datos OCDS?

source: Objectives
es: Objetivos

source: Open Contracting Data Standard (OCDS) data is published and updated over time using two JSON document types: “releases” and “records”. This page will:
es: Los datos en el Estándar de Datos para las Contrataciones Abiertas (OCDS), son publicados y actualizados en el tiempo utilizando dos tipos de documentos en formato JSON: “entregas” (releases) y “registros” (records). En esta página se:

source: Outline the purpose of releases and records
es: Define el propósito de las entregas y registros.

source: Describe how to publish a change history using releases and records
es: Describe cómo publicar un historial de cambios utilizando entregas y registros.

source: Show the components of an OCDS record
es: Señalan los componentes de un registro OCDS.

source: The only thing that can be truly called “OCDS data” is a JSON document that validates against the OCDS schema. The JSON documents that OCDS uses are called “releases” and “records.”
es: Lo único que verdaderamente se puede llamar "dato OCDS" es un documento en formato JSON que valida frente al esquema OCDS. Los documentos en formato JSON que utilizan OCDS son denominados "entregas" (releases) y "registros" (records).

source: OCDS publishers are encouraged to use releases and records to publish data in near real-time and to provide a change history. Tracking change over time is important to users of contracting data because there can be many changes in the life of a contracting process. Knowing how and when certain attributes have changed can help users to understand the process, identify inefficiencies, and spot red flags for corruption.
es: Los publicadores de OCDS son animados a utilizar las entregas y registros para publicar datos en tiempo real y proveer un historial de cambios. El seguimiento del cambio en el tiempo es importante para los usuarios de datos de contrataciones, debido a que pueden existir muchos cambios en el proceso de contratación. Sabiendo cómo y cuándo ciertos atributos han cambiado puede ayudar a que los usuarios comprendan el proceso, identificando ineficiencias, y detectando alarmas de corrupción.

source: **Releases** are JSON documents that are published each time there is a change to a contracting process. Releases follow the OCDS [release schema](../schema/reference) and contain an OCID to identify the contracting process they relate to.
es: Las **entregas** (releases) son documentos en formato JSON, que son publicados cada vez que existe un cambio en el proceso de contratación. Las entregas siguen el [esquema de entregas](../schema/reference) de OCDS y contienen un OCID para identificar los procesos de contratación asociados.

source: Releases are immutable, which means they cannot be changed once published. There can be many releases per contracting process and the collection of releases for a contracting process constitutes its change history.
es: De esta manera, las entregas son inalterables, esto quiere decir que una vez publicadas no pueden ser cambiadas. Pueden existir muchas entregas por cada proceso de contratación y esa colección de entregas de un proceso de contratación constituye su historial de cambios.

source: **Records** are JSON documents that act as an index of all releases for a single contracting process. While releases are never updated, records are updated each time there is a change to a contracting process by adding a new release to this index. Records follow the OCDS [record schema](../schema/records_reference) and, in addition to the release index, can also contain:
es: Los **registros** (records) son documentos en formato JSON, que actúan como un índice de todas las entregas para un proceso de contratación. Mientras que las entregas nunca son actualizadas, los registros son modificados cada vez que existe un cambio en un proceso de contratación añadiendo una nueva entrega al índice. Los registros siguen el [esquema de registros](../schema/records_reference) de OCDS y, en adición al índice de entregas, también pueden contener:

source: A **compiled release,** which follows the same structure as a release and provides the latest value of each field. The compiled release makes it easy for users to get the latest version of the data about a contracting process.
es: Una **entrega compilada,** la cual sigue la misma estructura de las entregas y provee el último valor de cada campo. La entrega compilada facilita a los usuarios obtener la última versión de los datos sobre un proceso de contratación.

source: A **versioned release,** which contains a history of changes for each field and allows users to see how a particular field has changed over time.
es: Una **entrega versionada,** la cual contiene un historial de cambios por cada atributo y que permite a los usuarios observar cómo un atributo en particular ha cambiado con el tiempo.

source: Each time a new release is published it is added to the index, the compiled release is updated with the latest values, and the versioned release is updated with any new changes.
es: Cada vez que una nueva entrega es publicada es añadida al índice, la entrega compilada es actualizada con los últimos valores, y la entrega versionada es actualizada con los nuevos cambios.

source: ![Contracting Process with releases](../_static/png/changehistory_process2.png)
es: ![Proceso de Contratación con entregas](../_static/png/changehistory_process2.png)

source: Records and releases each contain several fields which can be used in different sections. The OCDS schema sets out the fields that ought to be included in each section (where applicable), aiming to reuse simple structures to represent information. For example, a release may contain information about items being procured. OCDS’ schema sets out standard building blocks for items across releases, including the name of the item, a description, each item’s value, and the currency used.
es: Las entregas y los registros contiene varios campos que pueden ser utilizados en diferentes secciones. El esquema OCDS define los campos que deben ser incluidos en cada sección (donde corresponda), ayudando a reutilizar estructuras simples para representar la información. Por ejemplo, una entrega puede contener información acerca de los artículos adquiridos. El esquema OCDS define los componentes fundamentales de los artículos en toda la entrega, incluyendo el nombre, descripción, valor de cada artículo y la moneda utilizada.

source: When you publish OCDS releases and records, you are encouraged to:
es: Cuando usted publica entregas y registros OCDS, se le recomienda:

source: Ensure all documents referenced in OCDS releases are available online
es: Asegurarse que todos los documentos referentes a OCDS, entregas y registros se encuentren disponibles en línea.

source: Publish each release and record at its own persistent URL
es: Publicar cada entrega y registro con su propia URL.

source: Produce bulk packages of releases and records for users to download
es: Producir archivos de descarga masiva de paquetes de entregas y registros para la descarga de los mismos por los usuarios.

source: Publish versions of the data for users to access in CSV for Excel formats
es: Publicar versiones de datos para que los usuarios accedan en formato CSV para Excel.

source: **To learn more,** go to the next page in the primer: [How can I implement the OCDS?](next) You can also review the further resources below to go deeper into the subjects introduced on this page.
es: **Para aprender más,** puede dirigirse a la siguiente página del manual de introducción. [¿Cómo funciona OCDS?](next) Así también usted revisar fuentes adicionales que se encuentran a continuación, a fin de profundizar en los temas introducidos en esta página.

source: [OCP Learning: Publishing OCDS Data](https://www.open-contracting.org/learn/publish/)
es: [Aprende con OCP: publicación de datos OCDS](https://www.open-contracting.org/es/learn/publish/)

source: [Video Learning Guide to the OCDS](https://www.youtube.com/playlist?list=PL7sSifLpWd8hLOVrNMiwNApXAsOr06E1Q)
es: [Vídeo Guía de OCDS](https://www.youtube.com/playlist?list=PL7sSifLpWd8hLOVrNMiwNApXAsOr06E1Q)

source: [OCDS Schema Release Reference](../schema/reference)
es: [Esquema de Referencia de Entradas OCDS](../schema/reference)

source: [OCDS Schema Record Reference](../schema/records_reference)
es: [Esquema de Referencia de Registros OCDS](../schema/records_reference)
