Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/extensions/location.po
Languages: es, fr

source: Location extension
es: Extensión de ubicación
fr: Extensions de localisation

source: Communicating the location of proposed or executed contract delivery is important to make users of contracting data.
es: Comunicar la ubicación de la entrega de un contrato propuesto o ejecutado es importante para los usuarios de los datos de contrataciones.
fr: Pouvoir communiquer la localisation (projetée ou effective) de l'exécution d'un marché est important pour accroître le nombre d'utilisateurs des données sur les marchés publics.

source: This extension proposes the addition of two properties to ```items``` to describe location:
es: Esta extensión propone agregar dos propiedades a los ```elementos``` para describir la ubicación:
fr: Cette extension propose d'ajouter deux propriétés aux ```items``` pour décrire la localisation :

source: ```deliveryAddress``` - a standard ```Address``` block which can be used to provide a postal address where services should be delivered.
es: ```deliveryAdress``` - un bloque estándar de ```Dirección``` que puede utilizarse para dar una dirección postal a donde los servicios deberían entregarse.
fr: ```deliveryAddress``` - une composante ```Address``` standard qui peut être utilisée pour fournir une adresse postale à laquelle les services devraient être livrés.

source: ```deliveryLocation``` - a new block consisting of GeoJSON and Gazetteer entries to describe a wider range of locations to which the contract line item relates.
es: ```deliveryLocation``` - un nuevo bloque que consiste de entradas de GeoJSON y Gazetteer para describir una gama más amplia de ubicaciones con las que se relacionan los artículos enlistados de un contrato.
fr: ```deliveryLocation``` - une nouvelle composante constituée de GeoJSON et d'entrées Gazetteer (index géographique) pour décrire un ensemble plus large de lieux auxquels l'élément du marché se rapporte.

source: It also creates a [new gazetteer codelist](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/codelist_usecase2.csv).
es: También crea una [nueva lista de códigos de gazetteer](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/codelist_usecase2.csv).
fr: Elle crée également une [nouvelle nomenclature gazetteer](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/codelist_usecase2.csv).

source: **Advantages of this approach**
es: **Ventajas de este acercamiento**
fr: **Avantages de cette approche**

source: It captures a wide range of possible location specifications, including point locations, polygons and lines (useful for roads projects, extractives concessions etc.)
es: Captura una amplia gama de especificaciones de posibles ubicaciones, incluyendo puntos, polígonos y líneas (útil para proyectos de caminos, concesiones extractivas, etc.)
fr: Elle permet de prendre en compte une large palette de spécifications de lieux possibles, notamment des points, des polygones et des lignes (utile pour les projets de route, les concessions extractives, etc.)

source: Delivery Address information provides information that can be used for both geocoding, and for logistics fulfilment;
es: La información sobre la Dirección de Entrega provee información que puede usarse tanto para geo codificar como para cumplimiento logístico;
fr: L'information sur le lieu de livraison fournit de l'information qui peut être utilisée pour géocoder mais aussi à des fins logistiques ;

source: It allows different locations to be specified for different line items;
es: Permite que se especifiquen distintas ubicacones para distintos artículos enlistados;
fr: Elle permet de spécifier différents lieux pour les différents livrables sur lesquels porte le marché ;

source: **Disadvantages/limitations of this approach**
es: **Desventajas/limitaciones de este acercamiento**
fr: **Inconvénients et limites de cette approche**

source: Locations are only specified for ```items```, not at the overall tender, contract or award level. In some cases this may lead either to location data being duplicated across items, or ambiguity about which item the location information should apply to;
es: Las ubicaciones sólo se especifican para ```artículos```, no al nivel de toda la licitación, contrato o adjudicación. En algunos casos esto puede llevar a que los datos de localización se dupliquen en varios artículos o ambigüedad sobre para cuál artículo debe aplicar la información de ubicación;
fr: Les lieux sont spécifiés uniquement pour les ```items```, pas au niveau de l'ensemble de l'appel d'offres, du marché ou de l'attribution. Dans certains cas, cela peut conduire à ce que les données de localisation soit dupliquées d'un item à l'autre, ou à des ambiguïtés sur l'item auquel s'applique les informations de localisation ;

source: **Background**
es: **Antecedentes**
fr: **Contexte**

source: There are a number of use cases that demand specifying a location for delivery of an item. Discussion can be found in [Issue #26](https://github.com/open-contracting/standard/issues/26).
es: Hay un número de casos que requieren especificar una ubicación para la entrega de un artículo. La discusión se puede encontrar en el [Issue #26](https://github.com/open-contracting/standard/issues/26).
fr: Il y a un certain nombre de cas d'usages qui nécessitent de spécifier une localisation pour la livraison d'un élément. Une discussion en a été faire sur l'[Issue #26](https://github.com/open-contracting/standard/issues/26).

source: Schema patch
es: Parche del esquema
fr: Ajout au schéma

source: The JSON Patch to add location data to the schema can be found in [schema_usecase_2.json](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/schema_usecase_2.json).
es: El parche de JSON para agregar datos de ubicación al esquema se pueden encontrar en [schema_usecase_2.json](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/schema_usecase_2.json).
fr: Le patch JSON pour ajouter des données de localisation au schéma peut être trouvé à [schema_usecase_2.json](https://github.com/open-contracting/implementation-and-extensions/blob/master/proposed_extensions/proposed_location/schema_usecase_2.json).

source: Example usage
es: Ejemplo de uso
fr: Exemple d'utilisation

source: Below is an example of a geolocated item:
es: Debajo se encuentra el ejemplo de un artículo geolocalizado:
fr: Voici ci-dessous un exemple d'élément géolocalisé :

source: If the procurement related to the rebuilding of a road, then the item could also specify more complex geometries such as:
es: Si la licitación se relaciona con la reconstrucción de una carretera, entonces el artículo también podría especificar geometrías más complejas tales como:
fr: Si la commande publique portait sur la reconstruction d'une route, alors l'élément pourrait également spécifier des géométries plus complexes telles que :

source: You can take the contents of the geometry object, excluding the ```geometry``` keyword, and plug this into any GeoJSON tool to see the shape that is described.
es: Puedes tomar los contenidos del objeto geométrico, excluyendo la palabra clave ```geometry``` y agregarlo a cualquier herramienta de GeoJSON para ver la forma que se describe.
fr: Vous pouvez prendre le contenu de l'objet de géométrie, enlever le mot-clé ```geometry``` et le donner à n'importe quel outil utilisant du GeoJSON pour voir la forme qui est décrite.
