Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/index.po
Languages: es, fr

source: Open Contracting Data Standard: Documentation
es: Estándar de Datos de Contrataciones Abiertas: Documentación
fr: Un standard de publication de renseignements sur les processus de passation de marchés publics: Documentation

source: Governments around the world spend an estimated US$9.5 trillion through contracts every year. Yet, contracting information is often unavailable for public scrutiny.
es: Los gobiernos alrededor del mundo gastan un estimado de $9.5 billones de dólares en contratos cada año. Sin embargo, la información sobre los contratos normalmente no está disponible para el escrutinio público.
fr: Le marché mondial des dépenses publiques annuelles est estimé à quelques US$9.5 trillions. Malheureusement très peu de renseignements sur ces contrats sont rendus publics.

source: The Open Contracting Data Standard (OCDS) enables disclosure of data and documents at all stages of the contracting process by defining a common data model. It was created to support organisations to increase contracting transparency, and allow deeper analysis of contracting data by a wide range of users.
es: El Estándar de Datos de Contrataciones Abiertas (OCDS) permite divulgar datos y documentos en todas las etapas del proceso de contratación al definir un modelo de datos común. Fue creado para facilitar que las organizaciones aumenten la transparencia en las contrataciones y permitir y análisis más profundo de los datos de contrataciones por una gama amplia de usuarios.
fr: Le standard OCDS rend possible la divulgation de renseignements sur toutes les étapes du processus de passation de marché public en définissant un modèle commun de publication de données. Le standard OCDS a été créé pour encourager la transparence dans les organismes publics. La transparence est le meilleur outil de lutte contre la collusion et la corruption.

source: The OCDS approach:
es: El enfoque del OCDS:
fr: L'approche OCDS

source: Publish early, and iterate: improving disclosure step-by-step
es: Publicar pronto e iterar: mejorar la divulgación paso a paso
fr: Publier tôt et souvent : en améliorant la divulgation progressivement

source: Simple and extensible JSON structure
es: Una estructura JSON simple y extensible
fr: JSON - Une structure simple et extensible

source: Publish data for each step of the contracting process
es: Publicar datos para cada etapa del proceso de contratación
fr: Divulger des renseignements à chacune des étapes du processus de passation de marché public.

source: Create summary records for an overall contracting process
es: Crear registros resumidos para un proceso de contratación en general
fr: Rassembler toutes les données et tous les documents dans un dossier propre à chaque processus de passation de marché.

source: Re-useable objects: organisations, tender information, line-items, amounts, milestones, documents etc.
es: Objetos re utilizables sobre: organizaciones, información de licitación, artículos enlistados, montos, hitos, documentos, etc.
fr: Objets ré-utilisables: organisations, appel d'offres, ligne-articles, montants, jalons, documents etc.

source: Recommended data and documents at basic, intermediate & advanced levels
es: Datos y documentación recomendados a nivel básico, intermedio y avanzado
fr: Trois niveaux de publication recommandés : De base, Intermédiaire & Avancé

source: Common open data publication patterns
es: Patrones comunes de publicación de datos abiertos
fr: Un gabarit de publication des données commun et ouvert

source: Guidance on improving data collection and data quality
es: Guía para mejorar la recolección y la calidad de los datos
fr: Conseils pour améliorer la qualité des données et les collections de données

source: A growing community of users and range of open source tools
es: Una comunidad creciente de usuarios y una amplia gama de herramientas de código abierto
fr: Une communauté d'usagers en pleine croissance et une panoplie d'outils 'open source'

source: About
es: Acerca de
fr: À propos

source: The Open Contracting Data Standard is a core product of the [Open Contracting Partnership](http://www.open-contracting.org) (OCP).
es: El Estándar de Datos de Contrataciones Abiertas es un producto medular del [Open Contracting Partnership](http://www.open-contracting.org) (OCP)
fr: Le standard OCDS pour les marchés publics est un service offert par [Open Contracting Partnership](http://www.open-contracting.org) (OCP).

source: Version 1.0 of the standard was developed for the OCP by the [World Wide Web Foundation](http://www.webfoundation.org), through a project supported by the [Omidyar Network](http://www.omidyar.com) and the [World Bank](http://www.worldbank.org). Ongoing development is managed by [Open Data Services Co-operative](http://www.opendataservices.coop) under contract to [OCP](http://www.open-contracting.org).
es: La versión 1.0 del estándar fue desarrollado para la OCP por la [World Wide Web Foundation](http://www.webfoundation.org), a través de un proyecto apoyado por [Omidyar Network](http://www.omidyar.com) y el [World Bank](http://www.worldbank.org). El desarrollo en curso es gestionado por [Open Data Services Co-operative](http://www.opendataservices.coop) bajo contrato con la [OCP](http://www.open-contracting.org).
fr: La version 1.0 du standard a été développé pour le partenariat OCP par la société [World Wide Web Foundation](http://www.webfoundation.org), grâce à un projet supporté par la société [Omidyar Network](http://www.omidyar.com) et la Banque Mondiale[World Bank](http://www.worldbank.org). Les développements en cours sont pilotés par la société [Open Data Services Co-operative](http://www.opendataservices.coop) sous contrat avec [OCP](http://www.open-contracting.org).

source: Support
es: Ayuda

source: A [free helpdesk service](support/index.md) is available to support implementation and use of OCDS.
es: Tenemos disponible el [servicio gratuito del equipo técnico](support/index.md) para apoyar en la implementación y uso del OCDS.
fr: Un bureau de support technique gratuit pour l'implantation et l'utilisation du standard OCDS. [free helpdesk service](support/index.md)
