Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/support/credits.po
Languages: fr

source: Appreciation
fr: Appréciation

source: The Open Contracting Data Standards has been developed with the input of many people. We extend our thanks to all the following who have given feedback and input over the course of the initial development project.
fr: La norme OCDS (Open Contracting Data Standards) a été développé avec la contribution de plusieurs personnes. Nous adressons nos remerciements à tous ceux qui ont fourni des renseignements et des rétroactions au cours du projet de développement initial.

source: The Open Contracting Data Standard is a core product of the [Open Contracting Partnership](http://www.open-contracting.org) (OCP). Version 1.0 was developed for the OCP by the [World Wide Web Foundation](http://www.webfoundation.org), through a project supported by the [Omidyar Network](http://www.omidyar.com) and the [World Bank](http://www.worldbank.org). Ongoing development is managed by [Open Data Services Co-operative](http://www.opendataservices.coop) under contract to the Open Contracting Partnership.
fr: La norme OCDS est un produit de base de la société Open Contracting Partnership (OCP). La version 1.0 a été développé pour OCP par la société World Wide Web Foundation (WWWF) via un projet financé par la société Omidyar Network et par la banque mondiale. Le développement en cours est géré par la société Open Data Services Co-operative sous contrat avec la société OCP. [Open Contracting Partnership](http://www.open-contracting.org) (OCP) [World Wide Web Foundation](http://www.webfoundation.org) [Omidyar Network](http://www.omidyar.com) [World Bank](http://www.worldbank.org) [Open Data Services Co-operative](http://www.opendataservices.coop)

source: Core team
fr: L'équipe

source: Core contributors (Version 1.0.1 onwards): Tim Davies, Lindsey Marchessault, Ben Webb, David Raznick, David Carpenter, Edafe Onerhime, Steven Flower.
fr: L'équipe pour la version 1.0.1 et suivantes: Tim Davies, Lindsey Marchessault, Ben Webb, David Raznick, David Carpenter, Edafe Onerhime, Steven Flower.

source: Lead authors (Version 1.0): [Tim Davies](http://www.timdavies.org.uk) ([Web Foundation](http://www.webfoundation.org)) & Sarah Bird ([Aptivate](http://aptivate.org)), with core input from: James McKinney ([Open North](http://opennorth.ca/)), Lindsey Marchessault ([World Bank](http://www.worldbank.org)), Marcela Rozo ([World Bank](http://www.worldbank.org)), Stephen Davenport ([World Bank](http://www.worldbank.org)), Ana Brandusescu, Jose M. Alonso ([Web Foundation](http://www.webfoundation.org)) and Michael Roberts ([Web Foundation](http://www.webfoundation.org)).
fr: Les auteurs principaux de la version 1.0: [Tim Davies](http://www.timdavies.org.uk) ([Web Foundation](http://www.webfoundation.org)) & Sarah Bird ([Aptivate](http://aptivate.org)), with core input from: James McKinney ([Open North](http://opennorth.ca/)), Lindsey Marchessault ([World Bank](http://www.worldbank.org)), Marcela Rozo ([World Bank](http://www.worldbank.org)), Stephen Davenport ([World Bank](http://www.worldbank.org)), Ana Brandusescu, Jose M. Alonso ([Web Foundation](http://www.webfoundation.org)) and Michael Roberts ([Web Foundation](http://www.webfoundation.org)).

source: Contributors
fr: Contributeurs

source: Many more people have been involved in inputting to the standard. Below is a non-exhaustive list of some of those people. Inclusion here is to extend our thanks. It does not imply endorsement by any of those included of the standard.
fr: Beaucoup plus de personnes ont été impliquées dans la création de la norme OCDS. Voici une liste non exhaustive de certaines de ces personnes. Nous remercions sincèrement toutes ces personnes.

source: Standard website design and icons by Neontribe: with thanks to Harry Harold and Heydon Pickering.
fr: Conception du site Web et des icônes par Neontribe : avec nos remerciements à Harry Harold et Heydon Pickering.

source: Thanks to Noé Domínguez , Oscar Montiel, Laura Serghi, Mathieu leduc-Hamel, Michael Lenczner, Isabel Munilla, John Hawkins, Laura Bacon and Owen Scott for inputs into technical and policy development.
fr: Merci à Noé Domínguez , Oscar Montiel , Laura Serghi , Mathieu Leduc-Hamel , Michael Lenczner , Isabel Munilla , John Hawkins , Laura Bacon et Owen Scott pour leur contribution au développement technique et la politique de publication.

source: Many thanks also to those who contributed to the user research: Antonio Acuna, Steve Addler, Ivan Begtin, Bibhusan Bista, Eduardo Bohórquez, Mathieu Carlier, Andrew Clarke, Kami Dar, Eva Vozárová, Kami Dar, Daniel Dudis, Mihály Fazekas, Dustin Homer, John Jordan, Jeff Kaplan, Charles Kenny, Ian Makgill, Habibullah Muqbel, Seember Nyager, Meike Paetzold, Pascal Robichaud, Claire Schouten, Tom Sisti; Chris Taggart; as well as all those who participated in Open Contracting Data related events and meetings in Montreal, Washington, Berlin, Kathmandu, Mexico, and online; and all those who wished to remain anonymous; for their invaluable input and feedback into the demand assessment process.
fr: Un grand merci également à ceux qui ont contribué à la recherche de cas d'utilisation: Antonio Acuna, Steve Addler, Ivan Begtin, Bibhusan Bista, Eduardo Bohórquez, Mathieu Carlier, Andrew Clarke, Kami Dar, Eva Vozárová, Kami Dar, Daniel Dudis, Mihály Fazekas, Dustin Homer, John Jordan, Jeff Kaplan, Charles Kenny, Ian Makgill, Habibullah Muqbel, Seember Nyager, Meike Paetzold, Pascal Robichaud, Claire Schouten, Tom Sisti; Chris Taggart; ainsi que tous ceux qui ont participé à des événements et réunions sur les données ouvertes à Montréal , Washington, Berlin, Katmandou , au Mexique et en ligne; et tous ceux qui ont souhaités rester anonyme; pour leur précieuse contribution et la rétroaction dans le processus d'évaluation du processus de mise en concurrence.
