Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/support/history_and_development.po
Languages: fr

source: History of OCDS
fr: Histoire de la norme OCDS Standard de divulgation de renseignements sur le processus de passation de marchés publics.

source: <span class="lead">The [Open Contracting Global Principles](http://www.open-contracting.org/global_principles) encourage publishers to proactively disclose information and data on all stages of public contracting.</span>
fr: <Span class = "lead " > Les principes généraux du partenariat pour la transparence dans les processus de passation de marchés publics, [Open Contracting Global Principles](http://www.open-contracting.org/global_principles) encouragent les éditeurs à divulguer proactivement des renseignements et des données sur toutes les étapes de leur processus passation des marchés publics . </ Span>

source: <span class="lead">The **Open Contracting Data Standard (OCDS)** has been developed to allow information providers to share as much of this information as possible as **structured, re-usable, standardised data**.</span>
fr: <span class="lead"> La norme ouverte OCDS a été développée pour permettre organismes publics de partager autant possible des informations structurées, réutilisables et normalisées. </span>

source: Support and funding
fr: Support et financement

source: The OCDS is a core product of the [Open Contracting Partnership](http://www.open-contracting.org).
fr: La norme OCDS est le produit de base d'un partenariat nommé: [Open Contracting Partnership](http://www.open-contracting.org).

source: The 1.0 Release Candidate of a data specification, as part of the standard, was developed through a rapid prototyping project. The project was undertaken by the by the [World Wide Web Foundation](http://www.webfoundation.org) and [World Bank](http://www.worldbank.org), and supported by [The Omidyar Network](http://www.omidyar.com/) and the [World Bank](http://www.worldbank.org).
fr: La version 1.0 de la norme OCDS a été développée grâce à un projet de prototypage rapide. Le projet a d'abord été entrepris par la fondation : [World Wide Web Foundation](http://www.webfoundation.org) conjointement avec la Banque Mondiale : [World Bank](http://www.worldbank.org) et a été financé par la société : [The Omidyar Network](http://www.omidyar.com/) et par la Banque mondiale : [World Bank](http://www.worldbank.org).

source: Final adoption, and future development and support for the specification is managed through the independent Open Contracting Partnership.
fr: L'adoption finale de la norme OCDS, le développement futur et l'assistance technique est assuré par la société: Open Contracting Partnership.

source: Development process
fr: Processus de développement

source: The development of the 1.0 Release Candidate specification took place through a year-long process of supply and demand-side research, and open consultation. This processes has included:
fr: Le développement de la spécification de cette première version 1.0 est le résultat d'une année de recherche sur l'offre et la demande des processus d'approvisionnement et de consultation ouverte. Ce processus a inclus :

source: **Assessing data currently supplied through contract portals** - in order to understand the data that governments currently hold and publish, and how it is structured. To carry out this analysis we created the [Contracting Data Comparison tool](http://ocds.open-contracting.org/opendatacomparison/), and [mapped](http://ocds.open-contracting.org/opendatacomparison/datamap/) the fields of data available from a wide range of existing government contracting data portals around the world.
fr: **Évaluation des données actuellement publiées sur les sites web des organismes** - afin de comprendre la structure des données publiées par les gouvernements et pour mener à bien cette analyse, nous avons créé un outil de comparaison de données avec lequel nous avons cartographié un large éventail de données publiées sur les processus de passation de marché et de mise en concurrence, présentement disponibles sur le web mondial. [Contracting Data Comparison tool](http://ocds.open-contracting.org/opendatacomparison/), et [mapped](http://ocds.open-contracting.org/opendatacomparison/datamap/)

source: **Exploring demand for contracting data** - through field work, interviews and online engagement with different communities and individuals who many use of contract information. The information needs of users were catalogued, and fed into the requirements for the specification structure and fields. We developed a series of priority use cases to guide implementation and adoption of the specification. [Read the demand-side assessment](https://docs.google.com/document/d/1zdgqSf-LUFVxO6Y_7v1cQf7l0vx35-p502jAI49JRmQ/edit?usp=sharing)
fr: ** Exploration de la demande pour des données sur les marchés publics** - par le travail sur le terrain, des entrevues et des discussions en ligne avec les différentes communautés et les individus dont beaucoup utilisent des informations sur les marchés publics. Les besoins d'information des utilisateurs ont été catalogués et introduits dans les exigences relatives à la structure et la spécification des champs. Nous avons développé une série de cas d'utilisation prioritaires pour guider la mise en œuvre et l'adoption de la spécification. Lire l'évaluation de la demande: [Read the demand-side assessment](https://docs.google.com/document/d/1zdgqSf-LUFVxO6Y_7v1cQf7l0vx35-p502jAI49JRmQ/edit?usp=sharing)

source: **Iterative, open development** - we offered transparency, and gained broad feedback to improve the specification by offering early releases for comment ([alpha](http://ocds.open-contracting.org/standard/r/0__2__0/) and [beta](http://ocds.open-contracting.org/standard/r/0__3__2/)) and by maintaining a [public issue tracker](https://github.com/open-contracting/standard/issues). We engaged contracting, open-data, and other stakeholders through mailing lists and other online spaces. Finally, development sprints held at PyCon Montreal and PyCon Europe 2014 also actively contributed to the development of the specification.
fr: **Un développement ouvert et itératif** - nous avons travaillé en toute transparence et reçu une belle rétroaction pour améliorer la spécification en offrant les premières versions pour commentaires et en maintenant un traqueur d'incidents. Nous avons impliqué les communautés de données ouvertes, les entités contractantes et d'autres parties prenantes par le biais des listes de diffusion et autres espaces en ligne. Enfin, les sprints de développement tenue à PyCon Montréal et PyCon Europe 2014 a également contribué activement à l'élaboration du cahier des charges.

source: Over [150 people](credits.md) have provided comments, feedback and input into the specification over the year of initial development.
fr: Plus de 150 personnes ont fourni des commentaires et et recommandations à porter au cahier des charges au cours de l'année du développement initial. [150 people](credits.md)

source: The development process has been taken place with reference to the [Greentree Consensus Principles for Digital Development](http://ict4dprinciples.org/).
fr: Notre processus développement était inspiré des principes de consensus proposés par: [Greentree Consensus Principles for Digital Development](http://ict4dprinciples.org/).

source: Development stages
fr: Phases de développement

source: The specification has moved through a number of stages.
fr: Le cahier des charges a évolué à travers un certain nombre d'étapes.

source: **research** (November 2013 - May 2014) - User requirements gathered, and existing data supply explored. Technical options for the specification considered and consulted on.
fr: L'étape de la recherche ( Novembre 2013 - mai 2014) - Les besoins des utilisateurs sont réunis et l'offre de données existantes explorée. Les différentes options techniques pour la spécification sont examinées et consultées sur .

source: **alpha** (June 2014) - An [outline data model was shared](http://ocds.open-contracting.org/standard/r/0__2__0/), and high-level concepts outlined for consultation. Design of individual field-level specifications began.
fr: La cahier de charges Alpha ( Juin 2014) - Une première ébauche de modèle de données a été partagée pour consultation. Début des spécifications au niveau des champs de données. [outline data model was shared](http://ocds.open-contracting.org/standard/r/0__2__0/)

source: **beta** (September 2014) - A proposed schema, including field-level definitions was put forward, and opened for consultation. The schema is ready for early-adopters to validate and pilot. Feedback suggested a number of substantial changes.
fr: Le cahier de charges Beta (Septembre 2014) - Un schéma proposé , y compris les définitions de champs a été proposé ouvert à la consultation. Le schéma est prêt pour les premiers adoptants pour validation et un projet pilote. La rétroaction a suggéré un certain nombre de changements substantiels.

source: **release candidate** (November 2014) - The specification is close to its final form and out for final review. Changes will be minor, and any major proposals for change will be managed through [extensions](../schema/conformance_and_extensions.md) until the next version update process.
fr: ** Release candidate ** ( Novembre 2014) - Le cahier des charges est proche de sa forme finale et pour l'examen final. Les changements seront mineurs, et toutes les grandes propositions de changement seront traitées par le protocole des extensions au standard. [extensions](../schema/conformance_and_extensions.md)

source: **release** (July 2015) - The initial version (1.0) was released with minor bug fixes.
fr: **release** (Juillet 2015) - La version initiale ( 1.0) a été publiée avec des corrections de bugs mineurs.

source: At present, the OCDS specification is not submitted to any formal standards body, but this will be reviewed by the Open Contracting Partnership as part of future governance developments.
fr: À l'heure actuelle , la norme OCDS n'est soumise à aucun organisme officiel de normalisation, mais cela sera examiné par la société 'Open Contracting Partnership' dans le cadre de l'évolution future de sa gouvernance.

source: Future development
fr: Développements futurs

source: This is a living standard, and will continue to evolve based on the feedback of publishers and users.
fr: OCDS est une norme vivante qui continuera d'évoluer en fonction des besoins et commentaires des éditeurs et des utilisateurs.

source: Governance proposals for the future development of the Open Contracting Data Standard, including the technical specification and policies around its adoption are currently under development and proposals for governance will draw upon the [Open Stand](http://open-stand.org/) ‘Modern Paradigm for Standards’ which calls for openness, transparency and clearly set out process for change management.
fr: Les propositions de gouvernance pour le développement futur de la norme OCDS, y compris les spécifications techniques et les politiques autour de leur adoption sont actuellement en développement et des propositions pour la gouvernance vont tirer parti du paradigme moderne de gestion des normes, qui appelle à l'ouverture, à la transparence et qui énonce clairement un processus de gestion du changement. [Open Stand](http://open-stand.org/) ‘Modern Paradigm for Standards’

source: Ongoing feedback and suggested improvements to OCDS can be provided through the [issue trackers](https://github.com/open-contracting/standard/issues) on GitHub.
fr: La rétroaction continue et les améliorations proposées à la norme OCDS peuvent être soumises sur le traqueur d'incidents GitHub. [issue trackers](https://github.com/open-contracting/standard/issues)

source: Announcements about proposed updates to the specification, and periods for comment, will be made to the [standard-discuss@open-contracting.org](https://groups.google.com/a/open-contracting.org/forum/#!forum/standard-discuss) mailing list.
fr: Les annonces concernant les mises à jour proposées à la norme OCDS et les périodes de commentaires se font sur le forum de discussions Google. [standard-discuss@open-contracting.org](https://groups.google.com/a/open-contracting.org/forum/#!forum/standard-discuss)
