Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/support/index.po
Languages: fr

source: Support and governance
fr: Assistance et gouvernance

source: The Open Contracting Data Standard help-desk is available to support you in implementing or using OCDS, and to assist in the ongoing development of the standard.
fr: Le bureau d'assistance technique sur la norme OCDS (Open Contracting Data Standard) est disponible pour vous accompagner dans la mise en œuvre de votre processus de publication et dans l'utilisation de la norme. Le bureau d'assistance technique contribue également au développement continu de la norme.

source: If are are planning to publish or use data using the Open Contracting Data Standards then the OCDS help-desk team are on hand to offer advice and input.
fr: Si vous envisagez de publier ou d'utiliser les données sous la norme OCDS, l'équipe du bureau d'assistance technique est à votre disposition pour des conseils et des réponses à toutes vos questions.

source: We can:
fr: Nous pouvons:

source: Help you identify approaches for converting data from your existing systems to OCDS;
fr: Vous aider à identifier des approches pour convertir les données de vos systèmes existants à la norme OCDS;

source: Suggest existing tools and services which may help you public or use OCDS data;
fr: Proposer des outils et des services qui peuvent vous aider à utiliser les données publiques existantes ou les données de la norme OCDS;

source: Provide guidance on mapping your data structures to the standard;
fr: Fournir des conseils pour cartographier vos structures de données à la norme OCDS;

source: Give you feedback on draft data files, and support with validation of your data;
fr: Vous donner des commentaires sur vos projets de données à publier et du soutien à la validation de vos données ;

source: Through funding from the Open Contracting Partnership, this support is provided free of charge.
fr: Grâce au financement provenant de l'organisme 'Open Contracting Partnership', cette assistance technique vous est fournie gratuitement.

source: E-mail <a href="mailto:data@open-contracting.org">data@open-contracting.org</a> with your questions, and a member of the help-desk team will be in touch with you soon.
fr: Envoyez un mail: <a href="mailto:data@open-contracting.org">data@open-contracting.org</a> avec vos questions et un membre de l'équipe d'assistance technique sera bientôt en contact avec vous.

source: The Open Contracting community is also a good source of input and support. You can ask questions, discuss ideas for using the standard, and share news on your projects on the [standard-discuss@open-contracting.org](https://groups.google.com/a/open-contracting.org/forum/#!forum/standard-discuss) mailing list.
fr: La communauté OCDS une bonne source d'assistance et de soutien. Vous pouvez poser des questions, discuter de sujets sur l'utilisation de la norme et partager des nouvelles sur vos projets sur le forum de discussion Google: [standard-discuss@open-contracting.org](https://groups.google.com/a/open-contracting.org/forum/#!forum/standard-discuss)

source: Announcements about proposed updates to the specification, and periods for comment, will be made to the mailing list.
fr: Les annonces concernant les mises à jour proposées à la norme OCDS et les périodes de commentaires seront faites sur cette liste de diffusion .

source: Developers, or those wishing to provide technical input on the standard, may wish to go straight to the [Github repository](https://github.com/open-contracting/standard).
fr: Les développeurs et ceux qui souhaitent apporter une contribution technique à la norme, souhaiteront peut-être aller directement au dépôt Github. [Github repository](https://github.com/open-contracting/standard)
