Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/support/tools.po
Languages: fr

source: Tools
fr: Outils

source: There are a growing number of tools available to support implementation of OCDS.
fr: Il y a un nombre croissant d'outils disponibles pour soutenir la mise en œuvre de la norme OCDS.

source: Tools developed by the core team will be available at [https://github.com/open-contracting/](https://github.com/open-contracting/).
fr: Les outils développés par l'équipe seront disponibles au dépôt GitHub: [https://github.com/open-contracting/](https://github.com/open-contracting/).

source: Core tools
fr: Outils de base

source: OCDS Validator
fr: Le validateur OCDS

source: The OCDS validator can be found at [http://standard.open-contracting.org/validator/](http://standard.open-contracting.org/validator/) and can be used to:
fr: Le validateur OCDS peut être trouvé à cette adresse: [http://standard.open-contracting.org/validator/](http://standard.open-contracting.org/validator/) et peut être utilisé pour :

source: Check releases and records against the JSON OCDS schema;
fr: Vérifiez les publications et les dossiers contre le schéma JSON OCDS ;

source: Provide basic statistics on the data contained within OCDS files;
fr: Fournir des statistiques de base sur les données contenues dans les fichiers OCDS ;

source: Convert between flat and structured JSON formats.
fr: Convertir entre format de fichiers aplanis et le format JSON structuré.

source: OCDS Merge
fr: La fusion OCDS

source: This python library provides functions to merge a list of OCDS Releases into either a compiledRelease or a versionedRelease needed to create an OCDS record.
fr: Cette bibliothèque de routines en language python fournit des fonctions pour fusionner une liste de publications OCDS soit dans un 'compiledRelease soit dans un 'versionedRelease' nécessaire pour créer un Dossier OCDS.

source: ```ocdsmerge``` is available as a python package, [or on GitHub](https://github.com/open-contracting/ocds-merge) along with usage instructions.
fr: Un paquet python ```ocdsmerge``` est disponible et aussi sur le dépôt GitHub avec les instructions d'utilisation: [or on GitHub](https://github.com/open-contracting/ocds-merge)

source: Community tools
fr: Outils de la communauté

source: We will be developing a list of community developed tools which consume or produce OCDS data here.
fr: Nous allons maintenir une liste d'outils développés par la communauté qui consomment ou produisent des données OCDS ici.

source: In the meantime, please share suggestions for tools with the mailing list.
fr: Entre temps, s'il vous plaît partagez vos suggestions d'outils sur la liste de diffusion .

source: Archived tools
fr: Outils archivés

source: A number of older tools, created during the development of the standard, can be found in the [Open Contracting Archive github organization](https://github.com/open-contracting-archive).
fr: Un certain nombre d'anciens outils, créés en cours d'élaboration de la norme, peuvent être trouvée sur le dépôt GitHub: [Open Contracting Archive github organization](https://github.com/open-contracting-archive).
