Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/building_blocks.po
Languages: es

source: Building Blocks
es: Bloques para armar

source: In mapping your data to OCDS, or using OCDS data, you will encounter a number of common data structures.
es: Al mapear tus datos al OCDS o al utilizar datos de OCDS, encontrarás una serie de estructuras comunes de datos.

source: Sections and structure
es: Secciones y estructura

source: An OCDS document is made up of a number of sections. In the procurement case, the main sections are:
es: Un documento de OCDS está hecho de una serie de secciones. En el caso de una licitación las secciones principales son:

source: **meta-data** - contextual information about each release of data;
es: **meta datos** - información contextual sobre cada entrega de los datos;

source: **buyer** - information about the key public party;
es: **comprador** - información sobre la parte pública clave;

source: **planning** - information about the goals, budgets and projects a contracting process relates to;
es: **planeación** - información sobre las metas, presupuestos y proyectos con los que se relaciona un proceso de contratación;

source: **tender** - information about how a tender will take place, or has taken place;
es: **licitación** - información sobre cómo se llevará a cabo o se llevó a cabo una licitación

source: **awards** - information on awards made as part of a contracting process;
es: **adjudicaciones** - información sobre adjudicaciones como parte de un proceso de contratación;

source: **contract** - information on contracts signed as part of a contracting process;
es: **contrato** - información sobre contratos firmados como parte de un proceso de contratación;

source: **implementation** - information on the progress of each contract towards completion.
es: **implementación** - información sobre el progreso de cada contrato a su término.

source: These are represented in a JSON document as follows:
es: Estos se representan en un documento JSON de la siguiente manera:

source: Awards and contracts are arrays of objects, whereas tender is an object. This is because of a contracting process has a single initiation stage, but can result in multiple awards and contracts.
es: Adjudicaciones y contratos son matrices de objectos, mientras que el licitador es un objeto. Esto se debe a que el proceso de contratación tiene una sola fase de iniciación pero puede resultar en múltiples adjudicaciones y contratos.

source: Building blocks: fields
es: Bloques para armar: campos

source: The OCDS schema sets out the fields that should be included in each section, making use of simple re-usable building blocks (field structures) to represent data.
es: El esquema del OCDS presenta los campos que deberían incluirse en cada sección, utilizando bloques simples y reutilizables (estructuras de los campos) para representar los datos.

source: For example, common building blocks are provided for:
es: Por ejemplo, se presentan bloques comunes para:

source: **Organizations**
es: **Organizaciones**

source: **Amounts**
es: **Montos**

source: **Items**
es: **Artículos**

source: **Time periods**
es: **Períodos de tiempo**

source: **Documents**
es: **Documentos**

source: **Milestones**
es: **Hitos**

source: Examples
es: Ejemplos

source: Using building blocks
es: Utilizando los bloques

source: These building blocks may be used in various different sections. For example, **items** can occur in tender (to indicate the items that a buyer wishes to buy), in an award object (to indicate the items that an award has been made for) and in a contract object (to indicate the items listed in the contract).
es: Estos bloques pueden utilizarse en distintas secciones. Por ejemplo, **artículos** puede ocurrir en la licitación (para indicar los artículos que un comprador quiere adquirir), en un objeto de adjudicación (para indicar los artículos para los que se ha hecho la adquisición) y en un objeto de contrato (para indicar los artíiculos enlistados en el contrato).

source: In addition to these building blocks, the OCDS schema sets out the specific ways they can be used in each section, and describes a number of additional fields that can appear in specific section. For example, fields for:
es: Adicional a estos bloques, el esquema de OCDS presenta las formas específicas que se pueden utilizar en cada sección y describe una cantidad de campos adicinoales que pueden aparecer en una sección específica. Por ejemplo, campos para:

source: ```titles``` and ```descriptions``` of tenders, awards and contracts
es: ```titles``` y ```descriptions``` de licitaciones, adjudicaciones y contratos

source: Many of these fields make use of lightweight codelists provided by OCDS.
es: Varios de estos campos utilizan listas de códigos ligeras provistas por el OCDS.

source: Field level mapping
es: mapeo sobre el terreno

source: The Open Contracting Data Standard helpdesk maintain a [field-level mapping template](http://www.open-contracting.org/resources/ocds-field-level-mapping-template/) that can be used to cross-walk between your internal data systems and OCDS.
es: El soporte técnico del Estándar de Datos para las Contrataciones Abiertas mantiene un [modelo de mapeo sobre el terreno] (http://www.open-contracting.org/resources/ocds-field-level-mapping-template/) que se puede usar para mapear sus sistemas de datos internos al OCDS.

source: Codelists
es: Listas de códigos

source: OCDS defines two kinds of codelist:
es: El OCDS define dos tipos de listas de códigos:

source: **Closed codelists** provide a fixed list of values. When using a field with a closed codelist, publishers must use an option from the published lists. This supports the global comparability of OCDS data on key dimensions.
es: Las **Listas de código cerradas** proveen una lista fija de valores. Cuando se utiliza un campo con una lista de código cerrada, los publicadores deben utilizar una opción de las listas publicadas. Esto ayuda a la que los datos del OCDS sean comparables en dimensiones clave.

source: **Open codelists** provide recommended values. However, publishers can suggest amendments to these codelists, or provide their own extended values prefixed with x_.
es: Las **Listas de código abiertas** proveen valores recomendados. Sin embargo, los publicadores pueden sugerir correcciones a estas listas de códigos, o aportar sus propios valores extendidos precedidos por x_.

source: **Open Codelists**
es: **Listas de código abiertas**

source: Item Classification Scheme
es: Sistema de Clasificación de Artículos

source: Organization Identifier Scheme
es: Sistema de Identificación de Organizaciones

source: Document Type
es: Tipo de Documento

source: Award Criteria
es: Criterios de Adjudicación

source: Submission Method
es: Método de Presentación

source: **Closed Codelists**
es: **Listas de código cerradas**

source: Release Tag
es: Etiqueta de entrega

source: Initiation Type
es: Tipo de Inicio

source: Method
es: Método

source: Tender Status
es: Estado de la Licitación

source: Award Status
es: Estado de la Adjudicación

source: Contract Status
es: Estado del Contrato

source: Milestone Status
es: Estado de Momento Clave

source: Currency
es: Moneda

source: Codelist values are case sensitive strings. Canonical codelist labels are in English, but we are working towards providing translated labels. [Contact the helpdesk](../support/index.md) for information on adding a new translation.
es: Los valores de las listas de códigos son cadenas de caracteres sensibles a mayúsculas y minúsculas. Las etiquetas de las listas de códigos canónicas están en inglés, pero estamos trabajando en tener disponibles etiquetas traducidas. [Contacta a soporte técnico](../support/index.md) para más información sobre cómo agregar una nueva traducción.

source: Publishers should map their existing classification systems to OCDS codes wherever possible. Many closed codelist fields are paired with a detail field where more detailed classification information can be provided.
es: Los publicadores deberían mapear sus sistemas de clasificación a códigos de OCDS donde sea posible. Varios campos de listas de código cerradas tienen un campo de detalle donde hay más información detallada sobre la clasificación.

source: In the EU, contracts can be initiated through a number of different procedures including:
es: En la UE, los contratos se pueden iniciar a través de una serie de procesos distintos, incluyendo:

source: Open procedure;
es: Procedimiento abierto;

source: Restricted procedure;
es: Procedimiento restringido;

source: Competitive procedure with negotiation;
es: Procedimiento competitivo con negociación;

source: Competitive dialogue; and
es: Diálogo competitivo; y

source: Innovation partnership
es: Asociación para la Innovación

source: However, to support comparison across continents, the main OCDS procurement method code list is a closed codelist with three values based on [GPA definitions](http://www.wto.org/english/docs_e/legal_e/rev-gpr-94_01_e.htm):
es: Sin embargo, para facilitar la comparación entre continentes, la lista de códigos del método principal de licitación es una lista cerrada con tres valores basados en las [definiciones de la ACP](http://www.wto.org/english/docs_e/legal_e/rev-gpr-94_01_e.htm):

source: **open** - a procurement method whereby all interested suppliers may submit a tender
es: **abierto** - un método de licitación donde todos los proveedores interesados pueden presentarse a licitar

source: **selective** - a procurement method whereby only qualified suppliers are invited by the procuring entity to submit a tender
es: **selectiva** - un método de licitación donde sólo proveedores calificados son invitados por la entidad contratante para presentarse a licitar

source: **limited** - a procurement method whereby the procuring entity contacts a supplier or suppliers of its choice
es: **limitada** un método de licitación donde la entidad contratante contacta a un proveedor o proveedores de su elección

source: In our experience, most procedures can map to one of these categories.
es: En nuestra experiencia, la mayoría de los procedimientos pueden mapearse con una de estas categorías

source: To publish OCDS data, an EU publisher with data categorised by EU procedures should map the longer list of procedures to the narrower OCDS codelist and provide the codelist value in the ```procurementMethod``` field. They can then provide the more detailed procedure type in an extended ```procurementMethodDetails``` field.
es: Para publicas datos del OCDS, un publicador de la UE con datos categorizados por procedimientos de la UE debería mapear la lista más larga de los procedimientos a la lista de códigos reducida de la OCDS y proveer el valor de la lista de códigos en el campo ```procurementMethod ```. Pueden proveer más detalles sobre el tipo de procedimiento en un campo de ```procurementMethodDetails ```.

source: For an Open Procedure, when a free-text justification of why the procedure was chosen is available, this would end up as:
es: Para una Licitación Abierta, cuando está disponible una justificación de texto libre de por qué se eligió dicho procedimiento, se mostraría así:
