Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/contracting_process.po
Languages: es, fr

source: The Contracting Process
es: El Proceso de Contratación
fr: Le processus de passation de marché

source: There are several stages to a contracting process.
es: Hay varias etapas para un proceso de contratación
fr: Il y a plusieurs étapes dans le processus de passation de marché.

source: OCDS covers:
es: El OCDS cubre:
fr: OCDS couvre :

source: **Planning**<br/> *Including:*<br/> Budgets<br/> Project plans<br/> Procurement plans<br/> Market studies<br/> Public hearing info<br/>
es: **Planificación**<br/> *Incluyendo:*<br/> Presupuestos<br/> Planes de proyecto<br/> Planes de contratación<br/> Estudios de mercado<br/> Información de audiencias públicas<br/>
fr: **La planification du marché**<br/> *Comprenant :*<br/> Budgets<br/> Plans du projets<br/> Plans d'achat<br/> Etudes de marché<br/> Informations issues d'audiences publiques<br/>

source: ![Tender](../../../assets/green_tendering.svg.png)
es: ![Licitación](../../../assets/green_tendering.svg.png)

source: **Initiation (Tender)**<br/> *Including:*<br/> Tender notices<br/> Specifications<br/> Line items<br/> Values<br/> Enquiries
es: **Iniciación (Licitación)**<br/> *Incluyendo:*<br/> Anuncios de licitación<br/> Especificaciones<br/> Partidas<br/> Importes<br/> Consultas
fr: **Lancement (appel d'offres)**<br/> *Comprenant :*<br/> Avis d'appels d'offre<br/> Spécifications<br/> Lignes de dépense<br/> Montants<br/> Modalités de demandes de renseignements

source: ![Award](../../../assets/green_awarded.svg.png)
es: ![Adjudicación](../../../assets/green_awarded.svg.png)

source: **Award**<br/> *Including:*<br/> Details of award<br/> Bidder information<br/> Bid evaluation<br/> Values
es: **Adjudicación**<br/> *Incluyendo:*<br/> Detalles de la adjudicación<br/> Información sobre el licitante<br/> Evaluación de la licitación<br/> Importes
fr: **Attribution**<br/> *Comprenant :*<br/> Détails de l'attribution<br/> Informations sur les candidats<br/> Evaluation des candidatures <br/> Montants

source: ![Contract](../../../assets/green_signed.svg.png)
es: ![Contrato](../../../assets/green_signed.svg.png)

source: **Contract**<br/> *Including:*<br/> Final details<br/> Signed contract<br/> Amendments<br/> Values
es: **Contrato**<br/> *Incluyendo:*<br/> Detalles finales<br/> Contrato firmado<br/> Enmiendas<br/> Importes
fr: **Le contrat**<br/> *Comprenant :*<br/> Détails finaux<br/> Contrat signé<br/> Avenants<br/> Montants

source: ![Implementation](../../../assets/green_implementation.svg.png)
es: ![Implementación](../../../assets/green_implementation.svg.png)

source: **Implementation**<br/> *Including:*<br/> Payments<br/> Progress updates<br/> Location<br/> Extensions<br/> Amendments<br/> Completion or Termination info
es: **Implementación*<br/> *Incluyendo:*<br/> Pagos<br/> Actualizaciones de progreso<br/> Ubicación<br/> Extensiones<br/> Enmiendas<br/> Información sobre la Realización o Terminación
fr: **Execution du marché**<br/> *Comprenant :*<br/> Paiements<br/> Avancements du projet <br/> Lieux concernés<br/> Extensions<br/> Avenants<br/> Informations sur la réalisation ou la résiliation

source: Not all contracting processes have all stages. For example, direct contracting may start with the award of a contract. However, there will still be information that can be disclosed about the budgets, specifications and selection process even in this case.
es: No todos los procesos de contratación tiene todas las etapas. Por ejemplo, la contratación directa puede iniciar con la adjudicación de un contrato. Sin embargo, aún habrá información que puede divulgarse sobre presupuestos, especificaciones y el proceso de selección incluso en este caso.
fr: Certains marchés publics ne passent pas par toutes les étapes du processus. Par exemple, un marché par entente directe peut commencer avec l'attribution du marché. Néanmoins, même dans ce cas, il y a des informations qui peuvent être divulguées sur les budgets, les spécifications et le processus de sélection.

source: You should aim to publish OCDS data close to real-time: releasing data as each stage of a contracting process takes place.
es: Debes apunta a publicar datos de OCDS cerca al tiempo real: liberar datos conforme ocurre cada etapa del proceso de contratación.
fr: Vous devriez viser une publication des données OCDS proche du temps réel en diffusant des données à chaque étape du processus de passation de marché.

source: This may involve generating output from a range of different systems. Data published from different systems can be tied together by use of a common Open Contracting ID (```ocid```).
es: Esto puede significar generar datos de una serie de sistemas diferentes. Los datos publicados desde sistemas distintos pueden unirse por el uso de un Open Contracting ID (```ocid```).
fr: Cela peut demander de produire des données provenant de différents systèmes. Les données publiés depuis différents systèmes peuvent être liées entre elles en utilisant des identifiants communs Open Contracting ID (```ocid```).

source: Defining a contracting process
es: Definiendo un proceso de contratación
fr: Définir le processus de passation de marché

source: For public procurement OCDS defines a unique contracting process as:
es: Para la licitación pública el OCDS define un proceso único de contratación como:
fr: Pour les marchés publics, OCDS définit un processus unique de passation de marché comme :

source: All the planning, tendering information, awards, contracts and contract implementation information related to a single initiation process.
es: Toda la planeación, información de licitación, adjuricaciones, contratos e información de la implementación de un contrato relacionado con un único proceso de inicio.
fr: Toutes les informations concernant un seul processus d'initiation de marché : planification, appel d'offre, attribution, contrat, exécution du marché.

source: An initiation process may be a tender, a direct contract award, or a call to award a concession.
es: Un proceso de inicio puede ser una licitación, una adjudicación directa o un llamado a adjuricar una concesión.
fr: Le processus de lancement du marché peut être réalisé par un appel d'offre, un marché à entente directe ou un appel à attribution de concession.

source: The Open Contracting ID (ocid)
es: El Open Contracting ID (ocid)
fr: L'identifiant Open Contracting ID (ocid)

source: Each unique contracting process should be assigned an ```ocid```. This is an identifier which can be used to join up data between different stages (as often the data may be stored in different systems).
es: A cada proceso único de contrato debe asignarse un ```ocid```. Este es un identificador que puede ser usado para unir datos entre distintas etapas (puede ocurrir que los datos estén almacenados en sistemas distintos).
fr: Chaque processus de passation de marché doit être assigné à un ```ocid```. C'est un identifiant qui peut être utilisé pour associer des données produites à différentes étapes (comme, souvent, les données sont stockées dans différents systèmes).

source: To make sure the ```ocid```s assigned by two different publishers do not clash, publishers are encouraged to register a publisher prefix. This can be prepended onto locally generated identifiers, giving a globally unique identifier, and allowing disparate data sources to confidently refer to a unique contracting process.
es: Para asegurarse de que los ```ocid```s asignados por dos publicadores distintos no chocan, se fomenta que los los publicadores registren un prefijo de publicador. Esto puede ser agregado a identificadores generados localmente, dando un identificador único globar y permitiendo que fuentes discrepantes de datos se refieran de manera segura a un proceso único de contratación.
fr: Pour s'assurer que les identifiants ```ocid``` assignés par deux différents producteurs de données n'entrent pas en conflit, nous encourageons les producteurs de données à enregistrer un préfixe. Ce préfixe peut être inséré avant des identifiants générés localement afin de donner un identifiant unique global et de s'assurer que des sources de données disparates se référent bien au même processus de passation de marché.

source: You can [register your ocid prefix here](../implementation/registration.md).
es: Puedes [registrar tu prefijo de ocid aquí](../implementation/registration.md).
fr: Vous pouvez [enregistrer votre préfixe ocid ici](../implementation/registration.md).

source: In [Mexico City](http://www.contratosabiertos.cdmx.gob.mx/), an initial mapping identified that identifiers were assigned to each tender process or direct award, using a pattern based on the initials or name of the department involved, a tender or contract number, and the year.
es: En la [Ciudad de México](http://www.contratosabiertos.cdmx.gob.mx/), un mapeo inicial encontró que los identificadores se asignaban a cada proceso de licitación o adjudicación directa utilizando un patron basado en las iniciales o nombre de la dependencia involucrada, un número de contrato o licitación y el año.
fr: Pour [la ville de Mexico](http://www.contratosabiertos.cdmx.gob.mx/), un travail de cartographie initial a permis de repérer que les identifiants étaient assignés pour chaque appel d'offres ou chaque attribution directe à partir des initiales ou du nom du département impliqué, du numéro de l'offre ou du contrat et de l'année.

source: For example:
es: Por ejemplo:
fr: Par exemple :

source: These identifiers uniquely identify each contracting process. Fields and business processes to capture these identifiers at each contracting process stage were added to the relevant systems.
es: Estos identificadores dan un identificador único a cada proceso de contratación. Los campos y procesos de gestión para capturar estos identificadores en cada etapa del proceso de contratación se agregaron a los sistemas relevantes.
fr: Ces identifiants identifient exclusivement chaque processus de passation de marché. Les champs et les processus dans les systèmes métiers ont été modifiés pour intégrer ces identifiants à chaque phase du processus de passation de marché.

source: Mexico City then registered a prefix with the OCDS helpdesk. They have been given the prefix 'ocds-87sd3t' which can be added to their unique process identifiers to give a globally unique ocid.
es: Posteriormente la Ciudad de México registró un prefijo con el equipo de soporte técnico. Ellos le dieron el prefijo 'ocds-87sd3t' que puede agregarse a sus identificadores únicos de procesos para otorgar un ocid único globalmente.
fr: La ville de Mexico a ensuite enregistré son préfixe avec le bureau d'assistance technique OCDS. Le préfixe ‘ocds-87sd3t’ leur a été assigné. Il peut être ajouté à leurs identifiants internes uniques pour obtenir l'identifiant unique et global ocid.

source: All the award notices, contracts and transactions resulting from the tender with this identifier should also share this ocid - allowing Mexico City to bring together a complete picture of each contracting process.
es: Todas las notificaciones de adjudicación, contratos y transacciones resultantes de la licitación con este identificador también deberá compartir este ocid - permitiéndole a la Ciudad de México construir una imagen completa de cada proceso de contratación.
fr: Tous les avis d'attributions, contrats et transactions résultant de l'appel d'offre avec cet identifiant doivent aussi partager cet ocid ce qui permet à la ville de Mexico d'obtenir une image complète de chaque processus de passation de marché.

source: The ```ocid``` is case sensitive. Case should be used consistently whenever an ```ocid``` is presented.
es: El ```ocid``` es distingue entre mayúsculas y minúsculas. El uso de éstas debe de usarse consistentemente cuando se utilice un ```ocid```.
fr: L'identifiant ```ocid``` tient compte de la casse. La casse doit être utilisée de manière uniforme dès qu'un ```ocid``` est présenté.

source: Mapping your systems
es: Mapeando sus sistemas
fr: Cartographier vos systèmes

source: The Open Contracting Data Standard helpdesk provide [a technical assessment template](http://www.open-contracting.org/resources/ocds-technical-assessment-template/) that can be used to identify the different systems involved in managing data on each stage of the contracting process.
es: El soporte técnico del Estándar de Datos para las Contrataciones Abiertas provee un [modelo de evaluación técnica](http://www.open-contracting.org/resources/ocds-technical-assessment-template/) que se puede usar para identificar los sistemas diferentes involucrados en el mantenimiento de datos en cada etapa del proceso de contratación.
fr: L'assistance technique OCDS fournit [un modèle d'évaluation technique](http://www.open-contracting.org/resources/ocds-technical-assessment-template/) qui peut être utilisé pour identifié les différents systèmes impliqués dans la gestion des données à chaque étape du processus de passation de marché.

source: Extending OCDS
es: Extendiendo el OCDS
fr: Etendre OCDS

source: Version 1.0 of the OCDS schema is optimised for procurement-type contracts.
es: La versión 1.0 del esquema del OCDS está optimizado para contratos que utilizaron una licitación.
fr: La version 1.0 du schéma OCDS est optimisée pour des contrats de type marché public.

source: However, using extensions OCDS can also be used to model other kinds contracting process.
es: Sin embargo, utilizar extensiones del OCDS también puede usarse para modelar otros tipos de procesos de contratación.
fr: Cependant, en utilisant des extensions, OCDS peut s'adapter à d'autres formes de commande publique.

source: [Contact the helpdesk](../support/index.md) for support to model your contracting processes using OCDS.
es: [Contacta al equipo de soporte técnico](../support/index.md) para obtener apoyo para modelar tus procesos de contratación utilizando OCDS.
fr: [Contactez notre assistance technique](../support/index.md) pour obtenir de l'aide dans la modélisation de votre processus de passation de marché avec OCDS.
