Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/index.po
Languages: es, fr

source: Getting Started
es: Para empezar
fr: INTRODUCTION

source: OCDS is an open data standard for publication of structured information on all stages of a contracting process: from planning to implementation.
es: El OCDS es un estándar de datos abiertos para la publicación de información estructurada en todas las etapas de un proceso de contratación: desde la planeación hasta la implementación.
fr: OCDS est un standard de données ouvertes pour la publication d'information structurée couvrant toutes étapes du processus d'octroi et de gestion des contrats publics, allant de la planification à la réalisation et la reddition de comptes finale.

source: The publication of OCDS data can enable greater transparency in public contracting, and can support accessible and in-depth analysis of the efficiency, effectiveness, fairness, and integrity of public contracting systems.
es: La publicación de datos del OCDS puede posibilitar mayor transparencia en las contrataciones públicas y puede facilitar un análisis accesible y profundo de la eficiencia, efectividad, legitimidad e integridad de los sistemas de contrataciones públicas.
fr: La publication de données selon le standard OCDS permettra une meilleure transparence dans la gestion des comptes publics. Le standard OCDS permettra des analyses comparatives internationales des différents systèmes d'octroi et de gestion des projets d'acquisitions d'infrastructures publiques.

source: OCDS was designed with a focus on public procurement of goods, works and services, but can be extended for use in other contexts. Extensions for Public Private Partnership (PPP) and Extractives concessions are under development.
es: El OCDS fue diseñado con un enfoque en las licitaciones públicas de bienes, obras y servicios, pero puede extenderse para su uso en otros contextos. Las extensiones para Asociaciones Público Privadas (APP) y Concesiones extractivas se encuentran en desarrollo.
fr: Le standard OCDS vise particulièrement les processus d'approvisionnement en marchandises, en travaux et en services. Le standard OCDS peut être étendu à d'autres contextes. Des extensions au standard sont en préparation pour couvrir les contrats en partenariat public privé (PPP) et les concessions minières.

source: To get started publishing OCDS data:
es: Para comenzar a publicar datos en el OCDS:
fr: Pour commencer la publication de vos données selon le standard OCDS

source: Discuss the key [users and use cases](use_cases.md) for your OCDS project
es: Discute quiénes son los [usuarios y casos de uso](use_cases.md) claves para tu proyecto de OCDS
fr: Établir la liste des utilisateurs et des cas d'utilisation de vos projets OCDS

source: Identify out the data and documents you will publish from your [contracting process](contracting_process.md)
es: Identifica los datos y documentos que publicarás de tu [proceso de contratación](contracting_process.md)
fr: En lien avec votre processus d'approvisionnement, identifier les données et les documents qui seront publiés.

source: Map your data against the OCDS [building blocks](building_blocks.md)
es: Mapea tus datos en contraste con los [bloques para armar](building_blocks.md) del OCDS
fr: Établir la correspondance entre vos données à publier et les composantes du standard OCDS

source: Present the data in [JSON releases and records](releases_and_records.md)
es: Presenta los datos en [entregas y registros en JSON](releases_and_records.md)
fr: Présenter vos données en format JSON

source: Publish your data on the web using the [publication patterns](publication_patterns.md)
es: Publica tus datos en la red utilizando los [patrones de publicación](publication_patterns.md)
fr: Publier vos données sur le web en utilisant le gabarit de publication

source: Check the [validation of your data](validation.md)
es: Revisa la [validación de tus datos](validation.md)
fr: Valider la cohérence de votre publication avec l'outil proposé:

source: Encourage and facilitate stakeholder use of the data
es: Fomenta y facilita el uso de los datos por grupos de interés
fr: Encouragez les différentes parties prenantes à l'utilisation de vos données et facilitez leur la tâche

source: When you are done you could be producing data that looks something like the contract release below, which is compatible with a growing range of OCDS aware tools (you will encounter a range of different OCDS release types in the following pages).
es: Cuando termines podrás producir datos que se ven similares a la entrega del contrato que está debajo, el cual es compatible con una creciente cantidad de herramientas que toman en cuenta el OCDS (encontrarás una amplia gama de publicaciones en las próximas páginas).
fr: Votre publication devrait ressembler à l'exemple donné ci-dessous. Ce format de publication est supporté par un nombre grandissant d'outils OCDS que vous allez découvrir dans les pages qui suivent.
