Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/publication_patterns.po
Languages: es, fr

source: Publication Patterns
es: Patrones de Publicación
fr: Modèles de publication

source: OCDS supports a 5 ☆ approach to publishing Open Contracting data on the web. Each step builds on the steps before.
es: El OCDS utiliza un esquema de 5 ☆ para la publicación de datos de Contrataciones Abiertas en la red. Cada paso se desarrolla sobre los pasos previos.
fr: OCDS promeut une approche en 5 ☆ de la publication de données sur la commande publique sur le web. Chaque étape se fonde sur les étapes qui la précèdent.

source: **☆ Upload basic contracting data and documents to web**
es: **☆ subir datos y documentos básicos de contrataciones a la red**
fr: **☆ Mettez en ligne sur le web des données et des documents de base sur la commande publique**

source: Whether or not you can adopt a common standard right now, you should make sure important notices and documents are freely accessible online.
es: Puedas o no adoptar un estándar comun ahora mismo, debes de asegurarte de que los avisos y los documentos importantes estén accesibles en línea.
fr: Même si vous ne pouvez pas adopter un standard commun maintenant, vous devriez vous assurer que les avis et les documents importants soient librement accessibles en ligne.

source: **☆ ☆ Provide machine-readable data**
es: **☆ ☆ Hacer accesibles datos legibles por computadora**
fr: **☆ ☆ Fournir des données lisibles par les machines**

source: Providing data about your contracting processes in CSV files or other structured formats makes it easier for others to analyse.
es: Poner disponibles datos sobre tus procesos de contratación en archivos CSV u otros formatos estructurados, hace su análisis más sencillo para otros.
fr: En fournissant des données à propos de vos processus de commande publique dans des fichiers CSV ou d'autres formats structurés, d'autres peuvent plus facilement les analyser.

source: *If you jump straight to 3 ☆ publication, you can generate flattened CSV versions of your data using the OCDS flatten tool.*
es: *si vas directamente a la publicación de 3 ☆, puedes generar versiones planas de tus datos en CSV utilizando la herramienta del OCDS.*
fr: *Si vous passez directement à la publication en 3☆, vous pouvez générer un fichier CSV aplati en utilisant l'outil "OCDS flatten".*

source: **☆ ☆ ☆ Use the OCDS standard**
es: **☆ ☆ ☆ Utilizar el estándar de OCDS**
fr: **☆ ☆ ☆ Utiliser le standard OCDS**

source: Producing bulk releases and records packages using the OCDS standard makes your data easier to re-use and join-up with other contracting data.
es: Hacer entregas de datos en volumen utilizando el estándar de OCDS hace que tus datos sean más fáciles de re utilizar y juntar con otros datos de contrataciones.
fr: En produisant des livraisons brutes et des paquets d'archives utilisant le standard OCDS, vos données deviennent plus faciles à réutiliser et à relier à d'autres données sur la commande publique.

source: **☆ ☆ ☆ ☆ Provide API access to data**
es: **☆ ☆ ☆ ☆ Otorga acceso a los datos a través de un API**
fr: **☆ ☆ ☆ ☆ Fournir un accès par interface de programmation aux données**

source: Providing each release and record at it's own persistent URI improves the usability of your data. Providing APIs helps users locate the information they are looking for quicker, and enables third-parties to build more advanced and responsive services on your data.
es: Dar acceso a cada entrega y registro en su propia URI unívoca mejora la usabilidad de tus datos. Tener acceso a APIs le permite a los usuarios localizar la información que buscan más rápidamente y permite a terceros construir servicios más avanzados y responsivos basados en tus datos.
fr: Fournir un identifiant permanent de ressource URI pour chaque livraison et chaque archive permet d'améliorer l'usabilité de vos données. Fournir des API aide les usagers à localiser plus rapidement les informations qu'ils cherchent et permet à des tierces parties de construire des services plus avancés et adaptés à partir de vos données.

source: **☆ ☆ ☆ ☆ ☆ Provide joined-up data**
es: **☆ ☆ ☆ ☆ ☆ Provee datos interconectados**
fr: **☆ ☆ ☆ ☆ ☆ Lier des données**

source: Adding links to your contracting data, connecting out to other datasets on project planning, public spending or company registrations, adds further value to your data, enabling new kinds of re-use.
es: Agregar enlaces a tus datos de contrataciones, conectándolos a otros conjuntos de datos sobre planeación de proyectos, gasto público o registros de compañías le agrega aún más valor a tus datos, permitiendo nuevas formas de reuso.
fr: Ajouter des liens à vos données de commande publique, les connecter à d'autres jeux de données sur la planification des projets, les dépenses publiques ou les registres d'entreprises donne plus de valeur à vos données et rend possible de nouvelles formes de réutilisation.

source: Packaging releases and records
es: Empaquetado de entregas y registros
fr: Packager des livraisons et des archives

source: When publishing releases and records, they must be provided within a release or record package. These act as an envelope for the data.
es: Cuando se publican entregas de datos y registros, deben de venir dentro de un paquete de datos o registros. Estos funcionan como un envoltorio para los datos.
fr: Quand des livraisons et des archives sont publiées, ils doivent être fournies à l'intérieur d'un package de livraisons ou d'archives qui agissent comme une enveloppe pour les données.

source: A package provides information on:
es: Un paquete provee información sobre:
fr: Un package fournit des informations sur :

source: Where the data can be accessed (a URI)
es: Dónde se pueden encontrar los datos (una URI)
fr: Où accéder aux données (un identifiant uniforme de ressource URI)

source: The publisher of the data
es: El publicador de los datos
fr: Le fournisseur des données

source: The date of publication
es: La fecha de publicación
fr: La date de publication

source: The license the data is provided under
es: La licencia con la cual se hacen disponibles los datos
fr: La licence sous laquelle les données sont publiées

source: Links to a publication policy and further documentation
es: Enlaces a una política de publicación y mayor documentación
fr: Les liens vers une politique de publication et la documentation complémentaire

source: A package may contain a single release or record, or may be used to publish a collection of releases, or a collection of records.
es: Un paquete puede contener una sola entrega de datos o registros o puede utilizarse para publicar un grupo de entregas o registros.
fr: Un package peut contenir une seule livraison ou une seule archive ou il peut être utilisé pour publier une collection de livraisons ou une collection d'archives.

source: Consult the [release package](../../../schema/release_package/) and [record package](../../../schema/record_package/) schemas to package up your data.
es: Consulta los [esquemas entregas de datos] (../../../schema/release_package/) y [registros] (../../../schema/record_package/) para empaquetar sus datos.
fr: Consultez les schémas du [package de livraisons](../../../schema/release_package/) et du [package d'archives](../../../schema/record_package/) to packager vos données.

source: Example release package
es: Ejemplo de entrega de datos
fr: Exemple de package de livraisons

source: Bulk and individual files
es: Archivos individuales y en conjuntos completos
fr: Fichiers en bloc et individuels

source: For 4 ☆ publication, you should:
es: Para la publicación de 4☆ debes:
fr: Pour une publication 4 ☆, vous devez :

source: Ensure all documents referenced in OCDS releases are available online;
es: Asegurarte de que todos los documentos referidos en las entregas datos de OCDS están disponibles en línea;
fr: Vous assurer que tous les documents référencés dans des livraisons OCDS sont disponibles en ligne ;

source: Publish each release and record at it's own persistent URL;
es: Publicar cada entrega de datos y registro con su propia URL unívoca;
fr: Publier chaque livraison et archive à son adresse URL permanente ;

source: Additionally, produce bulk packages of releases and records for users to download;
es: Adicionalmente, produce conjuntos completos de entregas y registros para que los usuarios descarguen;
fr: En plus, produire des packages en bloc de livraisons et d'archives pour que les utilisateurs les téléchargent ;

source: Additionally, produce 'flat' versions of the data for users to access in CSV for Excel formats
es: Adicionalmente, produce versiones 'planas' de los datos para que los usuarios puedan accederlas en CSV para los formatos de Excel
fr: Par ailleurs, produire des versions "à plat" des données pour que les usagers y accèdent en CSV ou en format tableur

source: You will need to make decisions about how to segment the data in bulk files, so that files are easy for users to work with.
es: Tendrás que tomar decisiones sobre cómo segmentar los datos en los conjuntos completos, de manera que sea fácil trabajar con dichos archivos.
fr: Vous devrez décider comment segmenter les données en des fichiers en vrac pour faciliter le travail des usagers.
