Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/releases_and_records.po
Languages: es

source: Releases and Records
es: Datos y Registros

source: There are two kinds of OCDS document:
es: Hay dos tipos de documento de OCDS:

source: **Releases** provide updates on each event in a contracting process, ideally in real-time. They can be used to notify users of new tenders, awards, contracts and other updates. One contracting process may have many releases.
es: **Entregas** proveen actualizaciones de cada evento en un **proceso de contratación**, idealmente en tiempo real. Pueden usarse para notificar a usuarios nuevas licitaciones, adjudicaciones, contratos, y otras actualizaciones. Un proceso de contratación puede tener muchas entregas.

source: **Records** compile together all the information known about a contracting process, providing a snapshot view of it's current state. They can also contain a versioned history of changes over time. There should only be one record for each contracting process, created by merging together the releases.
es: **Registros** compilan toda información conocida sobre un proceso de contratación, proveyendo una visión instantánea de su estado actual. Pueden contener también un historial versionado a lo largo del tiempo. Debería haber un solo registro para cada proceso de contratación, creado por fusionar las entregas.

source: Releases
es: Entregas

source: Releases should be immutable objects, presenting information about a particular event in the lifetime of a contracting process.
es: Las entregas deben de ser objetos inmutables, presentando información sobre un evento particular en la duración de un proceso de contratación.

source: Each release must contain an OCID, a unique release ID, a release tag, and as much information as can be provided for users to understand the event taking place.
es: Cada entrega debe de contener un OCID, un ID único de entrega, una etiqueda de entrega y tanta información como se pueda proveer a los suarios para entender el evento que está ocurriendo.

source: For example:
es: Por ejemplo:

source: A ```planning``` release may provide information in the planning section about budgets and procurement intention, and the tender section about the proposed details for a future tender;
es: Una entrega de ```planeación``` puede dar información sobre presupuestos e intención hacer una adquisición en la sección de planeación y la sección de licitación acerca de los detalles para una licitación futura;

source: A ```tender``` release may provide information in the tender section about how to bid for the work, and may repeat ```planning``` information on the budget or project the tender is associated with;
es: Una entrega de ```licitación``` puede dar información en la sección de licitación sobre cómo ofertar para ese trabajo y puede repetir información de ```planeación``` sobre el presupuesto o el proyecto con el que se asocia la licitación;

source: A ```tenderUpdate``` release may provide an updated tender section with links to documents that answer questions asked during the enquiry period;
es: Una entrega de ```tenderUpdate``` puede mostrar una sección de licitación actualizada con enlaces a documentos que dan respuesta a las preguntas hechas durante el período de consulta;

source: An ```award``` release may provide details of the supplier awarded the contract in the award section, and may provide repeated information about the how procurement took place in the tender section;
es: Una entrega de ```award ``` puede dar detalles del proveedor ganador del contrato en la sección de adjudicación y puede dar información recurrente sobre cómo se llevó a cabo la adquisición en la sección de licitación;

source: A ```contract``` release may provide the details of the signed contract in a contract section, matched with a related award section;
es: Una entrega de ```contrato``` puede dar detalles sobre la firma del contrato en la sección sobre el contrato, enlazado a la sección de adjudicación;

source: An ```implementationUpdate``` release may repeat details of the contract, and provide information on milestones achieved and payments to the supplier, or may update the contract implementation section with links to newly published documents.
es: Una entrega de ```implementationUpdate ``` puede reiterar detalles del contrato y proveer información sobre hitos alcanzados y pagos al proveedor; o puede actualizar la sección de implementación del contrato con enlaces a documentos publicados recientemente.

source: You can think of **releases** as entries into a ledger: each new entry adds information, and may also repeat the previous information that remains true.
es: Puedes pensar en las **entregas ** como accesos a un libro de compras: cada nueva entrada agrega información y puede repetir información previa que sigue siendo teniendo información fidedigna.

source: Examples
es: Ejemplos

source: Best practices
es: Mejores prácticas

source: In some cases, releases will all come from the same backend system. In others, they will be generated by different systems. By ensuring all releases about a contracting process share an OCID, they can be tied together into a record.
es: En algunos casos, las entregas vienen del mismo sistema. En otras ocasiones se generarán por distintos sistemas. Al asegurarse de que todas las entregas de contrataciones tienen un mismo OCIs, se pueden unir en un mismo registro.

source: In a complete OCDS implementation, each release would be published at its own persistent URL, and kept online permanently.
es: En una implementación completa del OCDS, cada entrega se publicaría con su propia URL unívoca y mantenida ahí permanentemente.

source: In these cases, where publishers are providing a single URI for fetching information on a given contracting process, the releaseID and releaseDate must be modified whenever updated data is published. A suggested pattern is to append an incrementing number to the end of the OCID in order to generate a unique releaseID for every change. For example:
es: En estos casos donde los publicadores proveen una sola URI para traer la información sobre un proceso de contratación dado, le releaseID y el releaseDate deben de modificarse cuando se actualicen los datos. Un patrón que se sugiere es anexar un número que incrementa al final del OCID para generar un releaseID único para cada cambio. Por ejemplo:

source: Records
es: Registros

source: An OCDS **record** provides a snapshot of the contracting process at a given point in time, bringing together all the information from the releases to date into one place. It is updated as new information becomes available.
es: Un **registro** del OCDS provee una visión instantánea del proceso de contratación en un momento dado, reuniendo toda la información de las entregas hasta el momento en un solo lugar. Este se actualiza conforme se hace disponible nueva información.

source: At a minimum, a record should exist for each contracting process to provide a list of all the releases that relate to that contracting process.
es: Como mínumo, debe existir un registro para cada proceso de contratación que provea una lista de todas las entregas relacionadas con ese proceso de contratación.

source: However, to allow users to get a snapshot view the contracting process without individually looking up each release , a record should also contain:
es: Sin embargo, para permitir a los usuarios tener una vista instantánea del proceso de contratación sin tener que ver cada entrega, un registro debe contener también:

source: a compiledRelease block, which follows the release schema, and is updated with the most up-to-date value for each field; and, optionally,
es: un bloque de compiledRelease, que sigue el siguiente esquema de entrega y se actualiza con el valor más actualiada para cada campo. Opcionalmente,

source: a versionedRelease, which contains a history of all the changes for each field.
es: un versionedRelease, que contiene un historial de todos los cambios para cada campo.

source: The [OCDS merge strategies](../schema/merging.md) set out how to combine multiple releases to create a single record for each contracting process.
es: Las [estrategias de fusión del OCDS](../schema/merging.md) muestra cómo combinar múltiples entregas para crear un sólo **registro** para cada **proceso de contratación**.
