Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/use_cases.po
Languages: es, fr

source: Users and use cases
es: Usuarios y casos de uso
fr: Utilisateurs et cas d'utilisation

source: Open data is a means, not an end in itself. The first stage of any work with OCDS is to consider who will use the data that is produced, and which fields and features of the data are important to them.
es: Los datos abiertos son un medio, no un fin en sí mismos. La primera etapa de cualquier trabajo con el OCDS es considerar quién utilizará los datos que se produzcan y qué campos y características de los datos son importantes para ellos.
fr: Le concept de données ouverte est un moyen et non une fin en soi. La première étape du processus de publication de données ouverte est de considérer les utilisateurs éventuels et l'information qui pourrait leur être utile et significative.

source: In designing OCDS, we explored a range of different user needs and use cases for data on contracting.
es: Al diseñar el OCDS exploramos una serie de distintas necesidades de usuario y casos de uso para los datos de contrataciones.
fr: Dans le processus de conception du standard OCDS, les besoins et les cas d'utilisation suivants ont été considérés

source: We focussed on four main groups of user need:
es: Nos enfocamos en cuatro grupos principales de necesidades de usuarios:
fr: Nous avons retenu quatre groupes de besoins principaux

source: Achieving value for money for government
es: Lograr un buen precio-calidad para el gobierno
fr: Optimisation des ressources dans les organismes publics

source: Strengthening the transparency, accountability and integrity of public contracting
es: Fortalecer la transparencia, rendición de cuentas y la integridad de las contrataciones públicas
fr: Renforcer la transparence, la responsabilisation et l'intégrité des organismes publics en lien avec leurs processus d'approvisionnement.

source: Enabling the private sector to fairly compete for public contracts
es: Permitir que el sector privado compita limpiamente por contratos públicos
fr: Permettre au secteur privé d'obtenir de façon honnête des contrats publics.

source: Monitoring the effectiveness of service delivery
es: Monitorear la efectividad de la prestación de servicios
fr: Mesurer la qualité et l'efficacité des services rendus

source: Some user needs are served by direct access to bulk data. To meet other user needs will require tools built on top of OCDS data, providing interfaces, visualisation, and links to spaces where users can engage with contracting bodies and data publishers.
es: Algunas necesidades de los usuarios se atienden al dar acceso a los datos en volumen. Para poder atender olas necesidades de otros usuarios se requerirán herramientas construidas sobre datos del OCDS, proveyendo interfaces, visualización y enlaces a espacios donde los usuarios puedan involucrarse con órganos contratantes y publicadores de datos.
fr: Un accès aux données brutes répondra aux besoins de certains utilisateurs. Pour d'autres des outils de visualisation, des interfaces et des espaces de collaboration entre les entités contractantes seront nécessaires.

source: You can read more about how people around the world are using OCDS, and other contracting data, on the Open Contracting Partnership website. <!-- TODO: Add links -->
es: Puedes leer más sobre cómo se está usando el OCDS y otros datos de contrataciones alrededor del mundo, en el sitio del Open Contracting Partnership. <!-- TODO: Add links -->
fr: Pour en connaître d'avantage sur l'utilisation du standard OCDS à travers le monde allez sur le site Open Contracting Partnership <!-- TODO: Add links -->

source: As you start implementing OCDS, consider how you will engage with data users, and how you will ensure the data and documents you make available will meet their needs.
es: Conforme comiences a implementar el OCDS, considera cómo vas a interactuar con los usuarios de los datos y cómo te asegurarás de que los datos y documentos que hagas disponibles sean adecuadas a sus necesidades.
fr: En préparation à la mise en oeuvre du standard de publication OCDS considérer les utilisateurs potentiels et comment vos publications répondront à leurs besoins

source: Four example use cases
es: Cuatro usos de caso de ejemplo
fr: Quatre cas d'utilisation

source: Value for money in procurement
es: Relación precio-calidad en adquisiciones
fr: Obtention du meilleur rapport qualité/prix

source: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Open contracting data can help officials to get good value for money on the goods and services in the procurement process, and can also help in identifying whether value for money has been achieved in concluded contracts.
es: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Los datos abiertos de contrataciones pueden ayudar a los servidores públicos a obtener un buen precio-calidad en los bienes y servicios en el proceso de adquisición, además puede ayudar a identificar si se ha obtenido un buen precio-calidad en contratos concluidos.
fr: <span style="float:right">![Person](../../../assets/icon_user.png)</span> Les données ouvertes publiées au standard OCDS peuvent permettre aux fonctionnaires de mesurer les rapport qualité/prix des biens et services achetés par comparaison avec d'autres entités contractantes.

source: These users want to analyze trends in prices and supplier performance, including in terms of quality and duration.
es: Estos usuarios quieren analizar tendencias en los precios y desempeño del proveedor, incluyendo en términos de calidad y duración.

source: Comparable data using common codelists and the availability of unit prices are particularly important for value for money use cases.
es: Datos comparables usando listas de códigos comunes y la disponibilidad de precios son particularmente importantes para caso de precio-calidad.
fr: Les données ouvertes publiées au standard OCDS utilisant des listes communes et codifiées de produits et services permettent des comparaisons de prix, un élément essentiel à l'optimisation du processus d'approvisionnement.

source: Detecting fraud and corruption
es: Deterctar fraude y corrupción
fr: Détecter les cas de fraudes, collusion et corruption

source: <span style="float:right">![Person](../../../assets/icon_user.png)</span>All stakeholders (civil society, the private sector, government and donors) have an interest in identifying and combating corruption in public contracting. Open contracting data can be used to scrutinize procurement documents and data for ‘red flags’ that might indicate public monies are being mis-used.
es: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Todos los grupos de interés (sociedad civil, sector privado, gobierno y donantes) están interesados en identificar y combatir la corrupción en contrataciones públicas. Los datos abiertos de contratación pueden utilizarse para escudriñar documentos de adquisiciones y datos para identificar señales de alerta que indiquen que se está haciendo mal uso de fondos públicos.
fr: <span style="float:right">![Person](../../../assets/icon_user.png)</span> Toutes les parties prenantes, la société civile, l'industrie, les gouvernements, les mécènes ont intérêts à identifier et combattre la corruption dans l'octroi et la réalisation des projets d'infrastructures publiques. Les données ouvertes publiées au standard OCDS permettent de scruter les données et documents d'appel d'offres et de détecter des indices de malversation.

source: There are two main approaches to fraud and corruption monitoring. A ‘micro’ approach closely scrutinizes individual procurements.
es: Hay dos aproximaciones al monitoreo de fraude y corrupción. Un acercamiento 'micro' escudriña de cerca adquisiciones individuales.
fr: Il y a deux approches pour surveiller corruption, collusion et fraudes. L'approche 'micro' qui analyse par le menu détail les projets d'approvisionnement publics.

source: A ‘systemic’ approach looks for suspicious patterns, and makes links between datasets to map out networks of funding, ownership and interests.
es: Una aproximación 'sistémica' busca patrones sospechosos y hace conexiones entre datasets para mapear redes de financiamiento, propiedad e intereses.
fr: L'approche 'systemic' qui travaille au niveau de l'ensemble des jeux de données pour détecter des réseaux de financement, de propriétaires et d'intérêts particuliers

source: Data that can be linked up using globally unique identifiers for companies is particularly important for fraud and corruption detection use cases.
es: Los datos que se pueden enlazar utilizando identificadores únicos globales para las compañías particularmente importante para casos de detección de fraude y corrupción.
fr: L'identifiant unique des parties prenantes et des fournisseurs est particulièrement utile pour pour détecter les liens entre les différents intervenants.

source: Competing for public contracts
es: Competencia por contratos públicos
fr: Une compétition honnête pour l'obtention de contrats publics

source: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Open contracting data can be used by private firms to understand the potential pipeline of procurement opportunities. It is a core principle of open contracting that information should be made available at the early stages of a contracting process, including information on planned procurement, and invitations for tenders.
es: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Los datos de contrataciones abiertas se pueden usar por empresas privadas para entender las fuentes de oportunidades de adquisiciones. Es un principio central a las contrataciones abiertas que la información se haga disponible desde las etapas iniciales del proceso de contratación, incluyendo información sobre la adquisición planeada e invitaciones a licitar.
fr: <span style="float:right">![Person](../../../assets/icon_user.png)</span> Les données ouvertes au standard OCDS peuvent être utilisées par les entrepreneurs pour surveiller les opportunités offertes par les marchés publics. Le concept fondamental du 'Open Contracting' est de rendre publique, dès la première phase du processus d'approvisionnement, toute l'information concernant le projet envisagé.

source: Information on past contracts can allow firms to identify upcoming opportunities for re-contracting, and can support a more competitive marketplace, as transparency creates a level playing field with information on pricing, contract dates and key deliverables.
es: La información sobre contratos anteriores puede permitir a las empresas identificar oportunidades próximas oportunidades para re contratar y puede respaldar un mercado más competitivo, ya que la transparencia crea igualdad de condiciones con información sobre precios, fechas de contratación y entregables clave.
fr: Les données publiques concernant les projets antérieurs permettent aux entrepreneurs d'identifier de nouvelles opportunités. L'information sur les prix, les quantités, la qualité et les dates des biens livrables, offre des chances égales à un plus grand nombre d'entrepreneurs. La transparence rend le marché plus ouvert et compétitif.

source: Forward looking and timely information is particularly important for private sector users, as well as being able to uniquely identify procuring entities, geographic locations, sectors, and the kinds of items which are being procured.
es: Tener información oportuna y que permita vislumbrar futuras acciones es particularmente importante para los usuarios del sector privado, al igual que tener la oportunidad de identificar a las entidades contratantes, ubicaciones geográficas, sectores y los tipos de artículos que serán adquiridos.
fr: Voir venir les nouvelles opportunités de contrats publics est un atout important pour les entrepreneurs. Pourvoir identifier les acteurs des marchés publics, leur situation géographique, le genre de produits et services qu'il demandent permet aux entrepreneurs de mieux planifier leurs ressources et éventuellement soumettre de meilleurs prix.

source: Monitoring Service Delivery
es: Monitorear la prestación de servicios
fr: Surveillance des services rendus

source: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Monitoring groups want to ensure that public contracting delivers value to citizens in terms of quality of goods, works, and services provided. To monitor contracting effectively involves being able to link budgets and donor data to the contracts and results. It also involves being able to verify whether results are being delivered on the ground.
es: <span style="float:right">![Persona](../../../assets/icon_user.png)</span>Los grupos que dan seguimiento desean asegurarse de que los contratos públicos cumplan con dar valor a los ciudadanos en términos de calidad de los bienes, obras y servicios provistos. Monitorear efectivamente las contrataciones supone la capacidad de enlazar presupuestos y datos de donantes con los contratos y sus resultados. También implica poder verificar si los resultados se están entregando en el lugar.

source: Data concerning budgets, delivery location and subcontracting arrangements are particularly useful for those involved in contract monitoring.
es: Los datos sobre presupuestos, ubicación de entrega y arreglos de subcontratación son particularmente útiles para aquellos involucrados en el monitoreo de contratos.
fr: Les données concernant les budgets, les adresses de livraison et les contrats de sous-traitance sont particulièrement utile à la surveillance des contrats publics.

source: These users are want to analyze trends in prices and supplier performance, including in terms of quality and duration.
fr: Les données ouvertes publiées au standard OCDS permettent des analyses de tendance dans les prix et de comparer les performance des fournisseurs en terme de qualité du produit final et du respect des délais de réalisation.

source: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Monitoring groups want to ensure that public contracting delivers value to citizens in terms of quality of goods, works, and services provided. The monitor contracting effectively involves being able to link budgets and donor data to the contracts and results. It also involves being able to verify whether results are being delivered on the ground.
fr: <span style="float:right">![Person](../../../assets/icon_user.png)</span>Les groupes de surveillance veulent s'assurer que les biens ont été livrés au bon endroit et sont conformes aux devis en terme de prix, de qualité et de quantité. La reddition de compte doit permettre de relier les données budgétaires du projet avec les coûts de réalisation.
