Repository: Bjwebb/standard-try-break-tests
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/validation.po
Languages: es, fr

source: Validation
es: Validación

source: You can validate your OCDS documents at [standard.open-contracting.org/validator/](http://standard.open-contracting.org/validator/).
es: Puedes validar tus documentos de OCDS en [standard.open-contracting.org/validator/](http://standard.open-contracting.org/validator/)
fr: Vous pouvez valider vos documents au standard OCDS à cette adresse [standard.open-contracting.org/validator/](http://standard.open-contracting.org/validator/).

source: This tool will help you to check whether the JSON files you are producing are technically valid.
es: Esta herramienta te ayudará a revisar si los archivos JSON que estás produciendo son válidos técnicamente.
fr: Cet outil vous permettra de vous assurer que les fichiers JSON que vous publiez sont techniquement valides.

source: However, this is just one step of checking your data.
es: Sin embargo, este es sólo un paso de revisar tus datos.
fr: C'est cependant seulement la première étape de validation de vos données.

source: The OCDS helpdesk team can provide additional support to check the quality of the data you are producing, and to check for other common errors and omissions.
es: El equipo técnico de OCDS puede dar apoyo adicional para revisar la calidad de los datos que estás produciendo y revisar otros errores y omisiones comunes.
fr: Le bureau de support technique OCDS peut vous donner de l'aide additionnelle pour assurer la qualité de vos publications en évitant les erreurs communes et omissions.

source: Quality checks
es: Verificaciones de calidad
fr: Contrôles de qualité

source: Assessing how good your open contracting data is involves a number of elements:
es: Evaluar qué tan buenos son tus datos de contrataciones abiertas implica una serie de elementos:
fr: L'évaluation de la qualité de vos données concernant un processus de passation de marché public implique plusieurs éléments:

source: **Validation** involves a technical check on the way data is structured and formatted. If data is not valid JSON, and does not comply with the OCDS schema, then it cannot be processed by OCDS tools, and will not be interoperable with other data. Providing valid data is an important foundation for interoperable open data.
es: La **Validación** requiere una verificación técnica de cómo están estructurados y organizados los datos. Si los datos no están en un JSON válido y no cumple con el esquema de OCDS, entonces no se puede procesar por herramientas del OCDS y no será interoperable con otros datos. Proveer datos válidos es una base importante para tener datos abiertos inter operables.
fr: **Validation** une vérification technique de la structure et du format. Pour utiliser les outils OCDS et rendre les données interopérables, les données doivent respecter les critères JSON et les schémas OCDS. Publier des données valides est le fondement même de l'interopérabilité des données ouvertes.

source: The OCDS validator can provide an automated pass/fail check on whether data is valid at 3 ☆ level.
es: El validador del OCDS puede dar una verificación éxito/fracaso de si los datos están en un nivel de 3 ☆.
fr: Le validateur OCDS offre un contrôle réussite/échec automatique à trois niveaux

source: **Conformance** involves a detailed check on whether OCDS terms are being used correctly. For example, are you following the field definitions and guidance when entering data, and mapping to the OCDS structure. Conformance involves a human check on how fields are being used, and which extensions to the schema you are using.
es: El **cumplimiento** implica una verificación detallada respecto a si se están utilizando los términos de OCDS correctamente. Por ejemplo si se están siguiendo las guías y definiciones de campos cuando se introducen datos y se está mapeando con la estructura del OCDS. El cumplimiento requiere una verificación por un humano sobre cómo se están usando los campos y qué extensiones del esquema estás usando.
fr: **Conformité** implique que les termes du standard OCDS sont correctement utilisés. Par exemple respectez-vous la définition des champs lors de la saisie des données, la corrélation avec la structure OCDS est-elle valide. La conformité demande l'implication humaine.

source: The OCDS validator provides feedback that can be used to make an initial judgement on conformance. A full judgement requires expert input.
es: El validador de OCDS provee retroalimentación que puede usarse para hacer una opinión inicial sobre cumplimiento. Un dictamen completo requiere participación de un experto.
fr: Le validateur OCDS permet de porter un jugement initial sur la conformité; en final le jugement d'un expert est requis.

source: **Completeness** involves checking which sections and building blocks of OCDS are being used. For example, are you publishing information from every contracting stage, or are you only providing tender or award data; and are you providing detailed identifiers for organisations, or just names.
es: La **integridad** implica revisar cuáles secciones y bloques del OCDS se están utilizando. Por ejemplo, si estás publicando información de cada etapa de la contratación o sólo están proveyendo datos sobre la licitación o la adjudicación; además de si estás presentando identificadores detallados para las organizaciones o sólo los nombres.
fr: **Complétude** implique la vérification des sections et composantes OCDS utilisées. À titre d'exemple, publiez-vous des renseignements sur toutes les phases du processus de passation de marché public ou simplement sur la phase appel d'offre ou adjudication ? Donnez-vous des renseignements détaillés sur les soumissionnaires et adjudicataires ou simplement un nom ?

source: Completeness can be evaluated against the Basic, Intermediate, Advanced framework for OCDS.
es: La integridad puede evaluarse en contraste con los marcos operativos Básico, Intermedio y Avanzado de OCDS.
fr: La complétude des données peut être mesurée en fonction des trois niveaux d'encadrement OCDS : Minimal, Intermédiaire et avancé

source: **Utility** involves checking whether the data is fit for purpose. This involves considering the priority use cases for the data, and considering whether all feasible steps that could increase the re-usablility of the data have been taken. Quality involves considering questions of coherence (do the relationships in the data make sense, and is information logically structured?) and usefulness.
es: La **utilidad** implica verificar si los datos son útiles para su propósito. Esto supone considerar la prioridad de casos de uso para los datos y considerar si se han dado todos los pasos viables que podrían incrementar la facilidad de reuso de los datos. La calidad involucra considerar cuestiones de coherencia (¿las relaciones en los datos tienen sentido y la información está estructurada de manera lógica?) y utilidad.
fr: **Utilité** la données publiée est-elle adapté à l'usage ? Il faut considérer les cas d'utilisation prioritaires et s'assurer que la données sera réutilisable. Les données sont-elles cohérentes et logiquement structurées ?

source: The best way to test the utility of the data is through its successful use for analysis, monitoring and increasing access to contracting information.
es: La mejor manera de probar la utilidad de los datos es a través de su uso exitoso en el análisis, monitoreo y aumento en el acceso a información de contrataciones.
fr: L'utilisation accrue des données pour des analyses comparatives et de veilles concurrentielles démontre l'utilité des données publiées.
